class Ashtothram {
  String title, id;
  String? ashtothram;

  bool isPdf;

  Ashtothram(this.title, this.id, this.ashtothram, {this.isPdf = false});
}

Map<String, Ashtothram> astothrams = {
  'venkateshwarar': Ashtothram(
      'ஶ்ரீ வேங்கடேஶ்வரர்',
      'venkateshwarar',
      "ஓஂ ஶ்ரீ வேங்கடேஶாய நம:\n" +
          "ஓஂ ஶ்ரீனிவாஸாய நம:\n" +
          "ஓஂ லக்ஷ்மீபதயே நம:\n" +
          "ஓஂ அனாமயாய நம:\n" +
          "ஓஂ அம்ருதாஶாய நம:\n" +
          "ஓஂ ஜக³த்³வன்த்³யாய நம:\n" +
          "ஓம் கோ³வின்தா³ய நம:\n" +
          "ஓஂ ஶாஶ்வதாய நம:\n" +
          "ஓஂ ப்ரப⁴வே நம:\n" +
          "ஓஂ ஶேஷாத்³ரினிலயாய நம: (1௦)\n" +
          "\n" +
          "ஓம் தே³வாய நம:\n" +
          "ஓஂ கேஶவாய நம:\n" +
          "ஓஂ மது⁴ஸூத³னாய நம:\n" +
          "ஓஂ அம்ருதாய நம:\n" +
          "ஓஂ மாத⁴வாய நம:\n" +
          "ஓஂ க்ருஷ்ணாய நம:\n" +
          "ஓஂ ஶ்ரீஹரயே நம:\n" +
          "ஓஂ ஜ்ஞானபஞ்ஜராய நம:\n" +
          "ஓஂ ஶ்ரீவத்ஸவக்ஷஸே நம:\n" +
          "ஓஂ ஸர்வேஶாய நம:\n" +
          "\n" +
          "ஓம் கோ³பாலாய நம:\n" +
          "ஓஂ புருஷோத்தமாய நம:\n" +
          "ஓம் கோ³பீஶ்வராய நம:\n" +
          "ஓஂ பரஸ்மை ஜ்யோதிஷே நம:\n" +
          "ஓஂ வ்தெகுண்ட² பதயே நம:\n" +
          "ஓஂ அவ்யயாய நம:\n" +
          "ஓஂ ஸுதா⁴தனவே நம:\n" +
          "ஓஂ யாத³வேன்த்³ராய நம:\n" +
          "ஓஂ நித்ய யௌவனரூபவதே நம:\n" +
          "ஓஂ சதுர்வேதா³த்மகாய நம: (3௦)\n" +
          "\n" +
          "ஓஂ விஷ்ணவே நம:\n" +
          "ஓஂ அச்யுதாய நம:\n" +
          "ஓஂ பத்³மினீப்ரியாய நம:\n" +
          "ஓம் த⁴ராபதயே நம:\n" +
          "ஓஂ ஸுரபதயே நம:\n" +
          "ஓஂ நிர்மலாய நம:\n" +
          "ஓம் தே³வபூஜிதாய நம:\n" +
          "ஓஂ சதுர்பு⁴ஜாய நம:\n" +
          "ஓஂ சக்ரத⁴ராய நம:\n" +
          "ஓஂ த்ரிதா⁴ம்னே நம: (4௦)\n" +
          "\n" +
          "ஓஂ த்ரிகு³ணாஶ்ரயாய நம:\n" +
          "ஓஂ நிர்விகல்பாய நம:\n" +
          "ஓஂ நிஷ்கல்த³ங்காய நம:\n" +
          "ஓஂ நிரான்தகாய நம:\n" +
          "ஓஂ நிரஞ்ஜனாய நம:\n" +
          "ஓஂ விராபா⁴ஸாய நம:\n" +
          "ஓஂ நித்யத்ருப்தாய நம:\n" +
          "ஓஂ நிர்கு³ணாய நம:\n" +
          "ஓஂ நிருபத்³ரவாய நம:\n" +
          "ஓம் க³தா³த⁴ராய நம: (5௦)\n" +
          "\n" +
          "ஓஂ ஶார்-ங்க³பாணயே நம:\n" +
          "ஓஂ நன்த³கினே நம:\n" +
          "ஓஂ ஶங்க³தா⁴ரகாய நம:\n" +
          "ஓஂ அனேகமூர்தயே நம:\n" +
          "ஓஂ அவ்யக்தாய நம:\n" +
          "ஓஂ கடிஹஸ்தாய நம:\n" +
          "ஓஂ வரப்ரதா³ய நம:\n" +
          "ஓஂ அனேகாத்மனே நம:\n" +
          "ஓம் தீ³னப³ன்த⁴வே நம:\n" +
          "ஓஂ ஆர்தலோகாப⁴யப்ரதா³ய நம: (6௦)\n" +
          "\n" +
          "ஓஂ ஆகாஶராஜவரதா³ய நம:\n" +
          "ஓஂ யோகி³ஹ்ருத்பத்³மமன்தி³ராய நம:\n" +
          "ஓம் தா³மோத³ராய நம:\n" +
          "ஓஂ ஜக³த்பாலாய நம:\n" +
          "ஓஂ பாபக்⁴னாய நம:\n" +
          "ஓம் ப⁴க்தவத்ஸலாய நம:\n" +
          "ஓஂ த்ரிவிக்ரமாய நம:\n" +
          "ஓஂ ஶிம்ஶுமாராய நம:\n" +
          "ஓஂ ஜடாமகுட ஶோபி⁴தாய நம:\n" +
          "ஓஂ ஶங்க³மத்³யோல்லஸ-ன்மஞ்ஜுகிங்கிண்யாட்⁴யகரண்ட³காய நம: (7௦)\n" +
          "\n" +
          "ஓஂ நீலமோக⁴ஶ்யாம தனவே நம:\n" +
          "ஓம் பி³ல்வபத்ரார்சன ப்ரியாய நம:\n" +
          "ஓஂ ஜக³த்³வ்யாபினே நம:\n" +
          "ஓஂ ஜக³த்கர்த்ரே நம:\n" +
          "ஓஂ ஜக³த்ஸாக்ஷிணே நம:\n" +
          "ஓஂ ஜக³த்பதயே நம:\n" +
          "ஓஂ சின்திதார்த²ப்ரதா³ய நம:\n" +
          "ஓஂ ஜிஷ்ணவே நம:\n" +
          "ஓம் தா³ஶார்ஹாய நம:\n" +
          "ஓம் த³ஶரூபவதே நம: (8௦)\n" +
          "\n" +
          "ஓம் தே³வகீ நன்த³னாய நம:\n" +
          "ஓஂ ஶௌரயே நம:\n" +
          "ஓஂ ஹயக்³ரீவாய நம:\n" +
          "ஓஂ ஜனார்த³னாய நம:\n" +
          "ஓஂ கன்யாஶ்ரவணதாரேஜ்யாய நம:\n" +
          "ஓஂ பீதாம்ப³ரத⁴ராய நம:\n" +
          "ஓஂ அனகா⁴ய நம:\n" +
          "ஓஂ வனமாலினே நம:\n" +
          "ஓஂ பத்³மனாபா⁴ய நம:\n" +
          "ஓஂ ம்ருக³யாஸக்த மானஸாய நம: (9௦)\n" +
          "\n" +
          "ஓஂ அஶ்வாரூடா⁴ய நம:\n" +
          "ஓம் க²ட்³க³தா⁴ரிணே நம:\n" +
          "ஓம் த⁴னார்ஜன ஸமுத்ஸுகாய நம:\n" +
          "ஓம் க⁴னஸார லஸன்மத்⁴யகஸ்தூரீ திலகோஜ்ஜ்வலாய நம:\n" +
          "ஓஂ ஸச்சிதானந்த³ரூபாய நம:\n" +
          "ஓஂ ஜக³ன்மங்க³ல்த³ தா³யகாய நம:\n" +
          "ஓஂ யஜ்ஞரூபாய நம:\n" +
          "ஓஂ யஜ்ஞபோ⁴க்த்ரே நம:\n" +
          "ஓஂ சின்மயாய நம:\n" +
          "ஓஂ பரமேஶ்வராய நம: (1௦௦)\n" +
          "\n" +
          "ஓஂ பரமார்த²ப்ரதா³யகாய நம:\n" +
          "ஓஂ ஶான்தாய நம:\n" +
          "ஓஂ ஶ்ரீமதே நம:\n" +
          "ஓம் தோ³ர்த³ண்ட³ விக்ரமாய நம:\n" +
          "ஓஂ பராத்பராய நம:\n" +
          "ஓஂ பரஸ்மை ப்³ரஹ்மணே நம:\n" +
          "ஓஂ ஶ்ரீவிப⁴வே நம:\n" +
          "ஓஂ ஜக³தீ³ஶ்வராய நம: (1௦8)\n",
      isPdf: true),
  'vishnu': Ashtothram(
      "ஶ்ரீ விஷ்ணு",
      'vishnu',
      "ஓம் அச்யுதாய நம:\n" +
          "ஓம் அதீந்தராய நம:\n" +
          "ஓம் அனாதிநிதனாய நம:\n" +
          "ஓம் அளிருத்தாய நம:\n" +
          "ஓம் அம்ருதாய நம:\n" +
          "ஓம் அரவிந்தாய நம:\n" +
          "ஓம் அஸ்வத்தாய நம:\n" +
          "ஓம் ஆதித்யாய நம:\n" +
          "ஓம் ஆதிதேவாய நம:\n" +
          "ஓம் ஈஸ்வராய நம:\n" +
          "ஓம் உபேந்த்ராய நம:\n" +
          "ஓம் ஏகஸ்மை நம:\n" +
          "ஓம் ஓருஸ்தேஜோத்யுதிதராய நம:\n" +
          "ஓம் குமுதாய நம:\n" +
          "ஓம் க்ருதஜ்ஞாய நம:\n" +
          "ஓம் க்ருஷ்ணாய நம:\n" +
          "ஓம் கேஸவாய நம:\n" +
          "ஓம் க்ஷத்ரஜ்ஞாய நம:\n" +
          "ஓம் கதாதராய நம:\n" +
          "\n" +
          "ஓம் கருடத்வஜாய நம:\n" +
          "ஓம் கோபதயே நம:\n" +
          "ஓம் கோவிந்தாய நம:\n" +
          "ஓம் கோவிதாம்பதயே நம:\n" +
          "ஓம் சதுர்ப்புஜாய நம:\n" +
          "ஓம் சதுர்வ்யூஹாய நம:\n" +
          "ஓம் ஜனார்த்தனாய நம:\n" +
          "ஓம் ஜ்யேஷ்ட்டாய நம:\n" +
          "ஓம் ஜ்யோதிராதித்யாய நம:\n" +
          "ஓம் ஜயோதிஷே நம:\n" +
          "\n" +
          "ஓம் தாராய நம:\n" +
          "ஓம் தமனாய நம:\n" +
          "ஓம் தாமோதராய நம:\n" +
          "ஓம் தீப்தமூர்த்தயே நம:\n" +
          "ஓம் து:ஸ்வப்ன நாஸனாய நம:\n" +
          "ஓம் தேவகீநந்தனாய நம:\n" +
          "ஓம் தனஞ்ஜயாய நம:\n" +
          "ஓம் நந்தினே நம:\n" +
          "ஓம் நாராயணாய நம:\n" +
          "ஓம் நாரஸிம்ஹவபுஷே நம:\n" +
          "\n" +
          "ஓம் பத்மநாபாய நம:\n" +
          "ஓம் பத்மினே நம:\n" +
          "ஓம் பரமேஸ்வராய நம:\n" +
          "ஓம் பவித்ராய நம:\n" +
          "ஓம் ப்ரத்யும்னாய நம:\n" +
          "ஓம் ப்ரணவாய நம:\n" +
          "ஓம் புரந்தராய நம:\n" +
          "ஓம் புருஷாய நம:\n" +
          "ஓம் புண்டரீகாக்ஷõய நம:\n" +
          "ஓம் ப்ருஹத்ரூபாய நம:\n" +
          "\n" +
          "ஓம் பக்தவத்ஸலாய நம:\n" +
          "ஓம் பகவதே நம:\n" +
          "ஓம் மதுஸூதனாய நம:\n" +
          "ஓம் மஹாதேவாய நம:\n" +
          "ஓம் மஹாமாயாய நம:\n" +
          "ஓம் மாதவாய நம:\n" +
          "ஓம் முக்தானாம் பரமாகதயே நம:\n" +
          "ஓம் முகுந்தாய நம:\n" +
          "ஓம் யக்ஞகுஹ்யாய நம:\n" +
          "ஓம் யஜ்ஞபதயே நம:\n" +
          "\n" +
          "ஓம் யஜ்ஞாஜ்ஞாய நம:\n" +
          "ஓம் யஜ்ஞாய நம:\n" +
          "ஓம் ராமாய நம:\n" +
          "ஓம் லக்ஷ்மீபதே நம:\n" +
          "ஓம் லோகாத்யக்ஷõய நம:\n" +
          "ஓம் லோஹிதாக்ஷõய நம:\n" +
          "ஓம் வரதாய நம:\n" +
          "ஓம் வர்த்தனாய நம:\n" +
          "ஓம் வராரோஹாய நம:\n" +
          "ஓம் வஸுப்ரதாய நம:\n" +
          "\n" +
          "ஓம் வஸுமனஸே நம:\n" +
          "ஓம் வ்யக்திரூபாய நம:\n" +
          "ஓம் வாமனாய நம:\n" +
          "ஓம் வாயுவாஹனாய நம:\n" +
          "ஓம் விக்ரமாய நம:\n" +
          "ஓம் விஷ்ணவே நம:\n" +
          "ஓம் விஷ்வக்ஸேனாய நம:\n" +
          "ஓம் வ்ரு÷ஷாதராய நம:\n" +
          "ஓம் வேதவிதே நம:\n" +
          "ஓம் வேதாங்காய நம:\n" +
          "\n" +
          "ஓம் வேதாய நம:\n" +
          "ஓம் வைகுண்ட்டாய நம:\n" +
          "ஓம் ஸரணாய நம:\n" +
          "ஓம் ஸாந்நாய நம:\n" +
          "ஓம் ஸார்ங்கதன்வனே நம:\n" +
          "ஓம் ஸாஸ்வதஸ்தாணவே நம:\n" +
          "ஓம் ஸிகண்டனே நம:\n" +
          "ஓம் ஸிவாய நம:\n" +
          "ஓம் ஸ்ரீதராய நம:\n" +
          "ஓம் ஸ்ரீநிவாஸாய நம:\n" +
          "\n" +
          "ஓம் ஸ்ரீமதே நம:\n" +
          "ஓம் ஸுபாங்காய நம:\n" +
          "ஓம் ஸ்ருதிஸாகராய நம:\n" +
          "ஓம் ஸங்கர்ஷணாய நம:\n" +
          "ஓம் ஸதாயோகினே நம:\n" +
          "ஓம் ஸர்வதோமுகாய நம:\n" +
          "ஓம் ஸர்வேஸ்வராய நம:\n" +
          "ஓம் ஸஹஸ்ராக்ஷõய நம:\n" +
          "ஓம் ஸ்கந்தாய நம:\n" +
          "ஓம் ஸாக்ஷிணே நம:\n" +
          "\n" +
          "ஓம் ஸுதர்ஸனாய நம:\n" +
          "ஓம் ஸுரானந்தாய நம:\n" +
          "ஓம் ஸுலபாய நம:\n" +
          "ஓம் ஸூக்ஷ்மாய நம:\n" +
          "ஓம் ஹரயே நம:\n" +
          "ஓம் ஹிரண்யகர்ப்பாய நம:\n" +
          "ஓம் ஹிரண்யநாபாய நம:\n" +
          "ஓம் ஹ்ருஷீகேஸாய நம:\n"),
  'lakshmi': Ashtothram(
      'ஸ்ரீ லக்ஷ்மி',
      'lakshmi',
      "ஓம் ப்ரக்ருத்யை நம꞉ ।\n" +
          "ஓம் விக்ருத்யை நம꞉ ।\n" +
          "ஓம் வித்³யாயை நம꞉ ।\n" +
          "ஓம் ஸர்வபூ⁴தஹிதப்ரதா³யை நம꞉ ।\n" +
          "ஓம் ஶ்ரத்³தா⁴யை நம꞉ ।\n" +
          "ஓம் விபூ⁴த்யை நம꞉ ।\n" +
          "ஓம் ஸுரப்⁴யை நம꞉ ।\n" +
          "ஓம் பரமாத்மிகாயை நம꞉ ।\n" +
          "ஓம் வாசே நம꞉ । 9\n" +
          "\n" +
          "ஓம் பத்³மாலயாயை நம꞉ ।\n" +
          "ஓம் பத்³மாயை நம꞉ ।\n" +
          "ஓம் ஶுசயே நம꞉ ।\n" +
          "ஓம் ஸ்வாஹாயை நம꞉ ।\n" +
          "ஓம் ஸ்வதா⁴யை நம꞉ ।\n" +
          "ஓம் ஸுதா⁴யை நம꞉ ।\n" +
          "ஓம் த⁴ந்யாயை நம꞉ ।\n" +
          "ஓம் ஹிரண்மய்யை நம꞉ ।\n" +
          "ஓம் லக்ஷ்ம்யை நம꞉ । 18\n" +
          "\n" +
          "ஓம் நித்யபுஷ்டாயை நம꞉ ।\n" +
          "ஓம் விபா⁴வர்யை நம꞉ ।\n" +
          "ஓம் அதி³த்யை நம꞉ ।\n" +
          "ஓம் தி³த்யை நம꞉ ।\n" +
          "ஓம் தீ³ப்தாயை நம꞉ ।\n" +
          "ஓம் வஸுதா⁴யை நம꞉ ।\n" +
          "ஓம் வஸுதா⁴ரிண்யை நம꞉ ।\n" +
          "ஓம் கமலாயை நம꞉ ।\n" +
          "ஓம் காந்தாயை நம꞉ । 27\n" +
          "\n" +
          "ஓம் க்ஷமாயை நம꞉ । [காமாக்ஷ்யை]\n" +
          "ஓம் க்ஷீரோத³ஸம்ப⁴வாயை நம꞉ । [க்ரோத⁴ஸம்ப⁴வாயை]\n" +
          "ஓம் அநுக்³ரஹபராயை நம꞉ ।\n" +
          "ஓம் பு³த்³த⁴யே நம꞉ ।\n" +
          "ஓம் அநகா⁴யை நம꞉ ।\n" +
          "ஓம் ஹரிவல்லபா⁴யை நம꞉ ।\n" +
          "ஓம் அஶோகாயை நம꞉ ।\n" +
          "ஓம் அம்ருதாயை நம꞉ ।\n" +
          "ஓம் தீ³ப்தாயை நம꞉ । 36\n" +
          "\n" +
          "ஓம் லோகஶோகவிநாஶிந்யை நம꞉ ।\n" +
          "ஓம் த⁴ர்மநிலயாயை நம꞉ ।\n" +
          "ஓம் கருணாயை நம꞉ ।\n" +
          "ஓம் லோகமாத்ரே நம꞉ ।\n" +
          "ஓம் பத்³மப்ரியாயை நம꞉ ।\n" +
          "ஓம் பத்³மஹஸ்தாயை நம꞉ ।\n" +
          "ஓம் பத்³மாக்ஷ்யை நம꞉ ।\n" +
          "ஓம் பத்³மஸுந்த³ர்யை நம꞉ ।\n" +
          "ஓம் பத்³மோத்³ப⁴வாயை நம꞉ । 45\n" +
          "\n" +
          "ஓம் பத்³மமுக்²யை நம꞉ ।\n" +
          "ஓம் பத்³மநாப⁴ப்ரியாயை நம꞉ ।\n" +
          "ஓம் ரமாயை நம꞉ ।\n" +
          "ஓம் பத்³மமாலாத⁴ராயை நம꞉ ।\n" +
          "ஓம் தே³வ்யை நம꞉ ।\n" +
          "ஓம் பத்³மிந்யை நம꞉ ।\n" +
          "ஓம் பத்³மக³ந்தி⁴ந்யை நம꞉ ।\n" +
          "ஓம் புண்யக³ந்தா⁴யை நம꞉ ।\n" +
          "ஓம் ஸுப்ரஸந்நாயை நம꞉ । 54\n" +
          "\n" +
          "ஓம் ப்ரஸாதா³பி⁴முக்²யை நம꞉ ।\n" +
          "ஓம் ப்ரபா⁴யை நம꞉ ।\n" +
          "ஓம் சந்த்³ரவத³நாயை நம꞉ ।\n" +
          "ஓம் சந்த்³ராயை நம꞉ ।\n" +
          "ஓம் சந்த்³ரஸஹோத³ர்யை நம꞉ ।\n" +
          "ஓம் சதுர்பு⁴ஜாயை நம꞉ ।\n" +
          "ஓம் சந்த்³ரரூபாயை நம꞉ ।\n" +
          "ஓம் இந்தி³ராயை நம꞉ ।\n" +
          "ஓம் இந்து³ஶீதலாயை நம꞉ । 63\n" +
          "\n" +
          "ஓம் ஆஹ்லாத³ஜநந்யை நம꞉ ।\n" +
          "ஓம் புஷ்ட்யை நம꞉ ।\n" +
          "ஓம் ஶிவாயை நம꞉ ।\n" +
          "ஓம் ஶிவகர்யை நம꞉ ।\n" +
          "ஓம் ஸத்யை நம꞉ ।\n" +
          "ஓம் விமலாயை நம꞉ ।\n" +
          "ஓம் விஶ்வஜநந்யை நம꞉ ।\n" +
          "ஓம் துஷ்ட்யை நம꞉ ।\n" +
          "ஓம் தா³ரித்³ர்யநாஶிந்யை நம꞉ । 72\n" +
          "\n" +
          "ஓம் ப்ரீதிபுஷ்கரிண்யை நம꞉ ।\n" +
          "ஓம் ஶாந்தாயை நம꞉ ।\n" +
          "ஓம் ஶுக்லமால்யாம்ப³ராயை நம꞉ ।\n" +
          "ஓம் ஶ்ரியை நம꞉ ।\n" +
          "ஓம் பா⁴ஸ்கர்யை நம꞉ ।\n" +
          "ஓம் பி³ல்வநிலயாயை நம꞉ ।\n" +
          "ஓம் வராரோஹாயை நம꞉ ।\n" +
          "ஓம் யஶஸ்விந்யை நம꞉ ।\n" +
          "ஓம் வஸுந்த⁴ராயை நம꞉ । 81\n" +
          "\n" +
          "ஓம் உதா³ராங்கா³யை நம꞉ ।\n" +
          "ஓம் ஹரிண்யை நம꞉ ।\n" +
          "ஓம் ஹேமமாலிந்யை நம꞉ ।\n" +
          "ஓம் த⁴நதா⁴ந்யகர்யை நம꞉ ।\n" +
          "ஓம் ஸித்³த⁴யே நம꞉ ।\n" +
          "ஓம் ஸ்த்ரைணஸௌம்யாயை நம꞉ ।\n" +
          "ஓம் ஶுப⁴ப்ரதா³யை நம꞉ ।\n" +
          "ஓம் ந்ருபவேஶ்மக³தாநந்தா³யை நம꞉ ।\n" +
          "ஓம் வரலக்ஷ்ம்யை நம꞉ । 90\n" +
          "\n" +
          "ஓம் வஸுப்ரதா³யை நம꞉ ।\n" +
          "ஓம் ஶுபா⁴யை நம꞉ ।\n" +
          "ஓம் ஹிரண்யப்ராகாராயை நம꞉ ।\n" +
          "ஓம் ஸமுத்³ரதநயாயை நம꞉ ।\n" +
          "ஓம் ஜயாயை நம꞉ ।\n" +
          "ஓம் மங்க³லா தே³வ்யை நம꞉ ।\n" +
          "ஓம் விஷ்ணுவக்ஷ꞉ஸ்த²லஸ்தி²தாயை நம꞉ ।\n" +
          "ஓம் விஷ்ணுபத்ந்யை நம꞉ ।\n" +
          "ஓம் ப்ரஸந்நாக்ஷ்யை நம꞉ । 99\n" +
          "\n" +
          "ஓம் நாராயணஸமாஶ்ரிதாயை நம꞉ ।\n" +
          "ஓம் தா³ரித்³ர்யத்⁴வம்ஸிந்யை நம꞉ ।\n" +
          "ஓம் தே³வ்யை நம꞉ ।\n" +
          "ஓம் ஸர்வோபத்³ரவவாரிண்யை நம꞉ ।\n" +
          "ஓம் நவது³ர்கா³யை நம꞉ ।\n" +
          "ஓம் மஹாகால்யை நம꞉ ।\n" +
          "ஓம் ப்³ரஹ்மாவிஷ்ணுஶிவாத்மிகாயை நம꞉ ।\n" +
          "ஓம் த்ரிகாலஜ்ஞாநஸம்பந்நாயை நம꞉ ।\n" +
          "ஓம் பு⁴வநேஶ்வர்யை நம꞉ । 108\n"),
  'sudharshanam': Ashtothram(
      'ஸ்ரீ ஸுதர்ஶனம்',
      'sudharshanam',
      "ஓஂ ஶ்ரீ ஸுத³ர்ஶனாய நம: ।\n" +
          "ஓஂ சக்ரராஜாய நம: ।\n" +
          "ஓஂ தேஜோவ்யூஹாய நம: ।\n" +
          "ஓஂ மஹாத்³யுதயே நம: ।\n" +
          "ஓஂ ஸஹஸ்ர-பா³ஹவே நம: ।\n" +
          "ஓம் தீ³ப்தாங்கா³ய நம: ।\n" +
          "ஓஂ அருணாக்ஷாய நம: ।\n" +
          "ஓஂ ப்ரதாபவதே நம: ।\n" +
          "ஓஂ அனேகாதி³த்ய-ஸங்காஶாய நம: ।\n" +
          "ஓஂ ப்ரோத்³யஜ்ஜ்வாலாபி⁴ரஞ்ஜிதாய நம: । 1௦ ।\n" +
          "\n" +
          "ஓஂ ஸௌதா³மினீ-ஸஹஸ்ராபா⁴ய நம: ।\n" +
          "ஓஂ மணிகுண்ட³ல-ஶோபி⁴தாய நம: ।\n" +
          "ஓஂ பஞ்சபூ⁴தமனோ-ரூபாய நம: ।\n" +
          "ஓஂ ஷட்கோணான்தர-ஸம்ஸ்தி²தாய நம: ।\n" +
          "ஓஂ ஹரான்த:கரணோத்³பூ⁴தரோஷ-\n" +
          "பீ⁴ஷண விக்³ரஹாய நம: ।\n" +
          "ஓஂ ஹரிபாணிலஸத்பத்³மவிஹார-\n" +
          "மனோஹராய நம: ।\n" +
          "ஓஂ ஶ்ராகாரரூபாய நம: ।\n" +
          "ஓஂ ஸர்வஜ்ஞாய நம: ।\n" +
          "ஓஂ ஸர்வலோகார்சிதப்ரப⁴வே நம: ।\n" +
          "ஓஂ சதுர்த³ஶஸஹஸ்ராராய நம: । 2௦ ।\n" +
          "\n" +
          "ஓஂ சதுர்வேத³மயாய நம: ।\n" +
          "ஓஂ அனலாய நம: ।\n" +
          "ஓம் ப⁴க்தசான்த்³ரமஸ-ஜ்யோதிஷே நம: ।\n" +
          "ஓம் ப⁴வரோக-³வினாஶகாய நம: ।\n" +
          "ஓஂ ரேபா²த்மகாய நம: ।\n" +
          "ஓஂ மகாராய நம: ।\n" +
          "ஓஂ ரக்ஷோஸ்ருக்³ரூஷிதாங்கா³ய நம: ।\n" +
          "ஓஂ ஸர்வதை³த்யக்³ரீவானால-விபே⁴த³ன-\n" +
          "மஹாகஜ³ாய நம: ।\n" +
          "ஓம் பீ⁴ம-த³ம்ஷ்ட்ராய நம: ।\n" +
          "ஓஂ உஜ்ஜ்வலாகாராய நம: । 3௦ ।\n" +
          "\n" +
          "ஓம் பீ⁴மகர்மணே நம: ।\n" +
          "ஓஂ த்ரிலோசனாய நம: ।\n" +
          "ஓஂ நீலவர்த்மனே நம: ।\n" +
          "ஓஂ நித்யஸுகா²ய நம: ।\n" +
          "ஓஂ நிர்மலஶ்ரியை நம: ।\n" +
          "ஓஂ நிரஞ்ஜனாய நம: ।\n" +
          "ஓஂ ரக்தமால்யாம்ப³ரத⁴ராய நம: ।\n" +
          "ஓஂ ரக்தசன்த³ன-ரூஷிதாய நம: ।\n" +
          "ஓஂ ரஜோகு³ணாக்ருதயே நம: ।\n" +
          "ஓஂ ஶூராய நம: । 4௦ ।\n" +
          "\n" +
          "ஓஂ ரக்ஷ:குல-யமோபமாய நம: ।\n" +
          "ஓஂ நித்ய-க்ஷேமகராய நம: ।\n" +
          "ஓஂ ப்ராஜ்ஞாய நம: ।\n" +
          "ஓஂ பாஷண்டஜ³ன-க²ண்ட³னாய நம: ।\n" +
          "ஓஂ நாராயணாஜ்ஞானுவர்தினே நம: ।\n" +
          "ஓஂ நைக³மான்த:-ப்ரகாஶகாய நம: ।\n" +
          "ஓம் ப³லினந்த³னதோ³ர்த³ண்ட³க²ண்ட³னாய நம: ।\n" +
          "ஓஂ விஜயாக்ருதயே நம: ।\n" +
          "ஓஂ மித்ரபா⁴வினே நம: ।\n" +
          "ஓஂ ஸர்வமயாய நம: । 5௦ ।\n" +
          "\n" +
          "ஓஂ தமோ-வித்⁴வம்ஸகாய நம: ।\n" +
          "ஓஂ ரஜஸ்ஸத்த்வதமோத்³வர்தினே நம: ।\n" +
          "ஓஂ த்ரிகு³ணாத்மனே நம: ।\n" +
          "ஓஂ த்ரிலோகத்⁴ருதே நம: ।\n" +
          "ஓஂ ஹரிமாயகு³ணோபேதாய நம: ।\n" +
          "ஓஂ அவ்யயாய நம: ।\n" +
          "ஓஂ அக்ஷஸ்வரூபபா⁴ஜே நம: ।\n" +
          "ஓஂ பரமாத்மனே நம: ।\n" +
          "ஓஂ பரஂ ஜ்யோதிஷே நம: ।\n" +
          "ஓஂ பஞ்சக்ருத்ய-பராயணாய நம: । 6௦ ।\n" +
          "\n" +
          "ஓஂ ஜ்ஞானஶக்தி-ப³லைஶ்வர்ய-வீர்ய-தேஜ:-\n" +
          "ப்ரபா⁴மயாய நம: ।\n" +
          "ஓஂ ஸத³ஸத்-பரமாய நம: ।\n" +
          "ஓஂ பூர்ணாய நம: ।\n" +
          "ஓஂ வாங்மயாய நம: ।\n" +
          "ஓஂ வரதா³ய நம: ।\n" +
          "ஓஂ அச்யுதாய நம: ।\n" +
          "ஓஂ ஜீவாய நம: ।\n" +
          "ஓம் கு³ரவே நம: ।\n" +
          "ஓஂ ஹம்ஸரூபாய நம: ।\n" +
          "ஓஂ பஞ்சாஶத்பீட-²ரூபகாய நம: । 7௦ ।\n" +
          "\n" +
          "ஓஂ மாத்ருகாமண்ட³லாத்⁴யக்ஷாய நம: ।\n" +
          "ஓஂ மது⁴-த்⁴வம்ஸினே நம: ।\n" +
          "ஓஂ மனோமயாய நம: ।\n" +
          "ஓம் பு³த்³தி⁴ரூபாய நம: ।\n" +
          "ஓஂ சித்தஸாக்ஷிணே நம: ।\n" +
          "ஓஂ ஸாராய நம: ।\n" +
          "ஓஂ ஹம்ஸாக்ஷரத்³வயாய நம: ।\n" +
          "ஓஂ மன்த்ர-யன்த்ர-ப்ரபா⁴வஜ்ஞாய நம: ।\n" +
          "ஓஂ மன்த்ர-யன்த்ரமயாய நம: ।\n" +
          "ஓஂ விப⁴வே நம: । 8௦ ।\n" +
          "\n" +
          "ஓஂ ஸ்ரஷ்ட்ரே நம: ।\n" +
          "ஓஂ க்ரியாஸ்பதா³ய நம: ।\n" +
          "ஓஂ ஶுத்³தா⁴ய நம: ।\n" +
          "ஓஂ ஆதா⁴ராய நம: ।\n" +
          "ஓஂ சக்ர-ரூபகாய நம: ।\n" +
          "ஓஂ நிராயுதா⁴ய நம: ।\n" +
          "ஓஂ அஸம்ரம்பா⁴ய நம: ।\n" +
          "ஓஂ ஸர்வாயுத-⁴ஸமன்விதாய நம: ।\n" +
          "ஓஂ ஓங்கார-ரூபிணே நம: ।\n" +
          "ஓஂ பூர்ணாத்மனே நம: । 9௦ ।\n" +
          "\n" +
          "ஓஂ ஆங்காரஸ்ஸாத்⁴ய-ப³ன்த⁴னாய நம: ।\n" +
          "ஓஂ ஐங்காராய நம: ।\n" +
          "ஓஂ வாக்ப்ரதா³ய நம: ।\n" +
          "ஓஂ வாக்³மினே நம: ।\n" +
          "ஓஂ ஶ்ரீங்காரைஶ்வர்ய-வர்த⁴னாய நம: ।\n" +
          "ஓஂ க்லீங்கார-மோஹனாகாராய நம: ।\n" +
          "ஓஂ ஹும்ப²ட்க்ஷோப⁴ணாக்ருதயே நம: ।\n" +
          "ஓஂ இன்த்³ரார்சித-மனோவேகா³ய நம: ।\n" +
          "ஓம் த⁴ரணீபா⁴ர-னாஶகாய நம: ।\n" +
          "ஓஂ வீராராத்⁴யாய நம: । 1௦௦ ।\n" +
          "\n" +
          "ஓஂ விஶ்வரூபாய நம: ।\n" +
          "ஓஂ வைஷ்ணவாய நம: ।\n" +
          "ஓஂ விஷ்ணு-ரூபகாய நம: ।\n" +
          "ஓஂ ஸத்யவ்ரதாய நம: ।\n" +
          "ஓஂ ஸத்யபராய நம: । 1\n" +
          "ஓஂ ஸத்யத⁴ர்மானுஷங்க³காய நம: ।\n" +
          "ஓஂ நாராயணக்ருபாவ்யூஹதேஜஶ்சக்ராய நம: ।\n" +
          "ஓஂ ஸுத³ர்ஶனாய நம: । 1௦8 ।\n"),
  'narasimha': Ashtothram(
      'ஸ்ரீ நரஸிம்மர்',
      'narasimha',
      "ஓம் நாரஸிம்ஹாய நம:\n" +
          "ஓம் மஹாஸிம்ஹாய நம:\n" +
          "ஓம் திவ்யஸிம்ஹாய நம:\n" +
          "ஓம் மஹாபலாய நம:\n" +
          "ஓம் உக்ரஸிம்ஹாய நம:\n" +
          "ஓம் மஹாதேவாய நம:\n" +
          "ஓம் உபேந்த்ராய நம:\n" +
          "ஓம் அக்னிலோசனாய நம:\n" +
          "ஓம் ரௌத்ராய நம:\n" +
          "ஓம் ஸெளரயே நம:\n" +
          "\n" +
          "ஓம் மஹாவீராய நம:\n" +
          "ஓம் ஸுவிக்ரம பராக்ரமாய நம:\n" +
          "ஓம் ஹரிகோலாஹலாய நம:\n" +
          "ஓம் சக்ரிணே நம:\n" +
          "ஓம் விஜயாய நம:\n" +
          "ஓம் ஜயாய நம:\n" +
          "ஓம் அவ்யயாய நம:\n" +
          "ஓம் தைத்யாந்தகாய நம:\n" +
          "ஓம் பரப்ரஹ்மணே நம:\n" +
          "ஓம் அகோராய நம:\n" +
          "\n" +
          "ஓம் கோரவிக்ரமாய நம:\n" +
          "ஓம் ஜ்வாலாமுகாய நம:\n" +
          "ஓம் ஜ்வாலாமாலிநே நம:\n" +
          "ஓம் மஹாஜ்வாலாய நம:\n" +
          "ஓம் மஹாப்ரபவே நம:\n" +
          "ஓம் நிடிலாக்ஷõய நம:\n" +
          "ஓம் ஸஹஸ்ராக்ஷõய நம:\n" +
          "ஓம் துர்நிரீக்ஷயாய நம:\n" +
          "ஓம் ப்ரதாபநாய நம:\n" +
          "ஓம் மஹாதம்ஷ்ட்ராயுதாய நம:\n" +
          "\n" +
          "ஓம் ப்ராஜ்ஞாய நம:\n" +
          "ஓம் ஹிரண்யகநிஷூதநாய நம:\n" +
          "ஓம் சண்டகோபிதே நம:\n" +
          "ஓம் ஸுராரிக்நாய நம:\n" +
          "ஓம் ஸதார்திக்நாய நம:\n" +
          "ஓம் ஸதாஸிவாய நம:\n" +
          "ஓம் குணபத்ராய நம:\n" +
          "ஓம் மஹாபத்ராய நம:\n" +
          "ஓம் பலபத்ராய நம:\n" +
          "ஓம் ஸுபத்ராய நம:\n" +
          "\n" +
          "ஓம் கராளாய நம:\n" +
          "ஓம் விகராளாய நம:\n" +
          "ஓம் விகர்த்ரே நம:\n" +
          "ஓம் ஸர்வகர்த்ருகாய நம:\n" +
          "ஓம் பைரவாடம்பராய நம:\n" +
          "ஓம் திவ்யாய நம:\n" +
          "ஓம் அகம்யாய நம:\n" +
          "ஓம் ஸர்வஸத்ருஜிதே நம:\n" +
          "ஓம் அமோகாஸ்த்ராய நம:\n" +
          "ஓம் ஸஸ்த்ரதராய நம:\n" +
          "\n" +
          "ஓம் ஹவ்யகூடாய நம:\n" +
          "ஓம் ஸுரேஸ்வராய நம:\n" +
          "ஓம் ஸஹஸ்ரபாஹவே நம:\n" +
          "ஓம் வஜ்ரநகாய நம:\n" +
          "ஓம் ஸர்வஸித்தயே நம:\n" +
          "ஓம் ஜநார்தநாய நம:\n" +
          "ஓம் அநந்தாய நம:\n" +
          "ஓம் பகவதே நம:\n" +
          "ஓம் ஸ்தூலாய நம:\n" +
          "ஓம் அகம்யாய நம:\n" +
          "\n" +
          "ஓம் பராவராய நம:\n" +
          "ஓம் ஸர்வமந்த்ரைகரூபாய நம:\n" +
          "ஓம் ஸர்வயந்த்ரவிதாரணாய நம:\n" +
          "ஓம் அவ்யயாய நம:\n" +
          "ஓம் பரமாநந்தாய நம:\n" +
          "ஓம் காலஜிதே நம:\n" +
          "ஓம் ககவாஹநாய நம:\n" +
          "ஓம் பக்தாதிவத்ஸலாய நம:\n" +
          "ஓம் அவ்யக்தாய நம:\n" +
          "ஓம் ஸுவ்யக்தாய நம:\n" +
          "\n" +
          "ஓம் ஸுலபாய நம:\n" +
          "ஓம் ஸுசயே நம:\n" +
          "ஓம் லோகைகநாயகாய நம:\n" +
          "ஓம் ஸர்வாய நம:\n" +
          "ஓம் ஸரணாகதனத்ஸலாய நம:\n" +
          "ஓம் தீராய நம:\n" +
          "ஓம் தராய நம:\n" +
          "ஓம் ஸர்வஜ்ஞாய நம:\n" +
          "ஓம் பீமாய நம:\n" +
          "ஓம் பீமபராக்ரமாய நம:\n" +
          "\n" +
          "ஓம் தேவப்ரியாய நம:\n" +
          "ஓம் நுதாய நம:\n" +
          "ஓம் பூஜ்யாய நம:\n" +
          "ஓம் பவஹ்ருதே நம:\n" +
          "ஓம் பரமேஸ்வராய நம:\n" +
          "ஓம் ஸ்ரீ வத்ஸவக்ஷஸே நம:\n" +
          "ஓம் ஸ்ரீ வாஸாய நம:\n" +
          "ஓம் விபவே நம:\n" +
          "ஓம் ஸங்கர்ஷணாய நம:\n" +
          "ஓம் ப்ரபவே நம:\n" +
          "\n" +
          "ஓம் த்ரிவிக்ரமாய நம:\n" +
          "ஓம் த்ரிலோகாத்மநே நம:\n" +
          "ஓம் காலாய நம:\n" +
          "ஓம் ஸர்வேஸ்வரேஸ்வராய நம:\n" +
          "ஓம் விஸ்வம்பராய நம:\n" +
          "ஓம் ஸிதிராபாய நம:\n" +
          "ஓம் அச்யுதாய நம:\n" +
          "ஓம் புருஷாத்தமாய நம:\n" +
          "ஓம் அதோக்ஷஜாய நம:\n" +
          "ஓம் அக்ஷயாய நம:\n" +
          "\n" +
          "ஓம் ஸேவ்யாய நம:\n" +
          "ஓம் வனமாலிநே நம:\n" +
          "ஓம் ப்ரகம்பநாய நம:\n" +
          "ஓம் குரவே நம:\n" +
          "ஓம் லோக குரவே நம:\n" +
          "ஓம் ஸரஷ்ட்ரே நம:\n" +
          "ஓம் பரஸ்மை ஜ்யோதிஷே நம:\n" +
          "ஓம் பராயணாய நம:\n"),
  'ramar': Ashtothram(
      'ஸ்ரீ ராமர்',
      'ramar',
      "ஓம் ராமப4த்3ராய நம:\n" +
          "ஓம் ராமசன்த்3ராய நம:\n" +
          "ஓம் ஶாஶ்வதாய நம:\n" +
          "ஓம் ராஜீவலோசனாய நம:\n" +
          "ஓம் ஶ்ரீமதே நம:\n" +
          "ஓம் ராஜேன்த்3ராய நம:\n" +
          "ஓம் ரகு4புங்க3வாய நம:\n" +
          "ஓம் ஜானகீவல்லபா4ய நம: \n" +
          "ஓம் ஜைத்ராய நம: ॥ 1௦ ॥\n" +
          "\n" +
          "ஓம் ஜிதாமித்ராய நம: \n" +
          "ஓம் ஜனார்த3னாய நம:\n" +
          "ஓம் விஶ்வாமித்ரப்ரியாய நம:\n" +
          "ஓம் தா3ன்தாய நம:\n" +
          "ஓம் ஶரணத்ராணதத்பராய நம: \n" +
          "ஓம் வாலிப்ரமத2னாய நம:\n" +
          "ஓம் வாங்மினே நம:\n" +
          "ஓம் ஸத்யவாசே நம:\n" +
          "ஓம் ஸத்யவிக்ரமாய நம: \n" +
          "ஓம் ஸத்யவ்ரதாய நம: ॥ 2௦ ॥\n" +
          "\n" +
          "ஓம் வ்ரதத4ராய நம:\n" +
          "ஓம் ஸதா3 ஹனுமதா3ஶ்ரிதாய நம:\n" +
          "ஓம் கோஸலேயாய நம:\n" +
          "ஓம் க2ரத்4வம்ஸினே நம:\n" +
          "ஓம் விராத4வத4பண்டி3தாய நம:\n" +
          "ஓம் விபீ4ஷணபரித்ராத்ரே நம:\n" +
          "ஓம் ஹரகோத3ண்ட3 க2ண்ட3னாய நம:\n" +
          "ஓம் ஸப்தஸால ப்ரபே4த்த்ரே நம: \n" +
          "ஓம் த3ஶக்3ரீவஶிரோஹராய நம:\n" +
          "ஓம் ஜாமத3க்3ன்யமஹாத3ர்பத3ல்த3னாய நம: ॥ 3௦ ॥\n" +
          "\n" +
          "ஓம் தாடகான்தகாய நம:\n" +
          "ஓம் வேதா3ன்த ஸாராய நம:\n" +
          "ஓம் வேதா3த்மனே நம:\n" +
          "ஓம் ப4வரோக3ஸ்ய பே4ஷஜாய நம:\n" +
          "ஓம் தூ3ஷணத்ரிஶிரோஹன்த்ரே நம:\n" +
          "ஓம் த்ரிமூர்தயே நம:\n" +
          "ஓம் த்ரிகு3ணாத்மகாய நம:\n" +
          "ஓம் த்ரிவிக்ரமாய நம:\n" +
          "ஓம் த்ரிலோகாத்மனே நம: \n" +
          "ஓம் புண்யசாரித்ரகீர்தனாய நம: ॥ 4௦ ॥\n" +
          "\n" +
          "ஓம் த்ரிலோகரக்ஷகாய நம:\n" +
          "ஓம் த4ன்வினே நம:\n" +
          "ஓம் த3ண்ட3காரண்யகர்தனாய நம:\n" +
          "ஓம் அஹல்யாஶாபஶமனாய நம:\n" +
          "ஓம் பித்ருப4க்தாய நம:\n" +
          "ஓம் வரப்ரதா3ய நம:\n" +
          "ஓம் ஜிதக்ரோதா4ய நம:\n" +
          "ஓம் ஜிதாமித்ராய நம:\n" +
          "ஓம் ஜக3த்3கு3ரவே நம:\n" +
          "ஓம் ருக்ஷவானரஸங்கா4தினே நம: ॥ 5௦॥\n" +
          "\n" +
          "ஓம் சித்ரகூடஸமாஶ்ரயாய நம:\n" +
          "ஓம் ஜயன்தத்ராண வரதா3ய நம:\n" +
          "ஓம் ஸுமித்ராபுத்ர ஸேவிதாய நம:\n" +
          "ஓம் ஸர்வதே3வாதி3தே3வாய நம:\n" +
          "ஓம் ம்ருதவானரஜீவனாய நம:\n" +
          "ஓம் மாயாமாரீசஹன்த்ரே நம:\n" +
          "ஓம் மஹாதே3வாய நம:\n" +
          "ஓம் மஹாபு4ஜாய நம:\n" +
          "ஓம் ஸர்வதே3வஸ்துதாய நம:\n" +
          "ஓம் ஸௌம்யாய நம: ॥ 6௦ ॥\n" +
          "\n" +
          "ஓம் ப்3ரஹ்மண்யாய நம:\n" +
          "ஓம் முனிஸம்ஸ்துதாய நம:\n" +
          "ஓம் மஹாயோகி3னே நம:\n" +
          "ஓம் மஹோதா3ராய நம:\n" +
          "ஓம் ஸுக்3ரீவேப்ஸித ராஜ்யதா3ய நம:\n" +
          "ஓம் ஸர்வபுண்யாதி4க ப2லாய நம:\n" +
          "ஓம் ஸ்ம்ருதஸர்வாக4னாஶனாய நம:\n" +
          "ஓம் ஆதி3புருஷாய நம:\n" +
          "ஓம் பரமபுருஷாய நம:\n" +
          "ஓம் மஹாபுருஷாய நம: ॥ 7௦ ॥\n" +
          "\n" +
          "ஓம் புண்யோத3யாய நம:\n" +
          "ஓம் த3யாஸாராய நம:\n" +
          "ஓம் புராணாய நம: \n" +
          "ஓம் புருஷோத்தமாய நம:\n" +
          "ஓம் ஸ்மிதவக்த்ராய நம:\n" +
          "ஓம் மிதபா4ஷிணே நம:\n" +
          "ஓம் பூர்வபா4ஷிணே நம:\n" +
          "ஓம் ராக4வாய நம:\n" +
          "ஓம் அனந்தகு3ணக3ம்பீ4ராய நம:\n" +
          "ஓம் தீ4ரோதா3த்த கு3ணோத்தமாய நம: ॥ 8௦ ॥\n" +
          "\n" +
          "ஓம் மாயாமானுஷசாரித்ராய நம:\n" +
          "ஓம் மஹாதே3வாதி3 பூஜிதாய நம:\n" +
          "ஓம் ஸேதுக்ருதே நம:\n" +
          "ஓம் ஜிதவாராஶயே நம:\n" +
          "ஓம் ஸர்வதீர்த2மயாய நம:\n" +
          "ஓம் ஹரயே நம:\n" +
          "ஓம் ஶ்யாமாங்கா3ய நம:\n" +
          "ஓம் ஸுன்த3ராய நம:\n" +
          "ஓம் ஶூராய நம:\n" +
          "ஓம் பீதவாஸஸே நம: ॥ 9௦ ॥\n" +
          "\n" +
          "ஓம் த4னுர்த4ராய நம:\n" +
          "ஓம் ஸர்வயஜ்ஞாதி4பாய நம:\n" +
          "ஓம் யஜ்வனே நம:\n" +
          "ஓம் ஜராமரணவர்ஜிதாய நம:\n" +
          "ஓம் ஶிவலிங்க3ப்ரதிஷ்டா2த்ரே நம: \n" +
          "ஓம் ஸர்வாவகு3ணவர்ஜிதாய நம:\n" +
          "ஓம் பரமாத்மனே நம:\n" +
          "ஓம் பரஸ்மை ப்3ரஹ்மணே நம:\n" +
          "ஓம் ஸச்சிதா3னந்த3 விக்3ரஹாய நம:\n" +
          "ஓம் பரஸ்மைஜ்யோதிஷே நம: ॥ 1௦௦ ॥\n" +
          "\n" +
          "ஓம் பரஸ்மை தா4ம்னே நம:\n" +
          "ஓம் பராகாஶாய நம:\n" +
          "ஓம் பராத்பராய நம:\n" +
          "ஓம் பரேஶாய நம:\n" +
          "ஓம் பாரகா3ய நம:\n" +
          "ஓம் பாராய நம:\n" +
          "ஓம் ஸர்வதே3வாத்மகாய நம:\n" +
          "ஓம் பராய நம: ॥ 1௦8 ॥\n"),
  'seetha': Ashtothram(
      'ஸ்ரீ ஸீதா',
      'seetha',
      "ஓம் ஸ்ரீ ஸீதாயை நம\n" +
          "ஓம் பதிவ்ரதாயை நம\n" +
          "ஓம் தேவ்யை நம\n" +
          "ஓம் மைதில்யை நம\n" +
          "ஓம் ஜனகாத்மஜாயை நம\n" +
          "ஓம் அயோனிஜாயை நம\n" +
          "ஓம் வீர்யஸுல்காயை நம\n" +
          "ஓம் ஸுபாயை நம\n" +
          "ஓம் ஸுரஸுதோபமாயை நம\n" +
          "ஓம் வித்யுத்ப்ரபாயை நம\n" +
          "\n" +
          "ஓம் விஸாலாக்ஷ்யை நம\n" +
          "ஓம் நீலகுஞ்சித மூர்த்தஜாயை நம\n" +
          "ஓம் அபிராமாயை நம\n" +
          "ஓம் மஹாபாகாயை நம\n" +
          "ஓம் ஸர்வாபரண பூஷிதாயை நம\n" +
          "ஓம் பூர்ண சந்த்ரானனாயை நம\n" +
          "ஓம் ராமாயை நம\n" +
          "ஓம் தர்மஜ்ஞாயை நம\n" +
          "ஓம் தர்மசாரிண்யை நம\n" +
          "ஓம் பதிஸம்மானிதாயை நம\n" +
          "\n" +
          "ஓம் ஸுப்ருவே நம\n" +
          "ஓம் ப்ரியார்ஹாயை நம\n" +
          "ஓம் ப்ரியவாதின்யை நம\n" +
          "ஓம் ஸுபானனாயை நம\n" +
          "ஓம் ஸுபாபாங்காயை நம\n" +
          "ஓம் ஸுபாசாராயை நம\n" +
          "ஓம் யஸஸ்வின்யை நம\n" +
          "ஓம் மனஸ்வின்யை நம\n" +
          "ஓம் மத்தகாஸின்யை நம\n" +
          "ஓம் அனகாயை நம\n" +
          "\n" +
          "ஓம் தபஸ்விந்யை நம\n" +
          "ஓம் தர்மபத்ந்யை நம\n" +
          "ஓம் வைதேஹ்யை நம\n" +
          "ஓம் ஜானக்யை நம\n" +
          "ஓம் மதிரேக்ஷணாயை நம\n" +
          "ஓம் தாபஸ்யை நம\n" +
          "ஓம் தர்மநிரதாயை நம\n" +
          "ஓம் நியதாயை நம\n" +
          "ஓம் ப்ரஹ்மசாரிண்யை நம\n" +
          "ஓம் ம்ருதுஸிலாயை நம\n" +
          "\n" +
          "ஓம் சாருதத்யை நம\n" +
          "ஓம் சாருநேத்ரவிலாஸிந்யை நம\n" +
          "ஓம் உத்புல்லோசநாயை நம\n" +
          "ஓம் காந்தாயை நம\n" +
          "ஓம் பத்ருவாத்ஸல்ய பூஷணாயை நம\n" +
          "ஓம் ஸ்வபாவதநுகாயை நம\n" +
          "ஓம் ஸாத்வ்யை நம\n" +
          "ஓம் பத்மாக்ஷ்யை நம\n" +
          "ஓம் பங்கஜப்ரியாயை நம\n" +
          "ஓம் விசக்ஷணாயை நம\n" +
          "\n" +
          "ஓம் அநவத்யாங்க்யை நம\n" +
          "ஓம் ம்ருதுபூர்வாபிபாஷிண்யை நம\n" +
          "ஓம் அக்லிஷ்டமால்யபரணாயை நம\n" +
          "ஓம் வரசரோஹாயை நம\n" +
          "ஓம் வராங்கநாயை நம\n" +
          "ஓம் ஸத்யை நம\n" +
          "ஓம் கமலபத்ராக்ஷ்யை நம\n" +
          "ஓம் ம்ருகஸாவநிபேக்ஷணாயை நம\n" +
          "ஓம் மஹாகுலீநாயை நம\n" +
          "ஓம் பீம்போஷ்ட்யை நம\n" +
          "\n" +
          "ஓம் பீதகௌஸேயவாஸிந்யை நம\n" +
          "ஓம் வீரபார்த்திவபத்ந்யை நம\n" +
          "ஓம் விஸுத்தாயை நம\n" +
          "ஓம் விநயாந்விதாயை நம\n" +
          "ஓம் ஸுகுமார்யை நம\n" +
          "ஓம் ஸுமத்யாயை நம\n" +
          "ஓம் ஸுபகாயை நம\n" +
          "ஓம் ஸுப்ரதிஷ்டிதாயை நம\n" +
          "ஓம் ஸர்வாங்குண ஸம்பந்நாயை நம\n" +
          "ஓம் ஸர்வலோககமநோஹராயை நம\n" +
          "\n" +
          "ஓம் தருணாதித்யஸங்காஸாயை  நம\n" +
          "ஓம் தப்தகாஞ்சந பூஷணாயை நம\n" +
          "ஓம் ஸத்யவ்ரதபராயை நம\n" +
          "ஓம் வராயை நம\n" +
          "ஓம் ஹரிணலோசநாயை நம\n" +
          "ஓம் ஸ்யாமாயை நம\n" +
          "ஓம் விஸுத்தபாவாயை நம\n" +
          "ஓம் ராமபாதாநுவர்திந்யை நம\n" +
          "ஓம் யஸோதநாயை நம\n" +
          "ஓம் உதாரஸலாயை நம\n" +
          "\n" +
          "ஓம் விமலாயை நம\n" +
          "ஓம் க்லேஸநாஸிந்யை நம\n" +
          "ஓம் அதிந்திதாயை நம\n" +
          "ஓம் ஸுவ்ருத்தாயை நம\n" +
          "ஓம் ராமஹ்ருத்யப்ரியாயை நம\n" +
          "ஓம் ஆர்யாயை நம\n" +
          "ஓம் ஸுவிபக்தாங்க்யை நம\n" +
          "ஓம் விநாபரணஸோபிந்யை நம\n" +
          "ஓம் மாந்யாயை நம\n" +
          "ஓம் காந்தஸ்மிதாயை நம\n" +
          "\n" +
          "ஓம் கல்யாண்யை நம\n" +
          "ஓம் ருசிரப்ரபாயை நம\n" +
          "ஓம் ஸ்நிக்தபல்லவ ஸங்காஸாயை நம\n" +
          "ஓம் ஜாம்புநத ஸமப்ரபாயை நம\n" +
          "ஓம் அமலாயை நம\n" +
          "ஓம் ஸீலஸம்பந்நாயை நம\n" +
          "ஓம் இக்ஷ்வாகுகுலதந்திந்யை நம\n" +
          "ஓம் பத்ராயை நம\n" +
          "ஓம் ஸுத்தஸமாசாராயை நம\n" +
          "ஓம் வரார்ஹாயை நம\n" +
          "\n" +
          "ஓம் தநுமத்யமாயை நம\n" +
          "ஓம் ப்ரியகாநநஸஞ்சாராயை நம\n" +
          "ஓம் ஸுகேஸ்யை நம\n" +
          "ஓம் சாருஹாஸிந்யை நம\n" +
          "ஓம் ஹேமாபாயை நம\n" +
          "ஓம் ராடமஹிஷ்யை நம\n" +
          "ஓம் ஸோபநாயை நம\n" +
          "ஓம் ராகவப்ரியாயை நம\n"),
  'krishna': Ashtothram(
      'ஸ்ரீ கிருஷ்ணா',
      'krishna',
      "ஓம் க்ருஷ்ணாய நம:\n" +
          "ஓம் கமலானாதா2ய நம:\n" +
          "ஓம் வாஸுதே3வாய நம:\n" +
          "ஓம் ஸனாதனாய நம:\n" +
          "ஓம் வஸுதே3வாத்மஜாய நம:\n" +
          "ஓம் புண்யாய நம:\n" +
          "ஓம் லீலாமானுஷ விக்3ரஹாய நம:\n" +
          "ஓம் ஶ்ரீவத்ஸ கௌஸ்துப4த4ராய நம:\n" +
          "ஓம் யஶோதா3வத்ஸலாய நம:\n" +
          "ஓம் ஹரயே நம: ॥ 1௦ ॥\n" +
          "\n" +
          "ஓம் சதுர்பு4ஜாத்த சக்ராஸிக3தா3 ஶங்கா3ன்த்3யுதா3யுதா4ய நம:\n" +
          "ஓம் தே3வகீனந்த3னாய நம: \n" +
          "ஓம் ஶ்ரீஶாய நம:\n" +
          "ஓம் நன்த3கோ3ப ப்ரியாத்மஜாய நம:\n" +
          "ஓம் யமுனா வேக3ஸம்ஹாரிணே நம:\n" +
          "ஓம் ப3லப4த்3ர ப்ரியானுஜாய நம:\n" +
          "ஓம் பூதனா ஜீவிதஹராய நம:\n" +
          "ஓம் ஶகடாஸுர ப4ஞ்ஜனாய நம:\n" +
          "ஓம் நன்த3வ்ரஜ ஜனானந்தி3னே நம:\n" +
          "ஓம் ஸச்சிதா3னந்த3 விக்3ரஹாய நம: ॥ 2௦ ॥\n" +
          "\n" +
          "ஓம் நவனீத விலிப்தாங்கா3ய நம:\n" +
          "ஓம் நவனீத நடாய நம:\n" +
          "ஓம் அனகா4ய நம:\n" +
          "ஓம் நவனீத நவாஹாராய நம:\n" +
          "ஓம் முசுகுன்த3 ப்ரஸாத3காய நம:\n" +
          "ஓம் ஷோட3ஶஸ்த்ரீ ஸஹஸ்ரேஶாய நம:\n" +
          "ஓம் த்ரிப4ங்கி3 மது4ராக்ருதயே நம:\n" +
          "ஓம் ஶுகவாக3 ம்ருதாப்3தீ4ன்த3வே நம:\n" +
          "ஓம் கோ3வின்தா3ய நம:\n" +
          "ஓம் யோகி3னாஂ பதயே நம: ॥ 3௦ ॥\n" +
          "\n" +
          "ஓம் வத்ஸவாடசராய நம:\n" +
          "ஓம் அனந்தாய நம:\n" +
          "ஓம் தே3னுகாஸுர ப4ஞ்ஜனாய நம:\n" +
          "ஓம் த்ருணீக்ருத த்ருணாவர்தாய நம:\n" +
          "ஓம் யமல்தா3ர்ஜுன ப4ஞ்ஜனாய நம:\n" +
          "ஓம் உத்தாலதாலபே4த்ரே நம:\n" +
          "ஓம் தமால ஶ்யாமலாக்ருதயே நம:\n" +
          "ஓம் கோ3பகோ3பீஶ்வராய நம:\n" +
          "ஓம் யோகி3னே நம:\n" +
          "ஓம் கோடிஸூர்ய ஸமப்ரபா4ய நம: ॥ 4௦ ॥\n" +
          "\n" +
          "ஓம் இலாபதயே நம:\n" +
          "ஓம் பரஸ்மை ஜ்யோதிஷே நம:\n" +
          "ஓம் யாத3வேன்த்3ராய நம:\n" +
          "ஓம் யதூ3த்3வஹாய நம:\n" +
          "ஓம் வனமாலினே நம:\n" +
          "ஓம் பீதவாஸஸே நம:\n" +
          "ஓம் பாரிஜாதாபஹாரகாய நம:\n" +
          "ஓம் கோ3வர்த4னாசலோத்3த4ர்த்ரே நம:\n" +
          "ஓம் கோ3பாலாய நம:\n" +
          "ஓம் ஸர்வபாலகாய நம: ॥ 5௦ ॥\n" +
          "\n" +
          "ஓம் அஜாய நம:\n" +
          "ஓம் நிரஞ்ஜனாய நம:\n" +
          "ஓம் காமஜனகாய நம:\n" +
          "ஓம் கஞ்ஜலோசனாய நம:\n" +
          "ஓம் மது4க்4னே நம:\n" +
          "ஓம் மது4ரானாதா2ய நம:\n" +
          "ஓம் த்3வாரகானாயகாய நம:\n" +
          "ஓம் ப3லினே நம:\n" +
          "ஓம் வ்ருன்தா3வனான்த ஸஞ்சாரிணே நம:\n" +
          "ஓம் துலஸீதா3ம பூ4ஷணாய நம: ॥ 6௦ ॥\n" +
          "\n" +
          "ஓம் ஶ்யமன்தக மணேர்ஹர்த்ரே நம:\n" +
          "ஓம் நரனாராயணாத்மகாய நம:\n" +
          "ஓம் குப்3ஜாக்ருஷ்ணாம்ப3ரத4ராய நம:\n" +
          "ஓம் மாயினே நம:\n" +
          "ஓம் பரமபூருஷாய நம:\n" +
          "ஓம் முஷ்டிகாஸுர சாணூர மல்லயுத்3த4 விஶாரதா3ய நம:\n" +
          "ஓம் ஸம்ஸாரவைரிணே நம:\n" +
          "ஓம் கம்ஸாரயே நம:\n" +
          "ஓம் முராரயே நம: \n" +
          "ஓம் நரகான்தகாய நம: ॥ 7௦ ॥\n" +
          "\n" +
          "ஓம் அனாதி3 ப்3ரஹ்மசாரிணே நம:\n" +
          "ஓம் க்ருஷ்ணாவ்யஸன கர்ஶகாய நம:\n" +
          "ஓம் ஶிஶுபால ஶிரஶ்சே2த்ரே நம:\n" +
          "ஓம் து3ர்யோத4ன குலான்தகாய நம:\n" +
          "ஓம் விது3ராக்ரூர வரதா3ய நம:\n" +
          "ஓம் விஶ்வரூப ப்ரத3ர்ஶகாய நம:\n" +
          "ஓம் ஸத்யவாசே நம:\n" +
          "ஓம் ஸத்ய ஸங்கல்பாய நம:\n" +
          "ஓம் ஸத்யபா4மாரதாய நம:\n" +
          "ஓம் ஜயினே நம: ॥ 8௦ ॥\n" +
          "\n" +
          "ஓம் ஸுப4த்3ரா பூர்வஜாய நம:\n" +
          "ஓம் ஜிஷ்ணவே நம:\n" +
          "ஓம் பீ4ஷ்மமுக்தி ப்ரதா3யகாய நம:\n" +
          "ஓம் ஜக3த்3கு3ரவே நம:\n" +
          "ஓம் ஜக3ன்னாதா2ய நம:\n" +
          "ஓம் வேணுனாத3 விஶாரதா3ய நம:\n" +
          "ஓம் வ்ருஷபா4ஸுர வித்4வம்ஸினே நம:\n" +
          "ஓம் பா3ணாஸுர கரான்தகாய நம:\n" +
          "ஓம் யுதி4ஷ்டி2ர ப்ரதிஷ்டா2த்ரே நம:\n" +
          "ஓம் ப3ர்ஹிப3ர்ஹாவதம்ஸகாய நம: ॥ 9௦ ॥\n" +
          "\n" +
          "ஓம் பார்த2ஸாரத2யே நம:\n" +
          "ஓம் அவ்யக்தாய நம:\n" +
          "ஓம் கீ3தாம்ருத மஹோத3த4யே நம:\n" +
          "ஓம் கால்தீ3ய ப2ணிமாணிக்ய ரஞ்ஜித ஶ்ரீபதா3ம்பு3ஜாய நம:\n" +
          "ஓம் தா3மோத3ராய நம:\n" +
          "ஓம் யஜ்ஞ்னபோ4க்ர்தே நம:\n" +
          "ஓம் தா3னவேன்த்3ர வினாஶகாய நம:\n" +
          "ஓம் நாராயணாய நம:\n" +
          "ஓம் பரஸ்மை ப்3ரஹ்மணே நம:\n" +
          "ஓம் பன்னகா3ஶன வாஹனாய நம: ॥ 1௦௦ ॥\n" +
          "\n" +
          "ஓம் ஜலக்ரீடா3ஸமாஸக்த கோ3பீவஸ்த்ராபஹாரகாய நம:\n" +
          "ஓம் புண்யஶ்லோகாய நம:\n" +
          "ஓம் தீர்த2பாதா3ய நம:\n" +
          "ஓம் வேத3வேத்3யாய நம:\n" +
          "ஓம் த3யானித4யே நம:\n" +
          "ஓம் ஸர்வதீர்தா2த்மகாய நம:\n" +
          "ஓம் ஸர்வக்3ரஹரூபிணே நம:\n" +
          "ஓம் பராத்பராய நம: ॥ 1௦8 ॥\n"),
  'aandal': Ashtothram(
      'ஸ்ரீ ஆண்டாள்',
      'aandal',
      "ஓம் ஶ்ரீரங்க³நாயக்யை நம꞉ ।\n" +
          "ஓம் கோ³தா³யை நம꞉ ।\n" +
          "ஓம் விஷ்ணுசித்தாத்மஜாயை நம꞉ ।\n" +
          "ஓம் ஸத்யை நம꞉ ।\n" +
          "ஓம் கோ³பீவேஷத⁴ராயை நம꞉ ।\n" +
          "ஓம் தே³வ்யை நம꞉ ।\n" +
          "ஓம் பூ⁴ஸுதாயை நம꞉ ।\n" +
          "ஓம் போ⁴க³ஶாலிந்யை நம꞉ ।\n" +
          "ஓம் துலஸீகாநநோத்³பூ⁴தாயை நம꞉ । 9\n" +
          "\n" +
          "ஓம் ஶ்ரீத⁴ந்விபுரவாஸிந்யை நம꞉ ।\n" +
          "ஓம் ப⁴ட்டநாத²ப்ரியகர்யை நம꞉ ।\n" +
          "ஓம் ஶ்ரீக்ருஷ்ணஹிதபோ⁴கி³ந்யை நம꞉ ।\n" +
          "ஓம் ஆமுக்தமால்யதா³யை நம꞉ ।\n" +
          "ஓம் பா³லாயை நம꞉ ।\n" +
          "ஓம் ரங்க³நாத²ப்ரியாயை நம꞉ ।\n" +
          "ஓம் பராயை நம꞉ ।\n" +
          "ஓம் விஶ்வம்ப⁴ராயை நம꞉ ।\n" +
          "ஓம் கலாலாபாயை நம꞉ । 18\n" +
          "\n" +
          "ஓம் யதிராஜஸஹோத³ர்யை நம꞉ ।\n" +
          "ஓம் க்ருஷ்ணாநுரக்தாயை நம꞉ ।\n" +
          "ஓம் ஸுப⁴கா³யை நம꞉ ।\n" +
          "ஓம் ஸுலப⁴ஶ்ரியை நம꞉ ।\n" +
          "ஓம் ஸுலக்ஷணாயை நம꞉ ।\n" +
          "ஓம் லக்ஷ்மீப்ரியஸக்²யை நம꞉ ।\n" +
          "ஓம் ஶ்யாமாயை நம꞉ ।\n" +
          "ஓம் த³யாஞ்சிதத்³ருக³ஞ்சலாயை நம꞉ ।\n" +
          "ஓம் ப²ல்கு³ந்யாவிர்ப⁴வாயை நம꞉ । 27\n" +
          "\n" +
          "ஓம் ரம்யாயை நம꞉ ।\n" +
          "ஓம் த⁴நுர்மாஸக்ருதவ்ரதாயை நம꞉ ।\n" +
          "ஓம் சம்பகாஶோகபுந்நாக³ மாலதீ விளஸத்கசாயை நம꞉ ।\n" +
          "ஓம் ஆகாரத்ரயஸம்பந்நாயை நம꞉ ।\n" +
          "ஓம் நாராயணபதா³ஶ்ரிதாயை நம꞉ ।\n" +
          "ஓம் ஶ்ரீமத³ஷ்டாக்ஷரீ மந்த்ரராஜஸ்தி²த மநோரதா²யை நம꞉ ।\n" +
          "ஓம் மோக்ஷப்ரதா³நநிபுணாயை நம꞉ ।\n" +
          "ஓம் மநுரத்நாதி⁴தே³வதாயை நம꞉ ।\n" +
          "ஓம் ப்³ரஹ்மண்யாயை நம꞉ । 36\n" +
          "\n" +
          "ஓம் லோகஜநந்யை நம꞉ ।\n" +
          "ஓம் லீலாமாநுஷரூபிண்யை நம꞉ ।\n" +
          "ஓம் ப்³ரஹ்மஜ்ஞாநப்ரதா³யை நம꞉ ।\n" +
          "ஓம் மாயாயை நம꞉ ।\n" +
          "ஓம் ஸச்சிதா³நந்த³விக்³ரஹாயை நம꞉ ।\n" +
          "ஓம் மஹாபதிவ்ரதாயை நம꞉ ।\n" +
          "ஓம் விஷ்ணுகு³ணகீர்தநலோலுபாயை நம꞉ ।\n" +
          "ஓம் ப்ரபந்நார்திஹராயை நம꞉ ।\n" +
          "ஓம் நித்யாயை நம꞉ । 45\n" +
          "\n" +
          "ஓம் வேத³ஸௌத⁴விஹாரிண்யை நம꞉ ।\n" +
          "ஓம் ஶ்ரீரங்க³நாத² மாணிக்யமஞ்ஜர்யை நம꞉ ।\n" +
          "ஓம் மஞ்ஜுபா⁴ஷிண்யை நம꞉ ।\n" +
          "ஓம் பத்³மப்ரியாயை நம꞉ ।\n" +
          "ஓம் பத்³மஹஸ்தாயை நம꞉ ।\n" +
          "ஓம் வேதா³ந்தத்³வயபோ³தி⁴ந்யை நம꞉ ।\n" +
          "ஓம் ஸுப்ரஸந்நாயை நம꞉ ।\n" +
          "ஓம் ப⁴க³வத்யை நம꞉ ।\n" +
          "ஓம் ஶ்ரீஜநார்த³நதீ³பிகாயை நம꞉ । 54\n" +
          "\n" +
          "ஓம் ஸுக³ந்தா⁴வயவாயை நம꞉ ।\n" +
          "ஓம் சாருரங்க³மங்க³ளதீ³பிகாயை நம꞉ ।\n" +
          "ஓம் த்⁴வஜவஜ்ராங்குஶாப்³ஜாங்க ம்ருது³பாத³ தலாஞ்சிதாயை நம꞉ ।\n" +
          "ஓம் தாரகாகாரநக²ராயை நம꞉ ।\n" +
          "ஓம் ப்ரவாளம்ருது³ளாங்கு³ல்யை நம꞉ ।\n" +
          "ஓம் கூர்மோபமேய பாதோ³ர்த்⁴வபா⁴கா³யை நம꞉ ।\n" +
          "ஓம் ஶோப⁴நபார்ஷ்ணிகாயை நம꞉ ।\n" +
          "ஓம் வேதா³ர்த²பா⁴வதத்த்வஜ்ஞாயை நம꞉ ।\n" +
          "ஓம் லோகாராத்⁴யாங்க்⁴ரிபங்கஜாயை நம꞉ । 63\n" +
          "\n" +
          "ஓம் ஆநந்த³பு³த்³பு³தா³காரஸுகு³ள்பா²யை நம꞉ ।\n" +
          "ஓம் பரமாணுகாயை நம꞉ ।\n" +
          "ஓம் தேஜ꞉ஶ்ரியோஜ்ஜ்வலத்⁴ருதபாதா³ங்கு³ளி ஸுபூ⁴ஷிதாயை நம꞉ ।\n" +
          "ஓம் மீநகேதநதூணீர சாருஜங்கா⁴ விராஜிதாயை நம꞉ ।\n" +
          "ஓம் ககுத்³வஜ்ஜாநுயுக்³மாட்⁴யாயை நம꞉ ।\n" +
          "ஓம் ஸ்வர்ணரம்பா⁴ப⁴ஸக்தி²காயை நம꞉ ।\n" +
          "ஓம் விஶாலஜக⁴நாயை நம꞉ ।\n" +
          "ஓம் பீநஸுஶ்ரோண்யை நம꞉ ।\n" +
          "ஓம் மணிமேக²லாயை நம꞉ । 72\n" +
          "\n" +
          "ஓம் ஆநந்த³ஸாக³ராவர்த க³ம்பீ⁴ராம்போ⁴ஜ நாபி⁴காயை நம꞉ ।\n" +
          "ஓம் பா⁴ஸ்வத்³வலித்ரிகாயை நம꞉ ।\n" +
          "ஓம் சாருஜக³த்பூர்ணமஹோத³ர்யை நம꞉ ।\n" +
          "ஓம் நவவல்லீரோமராஜ்யை நம꞉ ।\n" +
          "ஓம் ஸுதா⁴கும்பா⁴யிதஸ்தந்யை நம꞉ ।\n" +
          "ஓம் கல்பமாலாநிப⁴பு⁴ஜாயை நம꞉ ।\n" +
          "ஓம் சந்த்³ரக²ண்ட³நகா²ஞ்சிதாயை நம꞉ ।\n" +
          "ஓம் ஸுப்ரவாஶாங்கு³ளீந்யஸ்த மஹாரத்நாங்கு³ளீயகாயை நம꞉ ।\n" +
          "ஓம் நவாருணப்ரவாளாப⁴ பாணிதே³ஶஸமஞ்சிதாயை நம꞉ । 81\n" +
          "\n" +
          "ஓம் கம்பு³கண்ட்²யை நம꞉ ।\n" +
          "ஓம் ஸுசுபு³காயை நம꞉ ।\n" +
          "ஓம் பி³ம்போ³ஷ்ட்²யை நம꞉ ।\n" +
          "ஓம் குந்த³த³ந்தயுஜே நம꞉ ।\n" +
          "ஓம் காருண்யரஸநிஷ்யந்த³ நேத்ரத்³வயஸுஶோபி⁴தாயை நம꞉ ।\n" +
          "ஓம் முக்தாஶுசிஸ்மிதாயை நம꞉ ।\n" +
          "ஓம் சாருசாம்பேயநிப⁴நாஸிகாயை நம꞉ ।\n" +
          "ஓம் த³ர்பணாகாரவிபுலகபோல த்³விதயாஞ்சிதாயை நம꞉ ।\n" +
          "ஓம் அநந்தார்கப்ரகாஶோத்³யந்மணி தாடங்கஶோபி⁴தாயை நம꞉ । 90\n" +
          "\n" +
          "ஓம் கோடிஸூர்யாக்³நிஸங்காஶ நாநாபூ⁴ஷணபூ⁴ஷிதாயை நம꞉ ।\n" +
          "ஓம் ஸுக³ந்த⁴வத³நாயை நம꞉ ।\n" +
          "ஓம் ஸுப்⁴ருவே நம꞉ ।\n" +
          "ஓம் அர்த⁴சந்த்³ரளலாடிகாயை நம꞉ ।\n" +
          "ஓம் பூர்ணசந்த்³ராநநாயை நம꞉ ।\n" +
          "ஓம் நீலகுடிலாலகஶோபி⁴தாயை நம꞉ ।\n" +
          "ஓம் ஸௌந்த³ர்யஸீமாயை நம꞉ ।\n" +
          "ஓம் விளஸத்கஸ்தூரீதிலகோஜ்ஜ்வலாயை நம꞉ ।\n" +
          "ஓம் த⁴க³த்³த⁴கா³யமாநோத்³யந்மணி ஸீமந்தபூ⁴ஷணாயை நம꞉ । 99\n" +
          "\n" +
          "ஓம் ஜாஜ்வல்யமாநஸத்³ரத்ந தி³வ்யசூடா³வதம்ஸகாயை நம꞉ ।\n" +
          "ஓம் ஸூர்யார்த⁴சந்த்³ரவிளஸத் பூ⁴ஷணஞ்சித வேணிகாயை நம꞉ ।\n" +
          "ஓம் அத்யர்காநல தேஜோதி⁴மணி கஞ்சுகதா⁴ரிண்யை நம꞉ ।\n" +
          "ஓம் ஸத்³ரத்நாஞ்சிதவித்³யோத வித்³யுத்குஞ்ஜாப⁴ ஶாடிகாயை நம꞉ ।\n" +
          "ஓம் நாநாமணிக³ணாகீர்ண ஹேமாங்க³த³ஸுபூ⁴ஷிதாயை நம꞉ ।\n" +
          "ஓம் குங்குமாக³ரு கஸ்தூரீ தி³வ்யசந்த³நசர்சிதாயை நம꞉ ।\n" +
          "ஓம் ஸ்வோசிதௌஜ்ஜ்வல்ய விவித⁴விசித்ரமணிஹாரிண்யை நம꞉ ।\n" +
          "ஓம் அஸங்க்²யேய ஸுக²ஸ்பர்ஶ ஸர்வாதிஶய பூ⁴ஷணாயை நம꞉ ।\n" +
          "ஓம் மல்லிகாபாரிஜாதாதி³ தி³வ்யபுஷ்பஸ்ரக³ஞ்சிதாயை நம꞉ । 108\n" +
          "ஓம் ஶ்ரீரங்க³நிலயாயை நம꞉ ।\n" +
          "ஓம் பூஜ்யாயை நம꞉ ।\n" +
          "ஓம் தி³வ்யதே³ஶஸுஶோபி⁴தாயை நம꞉ । 111\n"),
  'ramanujar': Ashtothram(
      'ஸ்ரீ ராமானுஜர்',
      'ramanujar',
      "ஓம் ராமாநுஜாய நம꞉ ।\n" +
          "ஓம் புஷ்கராக்ஷாய நம꞉ ।\n" +
          "ஓம் யதீந்த்³ராய நம꞉ ।\n" +
          "ஓம் கருணாகராய நம꞉ ।\n" +
          "ஓம் காந்திமத்யாத்மஜாய நம꞉ ।\n" +
          "ஓம் ஶ்ரீமதே நம꞉ ।\n" +
          "ஓம் லீலாமாநுஷவிக்³ரஹாய நம꞉ ।\n" +
          "ஓம் ஸர்வஶாஸ்த்ரார்த²தத்த்வஜ்ஞாய நம꞉ ।\n" +
          "ஓம் ஸர்வஜ்ஞாய நம꞉ । 9\n" +
          "\n" +
          "ஓம் ஸஜ்ஜநப்ரியாய நம꞉ ।\n" +
          "ஓம் நாராயணக்ருபாபாத்ராய நம꞉ ।\n" +
          "ஓம் ஶ்ரீபூ⁴தபுரநாயகாய நம꞉ ।\n" +
          "ஓம் அநகா⁴ய நம꞉ ।\n" +
          "ஓம் ப⁴க்தமந்தா³ராய நம꞉ ।\n" +
          "ஓம் கேஶவாநந்த³வர்த⁴நாய நம꞉ ।\n" +
          "ஓம் காஞ்சீபூர்ணப்ரியஸகா²ய நம꞉ ।\n" +
          "ஓம் ப்ரணதார்திவிநாஶகாய நம꞉ ।\n" +
          "ஓம் புண்யஸங்கீர்தநாய நம꞉ । 18\n" +
          "\n" +
          "ஓம் புண்யாய நம꞉ ।\n" +
          "ஓம் ப்³ரஹ்மராக்ஷஸமோசகாய நம꞉ ।\n" +
          "ஓம் யாத³வாபாதி³தாபார்த²வ்ருக்ஷச்சே²த³குடா²ரகாய நம꞉ ।\n" +
          "ஓம் அமோகா⁴ய நம꞉ ।\n" +
          "ஓம் லக்ஷ்மணமுநயே நம꞉ ।\n" +
          "ஓம் ஶாரதா³ஶோகநாஶகாய நம꞉ ।\n" +
          "ஓம் நிரந்தரஜநாஜ்ஞாநநிர்மோசநவிசக்ஷணாய நம꞉ ।\n" +
          "ஓம் வேதா³ந்தத்³வயஸாரஜ்ஞாய நம꞉ ।\n" +
          "ஓம் வரதா³ம்பு³ப்ரதா³யகாய நம꞉ । 27\n" +
          "\n" +
          "ஓம் வரதா³பி⁴ப்ராயதத்த்வஜ்ஞாய நம꞉ ।\n" +
          "ஓம் யாமுநாங்கு³ளிமோசகாய நம꞉ ।\n" +
          "ஓம் தே³வராஜக்ருபாலப்³த⁴ஷட்³வாக்யார்த²மஹோத³த⁴யே நம꞉ ।\n" +
          "ஓம் பூர்ணார்யலப்³த⁴ஸந்மந்த்ராய நம꞉ ।\n" +
          "ஓம் ஶௌரிபாதா³ப்³ஜஷட்பதா³ய நம꞉ ।\n" +
          "ஓம் ப²ணாப்ருஷ்ட²லஸத்³விஷ்ணுபாதா³ங்கஸமபுண்ட்³ரவதே நம꞉ ।\n" +
          "ஓம் த்ரித³ண்ட³தா⁴ரிணே நம꞉ ।\n" +
          "ஓம் ப்³ரஹ்மஜ்ஞாய நம꞉ ।\n" +
          "ஓம் ப்³ரஹ்மஜ்ஞாநபராயணாய நம꞉ । 36\n" +
          "\n" +
          "ஓம் ரங்கே³ஶகைங்கர்யரதாய நம꞉ ।\n" +
          "ஓம் விபூ⁴தித்³வயநாயகாய நம꞉ ।\n" +
          "ஓம் கோ³ஷ்டீ²பூர்ணக்ருபாலப்³த⁴மந்த்ரராஜப்ரகாஶகாய நம꞉ ।\n" +
          "ஓம் வரரங்கா³நுகம்பாத்தத்³ராவிடா³ம்நாயபாரகா³ய நம꞉ ।\n" +
          "ஓம் மாலாத⁴ரார்யஸுஜ்ஞாதத்³ராவிடா³ம்நாயதத்த்வதி⁴யே நம꞉ ।\n" +
          "ஓம் சதுஸ்ஸப்ததிஶிஷ்யாட்³யாய நம꞉ ।\n" +
          "ஓம் பஞ்சாசார்யபதா³ஶ்ரயாய நம꞉ ।\n" +
          "ஓம் ப்ரபீதவிஷதீர்தா²ம்ப⁴꞉ப்ரகடீக்ருதவைப⁴வாய நம꞉ ।\n" +
          "ஓம் ப்ரபந்நஜநகூடஸ்தா²ய நம꞉ । 45\n" +
          "\n" +
          "ஓம் கோ³விந்தா³ர்யத்³விஜாநுஜாய நம꞉ ।\n" +
          "ஓம் ப்ரணதார்திஹராசார்யத³த்தபி⁴க்ஷைகபோ⁴ஜநாய நம꞉ ।\n" +
          "ஓம் பவித்ரீக்ருதகூரேஶாய நம꞉ ।\n" +
          "ஓம் பா⁴கி³நேயத்ரித³ண்ட³காய நம꞉ ।\n" +
          "ஓம் கூரேஶதா³ஶரத்²யாதி³சரமார்த²ப்ரகாஶகாய நம꞉ ।\n" +
          "ஓம் ரங்கே³ஶவேங்கடேஶாதி³ப்ரகடீக்ருதவைப⁴வாய நம꞉ ।\n" +
          "ஓம் தே³வராஜார்சநரதாய நம꞉ ।\n" +
          "ஓம் மூகமுக்திப்ரதா³யகாய நம꞉ ।\n" +
          "ஓம் யஜ்ஞமூர்திப்ரதிஷ்டா²த்ரே நம꞉ । 54\n" +
          "\n" +
          "ஓம் மந்த்ரதா³ய நம꞉ ।\n" +
          "ஓம் த⁴ரணீத⁴ராய நம꞉ ।\n" +
          "ஓம் வரதா³சார்யஸத்³ப⁴க்தாய நம꞉ ।\n" +
          "ஓம் யஜ்ஞேஶார்திவிநாஶகாய நம꞉ ।\n" +
          "ஓம் அநந்தாபீ⁴ஷ்டப²லதா³ய நம꞉ ।\n" +
          "ஓம் விட²லேந்த்³ரப்ரபூஜிதாய நம꞉ ।\n" +
          "ஓம் ஶ்ரீஶைலபூர்ணகருணாலப்³த⁴ராமாயணார்த²காய நம꞉ ।\n" +
          "ஓம் வ்யாஸஸூத்ரார்த²தத்த்வஜ்ஞாய நம꞉ ।\n" +
          "ஓம் போ³தா⁴யநமதாநுகா³ய நம꞉ । 63\n" +
          "\n" +
          "ஓம் ஶ்ரீபா⁴ஷ்யாதி³மஹாக்³ரந்த²காரகாய நம꞉ ।\n" +
          "ஓம் கலிநாஶகாய நம꞉ ।\n" +
          "ஓம் அத்³வைதமதவிச்சே²த்ரே நம꞉ ।\n" +
          "ஓம் விஶிஷ்டாத்³வைதபாரகா³ய நம꞉ ।\n" +
          "ஓம் குரங்க³நக³ரீபூர்ணமந்த்ரரத்நோபதே³ஶகாய நம꞉ ।\n" +
          "ஓம் விநாஶிதாகி²லமதாய நம꞉ ।\n" +
          "ஓம் ஶேஷீக்ருதரமாபதயே நம꞉ ।\n" +
          "ஓம் புத்ரீக்ருதஶடா²ராதயே நம꞉ ।\n" +
          "ஓம் ஶட²ஜித்³ருணமோசகாய நம꞉ । 72\n" +
          "\n" +
          "ஓம் பா⁴ஷாத³த்தஹயக்³ரீவாய நம꞉ ।\n" +
          "ஓம் பா⁴ஷ்யகாராய நம꞉ ।\n" +
          "ஓம் மஹாயஶஸே நம꞉ ।\n" +
          "ஓம் பவித்ரீக்ருதபூ⁴பா⁴கா³ய நம꞉ ।\n" +
          "ஓம் கூர்மநாத²ப்ரகாஶகாய நம꞉ ।\n" +
          "ஓம் ஶ்ரீவேங்கடாசலாதீ⁴ஶஶங்க²சக்ரப்ரதா³யகாய நம꞉ ।\n" +
          "ஓம் ஶ்ரீவேங்கடேஶஶ்வஶுராய நம꞉ ।\n" +
          "ஓம் ஶ்ரீரமாஸக²தே³ஶிகாய நம꞉ ।\n" +
          "ஓம் க்ருபாமாத்ரப்ரஸந்நார்யாய நம꞉ । 81\n" +
          "\n" +
          "ஓம் கோ³பிகாமோக்ஷதா³யகாய நம꞉ ।\n" +
          "ஓம் ஸமீசீநார்யஸச்சி²ஷ்யஸத்க்ருதாய நம꞉ ।\n" +
          "ஓம் வைஷ்ணவப்ரியாய நம꞉ ।\n" +
          "ஓம் க்ருமிகண்ட²ந்ருபத்⁴வம்ஸிநே நம꞉ ।\n" +
          "ஓம் ஸர்வமந்த்ரமஹோத³த⁴யே நம꞉ ।\n" +
          "ஓம் அங்கீ³க்ருதாந்த்⁴ரபூர்ணாய நம꞉ ।\n" +
          "ஓம் ஸாலக்³ராமப்ரதிஷ்டி²தாய நம꞉ ।\n" +
          "ஓம் ஶ்ரீப⁴க்தக்³ராமபூர்ணேஶாய நம꞉ ।\n" +
          "ஓம் விஷ்ணுவர்த⁴நரக்ஷகாய நம꞉ । 90\n" +
          "\n" +
          "ஓம் பௌ³த்³த⁴த்⁴வாந்தஸஹஸ்ராம்ஶவே நம꞉ ।\n" +
          "ஓம் ஶேஷரூபப்ரத³ர்ஶகாய நம꞉ ।\n" +
          "ஓம் நக³ரீக்ருதவேதா³த்³ரயே நம꞉ ।\n" +
          "ஓம் டி³ல்லீஶ்வரஸமர்சிதாய நம꞉ ।\n" +
          "ஓம் நாராயணப்ரதிஷ்டா²த்ரே நம꞉ ।\n" +
          "ஓம் ஸம்பத்புத்ரவிமோசகாய நம꞉ ।\n" +
          "ஓம் ஸம்பத்குமாரஜநகாய நம꞉ ।\n" +
          "ஓம் ஸாது⁴ளோகஶிகா²மணயே நம꞉ ।\n" +
          "ஓம் ஸுப்ரதிஷ்டி²தகோ³விந்த³ராஜாய நம꞉ । 99\n" +
          "\n" +
          "ஓம் பூர்ணமநோரதா²ய நம꞉ ।\n" +
          "ஓம் கோ³தா³க்³ரஜாய நம꞉ ।\n" +
          "ஓம் தி³க்³விஜேத்ரே நம꞉ ।\n" +
          "ஓம் கோ³தா³பீ⁴ஷ்டப்ரபூரகாய நம꞉ ।\n" +
          "ஓம் ஸர்வஸம்ஶயவிச்சே²த்ரே நம꞉ ।\n" +
          "ஓம் விஷ்ணுலோகப்ரதா³யகாய நம꞉ ।\n" +
          "ஓம் அவ்யாஹதமஹத்³வர்த்மநே நம꞉ ।\n" +
          "ஓம் யதிராஜாய நம꞉ ।\n" +
          "ஓம் ஜக³த்³கு³ரவே நம꞉ । 108\n"),
  'dhurga': Ashtothram(
      'ஸ்ரீ துர்கா',
      'dhurga',
      "ஓம் து3ர்கா3யை நம:\n" +
          "ஓம் ஶிவாயை நம:\n" +
          "ஓம் மஹாலக்ஷ்ம்யை நம:\n" +
          "ஓம் மஹாகௌ3ர்யை நம:\n" +
          "ஓம் சண்டி3காயை நம:\n" +
          "ஓம் ஸர்வஜ்ஞாயை நம:\n" +
          "ஓம் ஸர்வாலோகேஶாயை நம:\n" +
          "ஓம் ஸர்வகர்மப2லப்ரதா3யை நம:\n" +
          "ஓம் ஸர்வதீர்த4மய்யை நம:\n" +
          "ஓம் புண்யாயை நம: (1௦)\n" +
          "\n" +
          "ஓம் தே3வயோனயே நம:\n" +
          "ஓம் அயோனிஜாயை நம: \n" +
          "ஓம் பூ4மிஜாயை நம:\n" +
          "ஓம் நிர்கு3ணாயை நம:\n" +
          "ஓம் ஆதா4ரஶக்த்யை நம:\n" +
          "ஓம் அனீஶ்வர்யை நம:\n" +
          "ஓம் நிர்கு3ணாயை நம:\n" +
          "ஓம் நிரஹங்காராயை நம:\n" +
          "ஓம் ஸர்வக3ர்வ விமர்தி3ன்யை நம:\n" +
          "ஓம் ஸர்வலோகப்ரியாயை நம: (2௦)\n" +
          "\n" +
          "ஓம் வாண்யை நம:\n" +
          "ஓம் ஸர்வவித்3யாதி4 தே3வதாயை நம:\n" +
          "ஓம் பார்வத்யை நம:\n" +
          "ஓம் தே3வமாத்ரே நம:\n" +
          "ஓம் வனீஶாயை நம:\n" +
          "ஓம் வின்த்4யவாஸின்யை நம:\n" +
          "ஓம் தேஜோவத்யை நம:\n" +
          "ஓம் மஹாமாத்ரே நம:\n" +
          "ஓம் கோடிஸூர்ய ஸமப்ரபா4யை நம:\n" +
          "ஓம் தே3வதாயை நம: (3௦)\n" +
          "\n" +
          "ஓம் வஹ்னிரூபாயை நம:\n" +
          "ஓம் ஸதேஜஸே நம:\n" +
          "ஓம் வர்ணரூபிண்யை நம:\n" +
          "ஓம் கு3ணாஶ்ரயாயை நம:\n" +
          "ஓம் கு3ணமத்4யாயை நம:\n" +
          "ஓம் கு3ணத்ரய விவர்ஜிதாயை நம:\n" +
          "ஓம் கர்மஜ்ஞானப்ரதா3யை நம:\n" +
          "ஓம் கான்தாயை நம:\n" +
          "ஓம் ஸர்வஸம்ஹார காரிண்யை நம:\n" +
          "ஓம் த4ர்மஜ்ஞானாயை நம: (4௦)\n" +
          "\n" +
          "ஓம் த4ர்மனிஷ்டா2யை நம:\n" +
          "ஓம் ஸர்வகர்ம விவர்ஜிதாயை நம:\n" +
          "ஓம் காமாக்ஷ்யை நம:\n" +
          "ஓம் காமஸம்ஹர்த்ர்யை நம:\n" +
          "ஓம் காமக்ரோத4 விவர்ஜிதாயை நம:\n" +
          "ஓம் ஶாங்கர்யை நம:\n" +
          "ஓம் ஶாம்ப4வ்யை நம:\n" +
          "ஓம் ஶான்தாயை நம:\n" +
          "ஓம் சன்த்3ரஸுர்யாக்3னி லோசனாயை நம:\n" +
          "ஓம் ஸுஜயாயை நம: (5௦)\n" +
          "\n" +
          "ஓம் ஜயபூ4மிஷ்டா2யை நம:\n" +
          "ஓம் ஜாஹ்னவ்யை நம:\n" +
          "ஓம் ஜனபூஜிதாயை நம:\n" +
          "ஓம் ஶாஸ்த்ர்யை நம:\n" +
          "ஓம் ஶாஸ்த்ரமய்யை நம:\n" +
          "ஓம் நித்யாயை நம:\n" +
          "ஓம் ஶுபா4யை நம:\n" +
          "ஓம் சன்த்3ரார்த4மஸ்தகாயை நம:\n" +
          "ஓம் பா4ரத்யை நம:\n" +
          "ஓம் ப்4ராமர்யை நம: (6௦)\n" +
          "\n" +
          "ஓம் கல்பாயை நம:\n" +
          "ஓம் கரால்த்3யை நம:\n" +
          "ஓம் க்ருஷ்ண பிங்க3ல்தா3யை நம:\n" +
          "ஓம் ப்3ராஹ்ம்யை நம:\n" +
          "ஓம் நாராயண்யை நம:\n" +
          "ஓம் ரௌத்3ர்யை நம:\n" +
          "ஓம் சன்த்3ராம்ருத பரிஸ்ருதாயை நம:\n" +
          "ஓம் ஜ்யேஷ்டா2யை நம:\n" +
          "ஓம் இன்தி3ராயை நம: \n" +
          "ஓம் மஹாமாயாயை நம: (7௦)\n" +
          "\n" +
          "ஓம் ஜக3த்ஸ்ருஷ்ட்யதி4காரிண்யை நம:\n" +
          "ஓம் ப்3ரஹ்மாண்ட3கோடி ஸம்ஸ்தா2னாயை நம:\n" +
          "ஓம் காமின்யை நம:\n" +
          "ஓம் கமலாலயாயை நம:\n" +
          "ஓம் காத்யாயன்யை நம:\n" +
          "ஓம் கலாதீதாயை நம:\n" +
          "ஓம் காலஸம்ஹாரகாரிண்யை நம:\n" +
          "ஓம் யோக3னிஷ்டா2யை நம:\n" +
          "ஓம் யோகி3க3ம்யாயை நம:\n" +
          "ஓம் யோகி3த்4யேயாயை நம: (8௦)\n" +
          "\n" +
          "ஓம் தபஸ்வின்யை நம:\n" +
          "ஓம் ஜ்ஞானரூபாயை நம:\n" +
          "ஓம் நிராகாராயை நம:\n" +
          "ஓம் ப4க்தாபீ4ஷ்ட ப2லப்ரதா3யை நம:\n" +
          "ஓம் பூ4தாத்மிகாயை நம:\n" +
          "ஓம் பூ4தமாத்ரே நம:\n" +
          "ஓம் பூ4தேஶ்யை நம:\n" +
          "ஓம் பூ4ததா4ரிண்யை நம:\n" +
          "ஓம் ஸ்வதா4யை நம: \n" +
          "ஓம் நாரீ மத்4யக3தாயை நம: (9௦)\n" +
          "\n" +
          "ஓம் ஷடா3தா4ராதி4 வர்தி4ன்யை நம:\n" +
          "ஓம் மோஹிதாம்ஶுப4வாயை நம: \n" +
          "ஓம் ஶுப்4ராயை நம:\n" +
          "ஓம் ஸூக்ஷ்மாயை நம:\n" +
          "ஓம் மாத்ராயை நம:\n" +
          "ஓம் நிராலஸாயை நம:\n" +
          "ஓம் நிம்னகா3யை நம:\n" +
          "ஓம் நீலஸங்காஶாயை நம:\n" +
          "ஓம் நித்யானந்தா3யை நம:\n" +
          "ஓம் ஹராயை நம: (1௦௦)\n" +
          "\n" +
          "ஓம் பராயை நம:\n" +
          "ஓம் ஸர்வஜ்ஞானப்ரதா3யை நம:\n" +
          "ஓம் அனந்தாயை நம:\n" +
          "ஓம் ஸத்யாயை நம:\n" +
          "ஓம் து3ர்லப4ரூபிண்யை நம:\n" +
          "ஓம் ஸரஸ்வத்யை நம:\n" +
          "ஓம் ஸர்வக3தாயை நம:\n" +
          "ஓம் ஸர்வாபீ4ஷ்டப்ரதா3யின்யை நம: (1௦8)\n"),
  'indrakshi': Ashtothram(
      'ஸ்ரீ இந்த்ராக்ஷீ',
      'indrakshi',
      "ஓம் இந்த்³ராக்ஷீ நாம்ந்யை தே³வ்யை நம: ।\n" +
          "ஓம் தை³வதை: ஸமுதா³ஹ்ருʼதாயை நம: ।\n" +
          "ஓம் கௌ³ர்யை நம: ।\n" +
          "ஓம் ஶாகம்ப⁴ர்யை நம: ।\n" +
          "ஓம் தே³வ்யை நம: ।\n" +
          "ஓம் து³ர்கா³நாம்நீதி விஶ்ருதாயை நம: ।\n" +
          "ஓம் காத்யாயந்யை நம: ।\n" +
          "ஓம் மஹாதே³வ்யை நம: ।\n" +
          "ஓம் சண்ட³க⁴ண்டாயை நம: । சந்த்³ரக⁴ண்டாயை\n" +
          "ஓம் மஹாதபஸே நம: । 10 ।\n" +
          "Advertisement\n" +
          "\n" +
          "\n" +
          "ஓம் கா³யத்ர்யை நம: ।\n" +
          "ஓம் ஸாவித்ர்யை நம: ।\n" +
          "ஓம் ப்³ரஹ்மாண்யை நம: ।\n" +
          "ஓம் ப்³ரஹ்மவாதி³ந்யை நம: ।\n" +
          "ஓம் நாராயண்யை நம: ।\n" +
          "ஓம் ப⁴த்³ரகால்யை நம: ।\n" +
          "ஓம் ருத்³ராண்யை நம: ।\n" +
          "ஓம் க்ருʼஷ்ணாயை நம: ।\n" +
          "ஓம் பிங்க³லாயை நம: ।\n" +
          "ஓம் அக்³நிஜ்வாலாயை நம: । 20 ।\n" +
          "\n" +
          "ஓம் ரௌத்³ரமுக்²யை நம: ।\n" +
          "ஓம் காலராத்ர்யை நம: ।\n" +
          "ஓம் தபஸ்விந்யை நம: ।\n" +
          "ஓம் மேக⁴ஶ்யாமாயை நம: । மேக⁴ஸ்வநாயை\n" +
          "ஓம் ஸஹஸ்ராக்ஷ்யை நம: ।\n" +
          "ஓம் விஷ்ணுமாயாயை நம: । விகடாங்க்³யை\n" +
          "ஓம் ஜலோத³ர்யை நம: । ஜடோ³த³ர்யை\n" +
          "ஓம் மஹோத³ர்யை நம: ।\n" +
          "ஓம் முக்தகேஶ்யை நம: ।\n" +
          "ஓம் கோ⁴ரரூபாயை நம: । 30 ।\n" +
          "\n" +
          "ஓம் மஹாப³லாயை நம: ।\n" +
          "ஓம் ஆநந்தா³யை நம: ।\n" +
          "ஓம் ப⁴த்³ரஜாநந்தா³யை நம: । ப⁴த்³ரதா³யை அநந்தாயை\n" +
          "ஓம் ரோக³ஹர்த்ர்யை நம: ।\n" +
          "ஓம் ஶிவப்ரியாயை நம: ।\n" +
          "ஓம் ஶிவதூ³த்யை நம: ।\n" +
          "ஓம் கரால்யை நம: ।\n" +
          "ஓம் ப்ரத்யக்ஷபரமேஶ்வர்யை நம: । ஶக்த்யை பரமேஶ்வர்யை\n" +
          "ஆர்யாயை – தா³க்ஷாயண்யை – கி³ரிஜாயை – மேநகாத்மஜாயை\n" +
          "ஸப்தமாத்ருʼகாயை – ஸர்வரோக³ப்ரஶமிந்யை – நாராயண்யை நம: ।\n" +
          "ஓம் இந்த்³ராண்யை நம: ।\n" +
          "ஓம் இந்த்³ரரூபாயை நம: । 40 ।\n" +
          "\n" +
          "ஓம் இந்த்³ரஶக்திபராயணாயை நம: । இந்த்³ரஶக்த்யை பராயணாயை\n" +
          "ஓம் மஹிஷாஸுரஸம்ஹர்த்ர்யை நம: । ஸம்ஹாரிண்யை\n" +
          "ஓம் சாமுண்டா³யை நம: ।\n" +
          "ஓம் க³ர்ப⁴தே³வதாயை நம: । ஸப்தமாத்ருʼகாயை\n" +
          "ஓம் வாராஹ்யை நம: ।\n" +
          "ஓம் நாரஸிம்ஹ்யை நம: ।\n" +
          "ஓம் பீ⁴மாயை நம: ।\n" +
          "ஓம் பை⁴ரவநாதி³ந்யை நம: ।\n" +
          "ஓம் ஶ்ருத்யை: நம: ।\n" +
          "ஓம் ஸ்ம்ருʼத்யை: நம: । 50 ।\n" +
          "\n" +
          "ஓம் த்⁴ருʼத்யை: நம: ।\n" +
          "ஓம் மேதா⁴யை நம: ।\n" +
          "ஓம் வித்³யாயை நம: ।\n" +
          "ஓம் லக்ஷம்யை நம: ।\n" +
          "ஓம் ஸரஸ்வத்யை நம: ।\n" +
          "ஓம் அநந்தாயை நம: ।\n" +
          "ஓம் விஜயாயை நம: ।\n" +
          "ஓம் பூர்ணாயை நம: । அபர்ணாயை\n" +
          "ஓம் மநஸ்தோஷாயை நம: । மாநஸ்தோகாயை\n" +
          "ஓம் அபராஜிதாயை நம: । 60 ।\n" +
          "\n" +
          "ஓம் ப⁴வாந்யை நம: ।\n" +
          "ஓம் பார்வத்யை நம: ।\n" +
          "ஓம் து³ர்கா³யை நம: ।\n" +
          "ஓம் ஹைமவத்யை நம: ।\n" +
          "ஓம் அம்பி³காயை நம: ।\n" +
          "ஓம் ஶிவாயை நம: । ஜயாயை\n" +
          "ஓம் ஶிவாப⁴வாந்யை நம: । ஶிவாயை ப⁴வாந்யை\n" +
          "ஓம் ருத்³ராண்யை நம: ।\n" +
          "ஓம் ஶங்கரார்த⁴ஶரீரிண்யை நம: ।\n" +
          "ஓம் ஸதா³ ஸம்மோஹிந்யை தே³வ்யை நம: । 70 ।\n" +
          "\n" +
          "ஓம் ஸுந்த³ர்யை நம: ।\n" +
          "ஓம் பு⁴வநேஶ்வர்யை நம: ।\n" +
          "ஓம் த்ரிநேத்ராயை நம: ।\n" +
          "ஓம் த்ரிபுராயை நம: ।\n" +
          "ஓம் ஆராத்⁴யாயை நம: ।\n" +
          "ஓம் ஸர்வாத்மநே நம: ।\n" +
          "ஓம் கமலாத்மிகாயை நம: ।\n" +
          "ஓம் சண்ட³யை நம: ।\n" +
          "ஓம் ப⁴க³வத்யை நம: ।\n" +
          "ஓம் ப⁴த்³ராயை நம: । 80 ।\n" +
          "\n" +
          "ஓம் ஸித்³த்⁴யை நம: ।\n" +
          "ஓம் பு³த்³த்⁴யை நம: ।\n" +
          "ஓம் ஸமந்விதாயை நம: ।\n" +
          "ஓம் ஏகாக்ஷர்யை நம: ।\n" +
          "ஓம் பராப்³ரஹ்மாண்யை நம: ।\n" +
          "ஓம் ஸ்தூ²லஸூக்ஷ்மப்ரவர்திந்யை நம: ।\n" +
          "ஓம் நித்யாயை நம: ।\n" +
          "ஓம் ஸகலகல்யாண்யை நம: ।\n" +
          "ஓம் போ⁴க³மோக்ஷப்ரதா³யிந்யை நம: ।\n" +
          "ஓம் ஐராவதக³ஜாரூடா⁴யை நம: । 90 ।\n" +
          "\n" +
          "ஓம் வஜ்ரஹஸ்தாயை நம: ।\n" +
          "ஓம் வரப்ரதா³யை நம: । த⁴நுர்த⁴ராயை\n" +
          "ஓம் ப்⁴ராமர்யை நம: ।\n" +
          "ஓம் காஞ்சிகாமாக்ஷ்யை நம: ।\n" +
          "ஓம் க்வணந்மாணிக்யநூபுராயை நம: ।\n" +
          "ஓம் த்ரிபாத்³ப⁴ஸ்மப்ரஹரணாயை நம: ।\n" +
          "ஓம் த்ரிஶிராரக்தலோசநாயை நம: ।\n" +
          "ஓம் ஶிவாயை நம: ।\n" +
          "ஓம் ஶிவரூபாயை நம: ।\n" +
          "ஓம் ஶிவப⁴க்தபராயணாயை நம: । 100 ।\n" +
          "\n" +
          "ஓம் பராயணாயை நம: ।\n" +
          "ஓம் ம்ருʼத்யுஞ்ஜயாயை நம: ।\n" +
          "ஓம் மஹாமாயாயை நம: ।\n" +
          "ஓம் ஸர்வரோக³நிவாரிண்யை நம: ।\n" +
          "ஓம் ஐந்த்³ர்யை நம: ।\n" +
          "ஓம் தே³வ்யை நம: ।\n" +
          "ஓம் ஸதா³யை நம: ।\n" +
          "ஓம் ஶாந்திமாஶுகர்த்ர்யை நம: । 108"),
  'varahi': Ashtothram(
      'ஸ்ரீ வாராஹி',
      'varahi',
      "ஓம் ஐம் க்லௌம் வாராஹ்யை நம:\n" +
          "ஓம் பஞ்சமி சித்தி தேவ்யை நம:\n" +
          "ஓம் வாசவ்யை நம:\n" +
          "ஓம் வைதேஹ்யை நம:\n" +
          "ஓம் வஸூதாயை நம:\n" +
          "\n" +
          "ஓம் விஷ்ணு வல்லபாயை நம:\n" +
          "ஓம் பலாயை நம:\n" +
          "ஓம் வஸூந்தராயை நம:\n" +
          "ஓம் வாமாயை நம:\n" +
          "ஓம் தர்மிண்யை நம:\n" +
          "\n" +
          "ஓம் அதிசயகார்ய ஸித்திதாயை நம:\n" +
          "ஓம் பகவத்யை நம:\n" +
          "ஓம் ஸ்ரீ புர ரக்ஷிண்யை நம:\n" +
          "ஓம் வனப்ரியாயை நம:\n" +
          "ஓம் காம்யாயை நம:\n" +
          "ஓம் காஞ்சன்யை நம:\n" +
          "ஓம் கபாலின்யை நம:\n" +
          "ஓம் தாராயை நம:\n" +
          "ஓம் லக்ஷ்ம்யை நம:\n" +
          "ஓம் சக்த்யை நம:\n" +
          "\n" +
          "ஓம் சண்ட்யை நம:\n" +
          "ஓம் பீமாயை நம:\n" +
          "ஓம் அபயாயை நம:\n" +
          "ஓம் வார்த்தாள்யை நம:\n" +
          "ஓம் வாக் விலாஸின்யை நம:\n" +
          "ஓம் நித்ய வைபவாயை நம:\n" +
          "ஓம் நித்ய சந்தோஷின்யை நம:\n" +
          "ஓம் மணிமகுட பூஷணாயை நம:\n" +
          "ஓம் மணிமண்டப வாஸின்யை நம:\n" +
          "ஓம் ரக்தமால் யாம் பரதராயை நம:\n" +
          "\n" +
          "ஓம் கபாலி ப்ரிய தண்டின்யை நம:\n" +
          "ஓம் அஸ்வாரூடாயை நம:\n" +
          "ஓம் தண்டநாயக்யை நம:\n" +
          "ஓம் கிரிசக்ர ரதாரூடாயை நம:\n" +
          "ஓம் உத்தராயை நம:\n" +
          "ஓம் வராஹ முகாயை நம:\n" +
          "ஓம் பைரவ்யை நம:\n" +
          "ஓம் குர்குராயை நம:\n" +
          "ஓம் வாருண்யை நம:\n" +
          "ஓம் ப்ரும்மரந்தரகாயை நம:\n" +
          "\n" +
          "ஓம் ஸ்வர்க்காயை நம:\n" +
          "ஓம் பாதாள காயை நம:\n" +
          "ஓம் பூமிகாயை நம:\n" +
          "ஓம் ஸ்ரியை நம:\n" +
          "ஓம் அஸிதாரிண்யை நம:\n" +
          "ஓம் கர்கராயை நம:\n" +
          "ஓம் மனோவாஸாயை நம:\n" +
          "ஓம் அந்தே அந்தின்யை நம:\n" +
          "ஓம் சதுரங்க பலோத்கடாயை நம:\n" +
          "ஓம் ஸத்யாயை நம:\n" +
          "\n" +
          "ஓம் ÷க்ஷத்ரக்ஞாயை நம:\n" +
          "ஓம் மங்களாயை நம:\n" +
          "ஓம் ம்ருத்யை நம:\n" +
          "ஓம் ம்ருத்யுஞ்சயாயை நம:\n" +
          "ஓம் மகிஷக்ன்யை நம:\n" +
          "ஓம் ஸிம்ஹாருடாயை நம:\n" +
          "ஓம் மஹிஷாருடாயை நம:\n" +
          "ஓம் வ்யாக்ராரூடாயை நம:\n" +
          "ஓம் அஸ்வாரூடாயை நம:\n" +
          "ஓம் ருந்தே ருந்தின்யை நம:\n" +
          "\n" +
          "ஓம் தான்யப்ரதாயை நம:\n" +
          "ஓம் தராப்ரதாயை நம:\n" +
          "ஓம் பாபநாசின்யை நம:\n" +
          "ஓம் தோஷநாஸின்யை நம:\n" +
          "ஓம் ரிபு நாஸின்யை நம:\n" +
          "ஓம் க்ஷமாரூபிண்யை நம:\n" +
          "ஓம் ஸித்திதாயின்யை நம:\n" +
          "ஓம் ரௌத்ர்யை நம:\n" +
          "ஓம் சர்வக்ஞாயை நம:\n" +
          "ஓம் வ்யாதிநாஸின்யை நம:\n" +
          "\n" +
          "ஓம் அபயவரதாயை நம:\n" +
          "ஓம் ஜம்பே ஜம்பின்யை நம:\n" +
          "ஓம் உத்தண்டின்யை நம:\n" +
          "ஓம் தண்டநாயிகாயை நம:\n" +
          "ஓம் துக்கநாஸின்யை நம:\n" +
          "ஓம் தாரித்ர்ய நாஸின்யை நம:\n" +
          "ஓம் ஹிரண்ய கவசாயை நம:\n" +
          "ஓம் வ்யசவாயிகாயை நம:\n" +
          "ஓம் அரிஷ்டதமன்யை நம:\n" +
          "ஓம் சாமுண்டாயை நம:\n" +
          "\n" +
          "ஓம் கந்தின்யை நம:\n" +
          "ஓம் கோரக்ஷகாயை நம:\n" +
          "ஓம் பூமிதானேஸ்வர்யை நம:\n" +
          "ஓம் மோஹே மோஹின்யை நம:\n" +
          "ஓம் பஹூரூபாயை நம:\n" +
          "ஓம் ஸ்வப்னவாராஹ்யை நம:\n" +
          "ஓம் மஹா வராஹ்யை நம:\n" +
          "ஓம் ஆஷாட பஞ்சமி பூஜனப்பிரியாயை நம:\n" +
          "ஓம் மதுவாராஹ்யை நம:\n" +
          "ஓம் மந்த்ரிணி வாராஹ்யை நம:\n" +
          "\n" +
          "ஓம் பக்த வாராஹ்யை நம:\n" +
          "ஓம் பஞ்சம்யை நம:\n" +
          "ஓம் பஞ்ச பஞ்சிகாபீடவாஸின்யை நம:\n" +
          "ஓம் ஸமயேஸ்வர்யை நம:\n" +
          "ஓம் ஸங்கேதாயை நம:\n" +
          "ஓம் ஸ்தம்பே ஸ்தம்பின்யை நம:\n" +
          "ஓம் வன வாசின்யை நம:\n" +
          "ஓம் கிருபா ரூபின்யை நம:\n" +
          "ஓம் தயாரூபின்யை நம:\n" +
          "ஓம் ஸகலவிக்ன விநாஸின்யை நம:\n" +
          "\n" +
          "ஓம் போத்ரிண்யை நம:\n" +
          "ஓம் சர்வ துஷ்ட ஜிஹ்வா முகவார்க் ஸ்தம்பின்யை நம:\n" +
          "ஓம் அனுக்ரஹதாயை நம:\n" +
          "ஓம் அணிமாதி சித்திதாயை நம:\n" +
          "ஓம் ஸ்ரீ ப்ருஹத் வாராஹ்யை நம:\n" +
          "ஓம் ஆக்ஞா சக்ரேஸ்வர்யை நம:\n" +
          "ஓம் விஸ்வ விஜயாயை நம:\n" +
          "ஓம் ஸ்ரீ புவனேஸ்வரீ ப்ரிய மஹா வாராஹ்யை நம:\n"),
  'nagarajan': Ashtothram(
      'ஸ்ரீ நாகராஜர்',
      'nagarajan',
      "ஓம் அநந்தாய நம: ।\n" +
          "ஓம் வாஸுதே³வாக்²யாய நம: ।\n" +
          "ஓம் தக்ஷகாய நம: ।\n" +
          "ஓம் விஶ்வதோமுகா²ய நம: ।\n" +
          "ஓம் கார்கோடகாய நம: ।\n" +
          "ஓம் மஹாபத்³மாய நம: ।\n" +
          "ஓம் பத்³மாய நம: ।\n" +
          "ஓம் ஶங்கா²ய நம: ।\n" +
          "ஓம் ஶிவப்ரியாய நம: ।\n" +
          "ஓம் த்⁴ருʼதராஷ்ட்ராய நம: । 10 । \n" +
          "\n" +
          "ஓம் ஶங்க²பாலாய நம: ।\n" +
          "ஓம் கு³லிகாய நம: ।\n" +
          "ஓம் இஷ்டதா³யிநே நம: ।\n" +
          "ஓம் நாக³ராஜாய நம: ।\n" +
          "ஓம் புராணபுரூஷாய நம: ।\n" +
          "ஓம் அநகா⁴ய நம: ।\n" +
          "ஓம் விஶ்வரூபாய நம: ।\n" +
          "ஓம் மஹீதா⁴ரிணே நம: ।\n" +
          "ஓம் காமதா³யிநே நம: ।\n" +
          "ஓம் ஸுரார்சிதாய நம: । 20 । \n" +
          "\n" +
          "ஓம் குந்த³ப்ரபா⁴ய நம: ।\n" +
          "ஓம் ப³ஹுஶிரஸே நம: ।\n" +
          "ஓம் த³க்ஷாய நம: ।\n" +
          "ஓம் தா³மோத³ராய நம: ।\n" +
          "ஓம் அக்ஷராய நம: ।\n" +
          "ஓம் க³ணாதி⁴பாய நம: ।\n" +
          "ஓம் மஹாஸேநாய நம: ।\n" +
          "ஓம் புண்யமூர்தயே நம: ।\n" +
          "ஓம் க³ணப்ரியாய நம: ।\n" +
          "ஓம் வரப்ரதா³ய நம: । 30 । \n" +
          "\n" +
          "ஓம் வாயுப⁴க்ஷாய நம: ।\n" +
          "ஓம் விஶ்வதா⁴ரிணே நம: ।\n" +
          "ஓம் விஹங்க³மாய நம: ।\n" +
          "ஓம் புத்ரப்ரதா³ய நம: ।\n" +
          "ஓம் புண்யரூபாய நம: ।\n" +
          "ஓம் பந்நகே³ஶாய நம: ।\n" +
          "ஓம் பி³லேஶயாய நம: ।\n" +
          "ஓம் பரமேஷ்டி²நே நம: ।\n" +
          "ஓம் பஶுபதயே நம: ।\n" +
          "ஓம் பவநாஶிநே நம: । 40 । \n" +
          "\n" +
          "ஓம் ப³லப்ரதா³ய நம: ।\n" +
          "ஓம் தை³த்யஹந்த்ரே நம: ।\n" +
          "ஓம் த³யாரூபாய நம: ।\n" +
          "ஓம் த⁴நப்ரதா³ய நம: ।\n" +
          "ஓம் மதிதா³யிநே நம: ।\n" +
          "ஓம் மஹாமாயிநே நம: ।\n" +
          "ஓம் மது⁴வைரிணே நம: ।\n" +
          "ஓம் மஹோரகா³ய நம: ।\n" +
          "ஓம் பு⁴ஜகே³ஶாய நம: ।\n" +
          "ஓம் பூ⁴மரூபாய நம: । 50 । \n" +
          "\n" +
          "ஓம் பீ⁴மகாயாய நம: ।\n" +
          "ஓம் ப⁴யாபஹ்ருʼதே நம: ।\n" +
          "ஓம் ஶுக்லரூபாய நம: ।\n" +
          "ஓம் ஶுத்³த⁴தே³ஹாய நம: ।\n" +
          "ஓம் ஶோகஹாரிணே நம: ।\n" +
          "ஓம் ஶுப⁴ப்ரதா³ய நம: ।\n" +
          "ஓம் ஸந்தாநதா³யிநே நம: ।\n" +
          "ஓம் ஸர்பேஶாய நம: ।\n" +
          "ஓம் ஸர்வதா³யிநே நம: ।\n" +
          "ஓம் ஸரீஸ்ருʼபாய நம: । 60 । \n" +
          "\n" +
          "ஓம் லக்ஷ்மீகராய நம: ।\n" +
          "ஓம் லாப⁴தா³யிநே நம: ।\n" +
          "ஓம் லலிதாய நம: ।\n" +
          "ஓம் லக்ஷ்மணாக்ருʼதயே நம: ।\n" +
          "ஓம் த³யாராஶயே நம: ।\n" +
          "ஓம் தா³ஶரத²யே நம: ।\n" +
          "ஓம் த³மாஶ்ரயாய நம: ।\n" +
          "ஓம் ரம்யரூபாய நம: ।\n" +
          "ஓம் ராமப⁴க்தாய நம: ।\n" +
          "ஓம் ரணதீ⁴ராய நம: । 70 । \n" +
          "\n" +
          "ஓம் ரதிப்ரதா³ய நம: ।\n" +
          "ஓம் ஸௌமித்ரயே நம: ।\n" +
          "ஓம் ஸோமஸங்காஶாய நம: ।\n" +
          "ஓம் ஸர்பராஜாய நம: ।\n" +
          "ஓம் ஸதாம்ப்ரியாய நம: ।\n" +
          "ஓம் கர்பு³ராய நம: ।\n" +
          "ஓம் காம்யப²லதா³ய நம: ।\n" +
          "ஓம் கிரீடிநே நம: ।\n" +
          "ஓம் கிந்நரார்சிதாய நம: ।\n" +
          "ஓம் பாதாலவாஸிநே நம: । 80 । \n" +
          "\n" +
          "ஓம் பரமாய நம: ।\n" +
          "ஓம் ப²ணாமண்ட³லமண்டி³தாய நம: ।\n" +
          "ஓம் பா³ஹுலேயாய நம: ।\n" +
          "ஓம் ப⁴க்தநித⁴யே நம: ।\n" +
          "ஓம் பூ⁴மிதா⁴ரிணே நம: ।\n" +
          "ஓம் ப⁴வப்ரியாய நம: ।\n" +
          "ஓம் நாராயணாய நம: ।\n" +
          "ஓம் நாநாரூபாய நம: ।\n" +
          "ஓம் நதப்ரியாய நம: ।\n" +
          "ஓம் காகோத³ராய நம: । 90 । \n" +
          "\n" +
          "ஓம் காம்யரூபாய நம: ।\n" +
          "ஓம் கல்யாணாய நம: ।\n" +
          "ஓம் காமிதார்த²தா³ய நம: ।\n" +
          "ஓம் ஹதாஸுராய நம: ।\n" +
          "ஓம் ஹல்யஹீநாய நம: ।\n" +
          "ஓம் ஹர்ஷதா³ய நம: ।\n" +
          "ஓம் ஹரபூ⁴ஷணாய நம: ।\n" +
          "ஓம் ஜக³தா³த³யே நம: ।\n" +
          "ஓம் ஜராஹீநாய நம: ।\n" +
          "ஓம் ஜாதிஶூந்யாய நம: । 100 । \n" +
          "\n" +
          "ஓம் ஜக³ந்மயாய நம: ।\n" +
          "ஓம் வந்த்⁴யாத்வதோ³ஷஶமநாய நம: ।\n" +
          "ஓம் வரபுத்ரப²லப்ரதா³ய நம: ।\n" +
          "ஓம் ப³லப⁴த்³ரரூபாய நம: ।\n" +
          "ஓம் ஶ்ரீக்ருʼஷ்ணபூர்வஜாய நம: ।\n" +
          "ஓம் விஷ்ணுதல்பாய நம: ।\n" +
          "ஓம் ப³ல்வலத்⁴நாய நம: ।\n" +
          "ஓம் பூ⁴த⁴ராய நம: । 108\n"),
  'prathyangara': Ashtothram(
      'ஸ்ரீ பிரத்யங்கிரா',
      'prathyangara',
      "ஓம் ப்ரத்யங்கி³ராயை நம: ।\n" +
          "ஓம் ௐகாரரூபிண்யை நம: ।\n" +
          "ஓம் விஶ்வரூபாயை நம: ।\n" +
          "ஓம் விரூபாக்ஷப்ரியாயை நம: ।\n" +
          "ஓம் ஜடாஜூடகாரிண்யை நம: ।\n" +
          "ஓம் கபாலமாலாலங்க்ருʼதாயை நம: ।\n" +
          "ஓம் நாகே³ந்த்³ரபூ⁴ஷணாயை நம: ।\n" +
          "ஓம் நாக³யஜ்ஞோபவீததா⁴ரிண்யை நம: ।\n" +
          "ஓம் ஸகலராக்ஷஸநாஶிந்யை நம: ।\n" +
          "ஓம் ஶ்மஶாநவாஸிந்யை நம: । 10 । \n" +
          "\n" +
          "ஓம் குஞ்சிதகேஶிந்யை நம: ।\n" +
          "ஓம் கபாலக²ட்வாங்க³தா⁴ரிண்யை நம: ।\n" +
          "ஓம் ரக்தநேத்ரஜ்வாலிந்யை நம: ।\n" +
          "ஓம் சதுர்பு⁴ஜாயை நம: ।\n" +
          "ஓம் சந்த்³ரஸஹோத³ர்யை நம: ।\n" +
          "ஓம் ஜ்வாலாகராலவத³நாயை நம: ।\n" +
          "ஓம் ப⁴த்³ரகால்யை நம: ।\n" +
          "ஓம் ஹேமவத்யை நம: ।\n" +
          "ஓம் நாராயணஸமாஶ்ரிதாயை நம: ।\n" +
          "ஓம் ஸிம்ஹமுக்²யை நம: । 20 । \n" +
          "\n" +
          "ஓம் மஹிஷாஸுரமர்தி³ந்யை நம: ।\n" +
          "ஓம் தூ⁴ம்ரலோசநாயை நம: ।\n" +
          "ஓம் ஶங்கரப்ராணவல்லபா⁴யை நம: ।\n" +
          "ஓம் லக்ஷ்மீவாணீஸேவிதாயை நம: ।\n" +
          "ஓம் க்ருʼபாரூபிண்யை நம: ।\n" +
          "ஓம் க்ருʼஷ்ணாங்க்³யை நம: ।\n" +
          "ஓம் ப்ரேதவாஹநாயை நம: ।\n" +
          "ஓம் ப்ரேதபோ⁴கி³ந்யை நம: ।\n" +
          "ஓம் ப்ரேதபோ⁴ஜிந்யை நம: ।\n" +
          "ஓம் ஶிவாநுக்³ரஹவல்லபா⁴யை நம: । 30 । \n" +
          "\n" +
          "ஓம் பஞ்சப்ரேதாஸநாயை நம: ।\n" +
          "ஓம் மஹாகால்யை நம: ।\n" +
          "ஓம் வநவாஸிந்யை நம: ।\n" +
          "ஓம் அணிமாதி³கு³ணாஶ்ரயாயை நம: ।\n" +
          "ஓம் ரக்தப்ரியாயை நம: ।\n" +
          "ஓம் ஶாகமாம்ஸப்ரியாயை நம: ।\n" +
          "ஓம் நரஶிரோமாலாலங்க்ருʼதாயை நம: ।\n" +
          "ஓம் அட்டஹாஸிந்யை நம: ।\n" +
          "ஓம் கராலவத³நாயை நம: ।\n" +
          "ஓம் லலஜ்ஜிஹ்வாயை நம: । 40 । \n" +
          "\n" +
          "ஓம் ஹ்ரீங்காராயை நம: ।\n" +
          "ஓம் ஹ்ரீம்விபூ⁴த்யை நம: ।\n" +
          "ஓம் ஶத்ருநாஶிந்யை நம: ।\n" +
          "ஓம் பூ⁴தநாஶிந்யை நம: ।\n" +
          "ஓம் ஸர்வது³ரிதவிநாஶிந்யை நம: ।\n" +
          "ஓம் ஸகலாபந்நாஶிந்யை நம: ।\n" +
          "ஓம் அஷ்டபை⁴ரவஸேவிதாயை நம: ।\n" +
          "ஓம் ப்³ரஹ்மவிஷ்ணுஶிவாத்மிகாயை நம: ।\n" +
          "ஓம் பு⁴வநேஶ்வர்யை நம: ।\n" +
          "ஓம் டா³கிநீபரிஸேவிதாயை நம: । 50 । \n" +
          "\n" +
          "ஓம் ரக்தாந்நப்ரியாயை நம: ।\n" +
          "ஓம் மாம்ஸநிஷ்டா²யை நம: ।\n" +
          "ஓம் மது⁴பாநப்ரியோல்லாஸிந்யை நம: ।\n" +
          "ஓம் ட³மருகதா⁴ரிண்யை நம: ।\n" +
          "ஓம் ப⁴க்தப்ரியாயை நம: ।\n" +
          "ஓம் பரமந்த்ரவிதா³ரிண்யை நம: ।\n" +
          "ஓம் பரயந்த்ரநாஶிந்யை நம: ।\n" +
          "ஓம் பரக்ருʼத்யவித்⁴வம்ஸிந்யை நம: ।\n" +
          "ஓம் மஹாப்ரஜ்ஞாயை நம: ।\n" +
          "ஓம் மஹாப³லாயை நம: । 60 । \n" +
          "\n" +
          "ஓம் குமாரகல்பஸேவிதாயை நம: ।\n" +
          "ஓம் ஸிம்ஹவாஹநாயை நம: ।\n" +
          "ஓம் ஸிம்ஹக³ர்ஜிந்யை நம: ।\n" +
          "ஓம் பூர்ணசந்த்³ரநிபா⁴யை நம: ।\n" +
          "ஓம் த்ரிநேத்ராயை நம: ।\n" +
          "ஓம் ப⁴ண்டா³ஸுநிஷேவிதாயை நம: ।\n" +
          "ஓம் ப்ரஸந்நரூபதா⁴ரிண்யை நம: ।\n" +
          "ஓம் பு⁴க்திமுக்திப்ரதா³யிந்யை நம: ।\n" +
          "ஓம் ஸகலைஶ்வர்யதா⁴ரிண்யை நம: ।\n" +
          "ஓம் நவக்³ரஹரூபிண்யை நம: । 70 । \n" +
          "\n" +
          "ஓம் காமதே⁴நுப்ரக³ல்பா⁴யை நம: ।\n" +
          "ஓம் யோக³மாயாயுக³ந்த⁴ராயை நம: ।\n" +
          "ஓம் கு³ஹ்யவித்³யாயை நம: ।\n" +
          "ஓம் மஹாவித்³யாயை நம: ।\n" +
          "ஓம் ஸித்³தி⁴வித்³யாயை நம: ।\n" +
          "ஓம் க²ட்³க³மண்ட³லஸுபூஜிதாயை நம: ।\n" +
          "ஓம் ஸாலக்³ராமநிவாஸிந்யை நம: ।\n" +
          "ஓம் யோநிரூபிண்யை நம: ।\n" +
          "ஓம் நவயோநிசக்ராத்மிகாயை நம: ।\n" +
          "ஓம் ஶ்ரீசக்ரஸுசாரிண்யை நம: । 80 । \n" +
          "\n" +
          "ஓம் ராஜராஜஸுபூஜிதாயை நம: ।\n" +
          "ஓம் நிக்³ரஹாநுக்³ரஹாயை நம: ।\n" +
          "ஓம் ஸபா⁴நுக்³ரஹகாரிண்யை நம: ।\n" +
          "ஓம் பா³லேந்து³மௌலிஸேவிதாயை நம: ।\n" +
          "ஓம் க³ங்கா³த⁴ராலிங்கி³தாயை நம: ।\n" +
          "ஓம் வீரரூபாயை நம: ।\n" +
          "ஓம் வராப⁴யப்ரதா³யை நம: ।\n" +
          "ஓம் வாஸுதே³வவிஶாலாக்ஷ்யை நம: ।\n" +
          "ஓம் பர்வதஸ்தநமண்ட³லாயை நம: ।\n" +
          "ஓம் ஹிமாத்³ரிநிவாஸிந்யை நம: । 90 । \n" +
          "\n" +
          "ஓம் து³ர்கா³ரூபாயை நம: ।\n" +
          "ஓம் து³ர்க³திஹாரிண்யை நம: ।\n" +
          "ஓம் ஈஷணாத்ரயநாஶிந்யை நம: ।\n" +
          "ஓம் மஹாபீ⁴ஷணாயை நம: ।\n" +
          "ஓம் கைவல்யப²லப்ரதா³யை நம: ।\n" +
          "ஓம் ஆத்மஸம்ரக்ஷிண்யை நம: ।\n" +
          "ஓம் ஸகலஶத்ருவிநாஶிந்யை நம: ।\n" +
          "ஓம் நாக³பாஶதா⁴ரிண்யை நம: ।\n" +
          "ஓம் ஸகலவிக்⁴நநாஶிந்யை நம: ।\n" +
          "ஓம் பரமந்த்ரதந்த்ராகர்ஷிண்யை நம: । 100 । \n" +
          "\n" +
          "ஓம் ஸர்வது³ஷ்டப்ரது³ஷ்டஶிரச்சே²தி³ந்யை நம: ।\n" +
          "ஓம் மஹாமந்த்ரயந்த்ரதந்த்ரரக்ஷிண்யை நம: ।\n" +
          "ஓம் நீலகண்டி²ந்யை நம: ।\n" +
          "ஓம் கோ⁴ரரூபிண்யை நம: ।\n" +
          "ஓம் விஜயாம்பா³யை நம: ।\n" +
          "ஓம் தூ⁴ர்ஜடிந்யை நம: ।\n" +
          "ஓம் மஹாபை⁴ரவப்ரியாயை நம: ।\n" +
          "ஓம் மஹாப⁴த்³ரகாலிப்ரத்யங்கி³ராயை நம: । 108 । \n"),
  'yamadharmarajan': Ashtothram(
      'ஸ்ரீ எமதர்மராஜன்',
      'yamadharmarajan',
      "ஓம் தர்மராஜாய நம:\n" +
          "ஓம் ஸூர்யபுத்ராய நம:\n" +
          "ஓம் ஸம்ஞாகர்பஸமுத்பவாய நம:\n" +
          "ஓம் த்ர்மிஷ்டாய நம:\n" +
          "ஓம் ஸாந்தரூபாய நம:\n" +
          "ஓம் துர்ஜநாவபிஸிக்ஷகாய நம:\n" +
          "ஓம் புண்யயுக்தாய  நம:\n" +
          "ஓம் அபிகந்ரே நம:\n" +
          "ஓம் தத்வத்ருஷ்டயே நம:\n" +
          "ஓம் க்ருஸோத்ராய நம:\n" +
          "\n" +
          "ஓம் த்ர்மஸ்வரூபிணே நம:\n" +
          "ஓம் யமராஜனே நம:\n" +
          "ஓம் ஸர்வபூதபயங்கராய நம:\n" +
          "ஓம் தீர்க்கரூபாய நம:\n" +
          "ஓம் மஹாகாயாய நம:\n" +
          "ஓம் ஸாது ஸந்தோஷதாயகாய நம:\n" +
          "ஓம் விஷ்ணுபக்தாய நம:\n" +
          "ஓம் சின்னராய நம:\n" +
          "ஓம் ஸமாய நம:\n" +
          "ஓம் ஸம்யநீஸ்வராய நம:\n" +
          "\n" +
          "ஓம் விஸாலநயநாய நம:\n" +
          "ஓம் பாதிகோதண்டிநே நம:\n" +
          "ஓம் தண்டியதண்டகாய நம:\n" +
          "ஓம் வசனாம்ருததாயிநே நம:\n" +
          "ஓம் ப்ருகுடீபூஷணாக்ருதயே நம:\n" +
          "ஓம் ப்ராணி ஸம்ஹாரக்ருதே நம:\n" +
          "ஓம் சண்ட்யாய நம:\n" +
          "ஓம் திவ்யக்ஞானப்ரகாஸகாய நம:\n" +
          "ஓம் க்ருபாநித யெ நம:\n" +
          "ஓம் ஸாதுரக்ஷகாய நம:\n" +
          "\n" +
          "ஓம் காலதண்டவராயுதாய நம:\n" +
          "ஓம் ஸர்வவேதாந்தவேதினே நம:\n" +
          "ஓம் ஸத்ய ரூபாய  நம:\n" +
          "ஓம் மஹாரௌரவநாயகாய நம:\n" +
          "ஓம் ஸமஸ்தாபரணோபேதாய நம:\n" +
          "ஓம் நீலாய நம:\n" +
          "ஓம் பக்தாபயங்கராய நம:\n" +
          "ஓம் வீரவர்மஸுதாநாதாய நம:\n" +
          "ஓம் ப்ரம்மஸர்மவரப்ரதாய நம:\n" +
          "ஓம் ஸூலாரோபிமாண்டவ்யாய நம:\n" +
          "\n" +
          "ஓம் மஹாமஹிஷவாஹநாய நம:\n" +
          "ஓம் மாண்டவ்ய ஸாப தாரிணே நம:\n" +
          "ஓம் தர்ம ஸாஸ்த்ரவிஸாரதாய நம:\n" +
          "ஓம் பலினே நம:\n" +
          "ஓம் சக்ரிணே நம:\n" +
          "ஓம் சித்ரகுப்தாய நம:\n" +
          "ஓம் மார்க்கண்டேயபலப்ரதாய நம:\n" +
          "ஓம் துந்துபிஸ்வநநிர்கோஷாய நம:\n" +
          "ஓம் ஸ்ராத்ததே வாய நம:\n" +
          "ஓம் பரதராஜே நம:\n" +
          "\n" +
          "ஓம் ஒளதும்பராய நம: \n" +
          "ஓம் அந்தகாய நம:\n" +
          "ஓம் ஸாஸ்த்ரே நம:\n" +
          "ஓம் பரமேஷ்டிநே நம:\n" +
          "ஓம் வ்ருகோதராய நம:\n" +
          "ஓம் கராளகாய நம:\n" +
          "ஓம் ஸமநாய நம:\n" +
          "ஓம் ஸர்வலோக நம ஸ்க்ருதாய நம:\n" +
          "ஓம் ஸர்வக்ஞாய நம:\n" +
          "ஓம் தக்ஷிணாதீஸாய நம:\n" +
          "\n" +
          "ஓம் ஸ்ரீர்ணாங்க்ராய நம:\n" +
          "ஓம் வைத்யுத ப்ரியாய நம:\n" +
          "ஓம் காலாளகாய நம:\n" +
          "ஓம் மநுப்ராந்த்ரே நம:\n" +
          "ஓம் ஸாவித்ரீவரப்ரதாய நம:\n" +
          "ஓம் ப்ரபவே நம:\n" +
          "ஓம் பரணீதாரகாதீஸாய நம:\n" +
          "ஓம் தத்நாய நம:\n" +
          "ஓம் தத்வோபதே ஸக்ருதே நம:\n" +
          "ஓம் உக்ரதண்டப்ரதாய நம:\n" +
          "\n" +
          "ஓம் அவ்யக்தாய நம:\n" +
          "ஓம் நாசிகேதவரப்பிரதாய நம:\n" +
          "ஓம் பக்தரக்ஷõகராய நம:\n" +
          "ஓம் காலாய நம:\n" +
          "ஓம் காகரூபதராய நம:\n" +
          "ஓம் அவ்யயாய நம:\n" +
          "ஓம் ஏகாத் ஸ்ரீதித்யாதீ ஸாய நம:\n" +
          "ஓம் மஹா நரக நாலகாய நம:\n" +
          "ஓம் ஸமவர்த்திநே நம:\n" +
          "ஓம் தேவதே ட்யாய நம:\n" +
          "\n" +
          "ஓம் ம்ருத்யவெ நம:\n" +
          "ஓம் நீல மனோஹராய நம:\n" +
          "ஓம் வைவ ஸ்வதாய நம:\n" +
          "ஓம் பித்ரு பதயை நம:\n" +
          "ஓம் புண்ய பாப விசாரகாய நம:\n" +
          "ஓம் சண்ட ப்ரசண்ட ஸேநாபதயே நம:\n" +
          "ஓம் கர்கஸாய நம:\n" +
          "ஓம் மஹிஷ த்வஜாய நம:\n" +
          "ஓம் மேரு ஸைல ஸமா நௌஜஸே நம:\n" +
          "ஓம் ஹரயே நம:\n" +
          "\n" +
          "ஓம் ஸர்வ குஹாஸயாய நம:\n" +
          "ஓம் சதுராஸா த்ருக் ப்ரசார காய நம:\n" +
          "ஓம் கூடி பாபாத்ம மர்தனாய நம:\n" +
          "ஓம் நடஸ்தாய நம:\n" +
          "ஓம் ஸ்த்ரு ஸம்ஹர்த்ரே நம:\n" +
          "ஓம் புண்யாத்மனே நம:\n" +
          "ஓம் ப்தமஜ ப்ரியாயய நம:\n" +
          "ஓம் ம்ருத்யு நாதாய நம:\n" +
          "ஓம் ஸநி ப்ராத்ரே நம:\n" +
          "ஓம் இந்த்ரோஷ்டாய நம:\n" +
          "\n" +
          "ஓம் சண்ட ஸாஸனாய நம:\n" +
          "ஓம் கராளாய நம:\n" +
          "ஓம் கிம் கராட்யாய நம:\n" +
          "ஓம் காக ஜாதி வரப்ரதாய நம:\n" +
          "ஓம் யமுனா ஸோதராய நம:\n" +
          "ஓம் மந்தாய நம:\n" +
          "ஓம் ஸ்வான த்வய ஸுஸம்யுதாய நம:\n" +
          "ஓம் ஸ்வ ஸம்யுதாய நம:\n" +
          "ஓம் யுதிஷ்டிர பித்ரே நம:\n" +
          "ஓம் தீராய நம:\n" +
          "ஓம் ஸர்வேஷ்டார்த பல ப்ரதாய நம:\n"),
  'chithragupthan':
      Ashtothram('ஸ்ரீ சித்ரகுப்தன்', 'chithragupthan', 'ashtothram'),
  'aiyappan': Ashtothram(
      'ஸ்ரீ ஐயப்பன்',
      'aiyappan',
      "ஓம் மஹாஶாஸ்த்ரே நம꞉ |\n" +
          "ஓம் மஹாதே³வாய நம꞉ |\n" +
          "ஓம் மஹாதே³வஸுதாய நம꞉ |\n" +
          "ஓம் அவ்யயாய நம꞉ |\n" +
          "ஓம் லோககர்த்ரே நம꞉ |\n" +
          "ஓம் லோகப⁴ர்த்ரே நம꞉ |\n" +
          "ஓம் லோகஹர்த்ரே நம꞉ |\n" +
          "ஓம் பராத்பராய நம꞉ |\n" +
          "ஓம் த்ரிலோகரக்ஷகாய நம꞉ | 9\n" +
          "\n" +
          "ஓம் த⁴ன்வினே நம꞉ |\n" +
          "ஓம் தபஸ்வினே நம꞉ |\n" +
          "ஓம் பூ⁴தஸைனிகாய நம꞉ |\n" +
          "ஓம் மந்த்ரவேதி³னே நம꞉ |\n" +
          "ஓம் மஹாவேதி³னே நம꞉ |\n" +
          "ஓம் மாருதாய நம꞉ |\n" +
          "ஓம் ஜக³தீ³ஶ்வராய நம꞉ |\n" +
          "ஓம் லோகாத்⁴யக்ஷாய நம꞉ |\n" +
          "ஓம் அக்³ரக³ண்யாய நம꞉ | 18\n" +
          "\n" +
          "ஓம் ஶ்ரீமதே நம꞉ |\n" +
          "ஓம் அப்ரமேயபராக்ரமாய நம꞉ |\n" +
          "ஓம் ஸிம்ஹாரூடா⁴ய நம꞉ |\n" +
          "ஓம் க³ஜாரூடா⁴ய நம꞉ |\n" +
          "ஓம் ஹயாரூடா⁴ய நம꞉ |\n" +
          "ஓம் மஹேஶ்வராய நம꞉ |\n" +
          "ஓம் நானாஶாஸ்த்ரத⁴ராய நம꞉ |\n" +
          "ஓம் அனகா⁴ய நம꞉ |\n" +
          "ஓம் நானாவித்³யா விஶாரதா³ய நம꞉ | 27\n" +
          "\n" +
          "ஓம் நானாரூபத⁴ராய நம꞉ |\n" +
          "ஓம் வீராய நம꞉ |\n" +
          "ஓம் நானாப்ராணினிஷேவிதாய நம꞉ |\n" +
          "ஓம் பூ⁴தேஶாய நம꞉ |\n" +
          "ஓம் பூ⁴திதா³ய நம꞉ |\n" +
          "ஓம் ப்⁴ருத்யாய நம꞉ |\n" +
          "ஓம் பு⁴ஜங்கா³ப⁴ரணோஜ்வலாய நம꞉ |\n" +
          "ஓம் இக்ஷுத⁴ன்வினே நம꞉ |\n" +
          "ஓம் புஷ்பபா³ணாய நம꞉ | 36\n" +
          "\n" +
          "ஓம் மஹாரூபாய நம꞉ |\n" +
          "ஓம் மஹாப்ரப⁴வே நம꞉ |\n" +
          "ஓம் மாயாதே³வீஸுதாய நம꞉ |\n" +
          "ஓம் மான்யாய நம꞉ |\n" +
          "ஓம் மஹனீயாய நம꞉ |\n" +
          "ஓம் மஹாகு³ணாய நம꞉ |\n" +
          "ஓம் மஹாஶைவாய நம꞉ |\n" +
          "ஓம் மஹாருத்³ராய நம꞉ |\n" +
          "ஓம் வைஷ்ணவாய நம꞉ | 45\n" +
          "\n" +
          "ஓம் விஷ்ணுபூஜகாய நம꞉ |\n" +
          "ஓம் விக்⁴னேஶாய நம꞉ |\n" +
          "ஓம் வீரப⁴த்³ரேஶாய நம꞉ |\n" +
          "ஓம் பை⁴ரவாய நம꞉ |\n" +
          "ஓம் ஷண்முக²ப்ரியாய நம꞉ |\n" +
          "ஓம் மேருஶ்ருங்க³ஸமாஸீனாய நம꞉ |\n" +
          "ஓம் முனிஸங்க⁴னிஷேவிதாய நம꞉ |\n" +
          "ஓம் தே³வாய நம꞉ |\n" +
          "ஓம் ப⁴த்³ராய நம꞉ | 54\n" +
          "\n" +
          "ஓம் ஜக³ன்னாதா²ய நம꞉ |\n" +
          "ஓம் க³ணனாதா²ய நாம꞉ |\n" +
          "ஓம் க³ணேஶ்வராய நம꞉ |\n" +
          "ஓம் மஹாயோகி³னே நம꞉ |\n" +
          "ஓம் மஹாமாயினே நம꞉ |\n" +
          "ஓம் மஹாஜ்ஞானினே நம꞉ |\n" +
          "ஓம் மஹாஸ்தி²ராய நம꞉ |\n" +
          "ஓம் தே³வஶாஸ்த்ரே நம꞉ |\n" +
          "ஓம் பூ⁴தஶாஸ்த்ரே நம꞉ | 63\n" +
          "\n" +
          "ஓம் பீ⁴மஹாஸபராக்ரமாய நம꞉ |\n" +
          "ஓம் நாக³ஹாராய நம꞉ |\n" +
          "ஓம் நாக³கேஶாய நம꞉ |\n" +
          "ஓம் வ்யோமகேஶாய நம꞉ |\n" +
          "ஓம் ஸனாதனாய நம꞉ |\n" +
          "ஓம் ஸகு³ணாய நம꞉ |\n" +
          "ஓம் நிர்கு³ணாய நம꞉ |\n" +
          "ஓம் நித்யாய நம꞉ |\n" +
          "ஓம் நித்யத்ருப்தாய நம꞉ | 72\n" +
          "\n" +
          "ஓம் நிராஶ்ரயாய நம꞉ |\n" +
          "ஓம் லோகாஶ்ரயாய நம꞉ |\n" +
          "ஓம் க³ணாதீ⁴ஶாய நம꞉ |\n" +
          "ஓம் சது꞉ஷஷ்டிகலாமயாய நம꞉ |\n" +
          "ஓம் ருக்³யஜு꞉ஸாமாத²ர்வாத்மனே நம꞉ |\n" +
          "ஓம் மல்லகாஸுரப⁴ஞ்ஜனாய நம꞉ |\n" +
          "ஓம் த்ரிமூர்தயே நம꞉ |\n" +
          "ஓம் தை³த்யமத²னாய நம꞉ |\n" +
          "ஓம் ப்ரக்ருதயே நம꞉ | 81\n" +
          "\n" +
          "ஓம் புருஷோத்தமாய நம꞉ |\n" +
          "ஓம் காலஜ்ஞானினே நம꞉ |\n" +
          "ஓம் மஹாஜ்ஞானினே நம꞉ |\n" +
          "ஓம் காமதா³ய நம꞉ |\n" +
          "ஓம் கமலேக்ஷணாய நம꞉ |\n" +
          "ஓம் கல்பவ்ருக்ஷாய நம꞉ |\n" +
          "ஓம் மஹாவ்ருக்ஷாய நம꞉ |\n" +
          "ஓம் வித்³யாவ்ருக்ஷாய நம꞉ |\n" +
          "ஓம் விபூ⁴திதா³ய நம꞉ | 90\n" +
          "\n" +
          "ஓம் ஸம்ஸாரதாபவிச்சே²த்ரே நம꞉ |\n" +
          "ஓம் பஶுலோகப⁴யங்கராய நம꞉ |\n" +
          "ஓம் ரோக³ஹந்த்ரே நம꞉ |\n" +
          "ஓம் ப்ராணதா³த்ரே நம꞉ |\n" +
          "ஓம் பரக³ர்வவிப⁴ஞ்ஜனாய நம꞉ |\n" +
          "ஓம் ஸர்வஶாஸ்த்ரார்த² தத்வஜ்ஞாய நம꞉ |\n" +
          "ஓம் நீதிமதே நம꞉ |\n" +
          "ஓம் பாபப⁴ஞ்ஜனாய நம꞉ |\n" +
          "ஓம் புஷ்கலாபூர்ணாஸம்யுக்தாய நம꞉ | 99\n" +
          "\n" +
          "ஓம் பரமாத்மனே நம꞉ |\n" +
          "ஓம் ஸதாங்க³தயே நம꞉ |\n" +
          "ஓம் அனந்தாதி³த்யஸங்காஶாய நம꞉ |\n" +
          "ஓம் ஸுப்³ரஹ்மண்யானுஜாய நம꞉ |\n" +
          "ஓம் ப³லினே நம꞉ |\n" +
          "ஓம் ப⁴க்தானுகம்பினே நம꞉ |\n" +
          "ஓம் தே³வேஶாய நம꞉ |\n" +
          "ஓம் ப⁴க³வதே நம꞉ |\n" +
          "ஓம் ப⁴க்தவத்ஸலாய நம꞉ | | 108\n"),
  'bhairavar': Ashtothram(
      'ஸ்ரீ பைரவர்',
      'bhairavar',
      "ஓம் பைரவாய நம\n" +
          "ஓம் பூத நாதாய நம\n" +
          "ஓம் பூதாத்மனே நம\n" +
          "ஓம் பூதபாவநாய நம\n" +
          "ஓம் க்ஷேத்ரதாய நம\n" +
          "ஓம் க்ஷேத்ரபாலாய நம\n" +
          "ஓம் க்ஷேத்ரக்ஞாய நம\n" +
          "ஓம் க்ஷத்ரியாய நம\n" +
          "ஓம் விராஜே நம\n" +
          "ஓம் ஸ்மசானவாசினே நம\n" +
          "ஓம் மாம்ஸாசிநே நம\n" +
          "ஓம் ஸர்ப்பராசயே நம\n" +
          "ஓம் ஸ்மராந்தக்ருதே நம\n" +
          "ஓம் ரக்தபாய நம\n" +
          "ஓம் பானபாய நம\n" +
          "ஓம் ஸித்தாய நம\n" +
          "ஓம் ஸித்திதாய நம\n" +
          "ஓம் ஸித்திஸேவிதாய நம\n" +
          "ஓம் கங்காளாய நம\n" +
          "ஓம் காலசமனாய நம\n" +
          "ஓம் கலாய நம\n" +
          "ஓம் காஷ்டாய நம\n" +
          "ஓம் தநவே நம\n" +
          "ஓம் கவயே நம\n" +
          "ஓம் த்ரிநேத்ரே நம\n" +
          "ஓம் பஹுநேத்ரே நம\n" +
          "ஓம் பிங்களலோசனாய நம\n" +
          "ஓம் சூலபாணயே நம\n" +
          "ஓம் கட்கபாணயே நம\n" +
          "ஓம் கங்காளிநே நம\n" +
          "ஓம் தூம்ரலோசனாய நம\n" +
          "ஓம் அபீரவே நம\n" +
          "ஓம் பைரவாய நம\n" +
          "ஓம் நாதாய நம\n" +
          "ஓம் பூதபாய நம\n" +
          "ஓம் யோகிநீபதயே நம\n" +
          "ஓம் தநதாய நம\n" +
          "ஓம் தநஹாரிணே நம\n" +
          "ஓம் தநவதே நம\n" +
          "ஓம் ப்ரீதிபாவனாய நம\n" +
          "ஓம் நாகஹாராய நம\n" +
          "ஓம் நாகபாசாய நம\n" +
          "ஓம் வ்யோம கேசாய நம\n" +
          "ஓம் கபாலப்ருதே நம\n" +
          "ஓம் காலாய நம\n" +
          "ஓம் கபால மாலிநே நம\n" +
          "ஓம் கமநீயாய நம\n" +
          "ஓம் கலாநிதயே நம\n" +
          "ஓம் த்ரிலோசனாய நம\n" +
          "ஓம் ஜ்வலந்நேத்ராய நம\n" +
          "ஓம் த்ரிசிகிநே நம\n" +
          "ஓம் த்ரிலோகபாய நம\n" +
          "ஓம் த்ரிநேத்ர தநயாய நம\n" +
          "ஓம் டிம்பாய நம\n" +
          "ஓம் சாந்தாய நம\n" +
          "ஓம் சாந்தஜனப்ரியாய நம\n" +
          "ஓம் வடுகாய நம\n" +
          "ஓம் வடுவேஷாய நம\n" +
          "ஓம் கட்வாங்கவரதாரகாய நம\n" +
          "ஓம் பூதாத்யக்ஷாய நம\n" +
          "ஓம் பசுபதேய நம\n" +
          "ஓம் பிக்ஷுதாய நம\n" +
          "ஓம் பரிசாரகாய நம\n" +
          "ஓம் தூர்தாய நம\n" +
          "ஓம் திகம்பராய நம\n" +
          "ஓம் சூராய நம\n" +
          "ஓம் ஹரிணாய நம\n" +
          "ஓம் பாண்டுலோசனாய நம\n" +
          "ஓம் ப்ரசாந்தாய நம\n" +
          "ஓம் சாந்திதாய நம\n" +
          "ஓம் ஸித்தாய நம\n" +
          "ஓம் சங்கராய நம\n" +
          "ஓம் ப்ரியாபாந்தவாய நம\n" +
          "ஓம் அஷ்டமூர்த்தயே நம\n" +
          "ஓம் நிதீசாய நம\n" +
          "ஓம் க்ஞானசக்ஷுஷே நம\n" +
          "ஓம் தபோமயாய நம\n" +
          "ஓம் அஷ்டாதாராய நம\n" +
          "ஓம் ஷடாதாராய நம\n" +
          "ஓம் ஸர்பபயுக்தாய நம\n" +
          "ஓம் சிகீஸகாய நம\n" +
          "ஓம் பூதராய நம\n" +
          "ஓம் பூதாரதீசாய நம\n" +
          "ஓம் பூபதயே நம\n" +
          "ஓம் பூதராத்மஜாய நம\n" +
          "ஓம் கங்காலதாரிணே நம\n" +
          "ஓம் முண்டிநே நம\n" +
          "ஓம் நாகயக்ஞோ வீதவதே நம\n" +
          "ஓம் ஜ்ரும்பணோ மோஹந ஸ்தம்பீமாரண க்ஷோபணாயந நம\n" +
          "ஓம் ஸுத்த நீலாஞ்சன ப்ரக்யாய நம\n" +
          "ஓம் தைத்யக்நே நம\n" +
          "ஓம் முண்ட பூஜிதாய நம\n" +
          "ஓம் பலிபுஜே நம\n" +
          "ஓம் பலிபுங் நாதாய நம\n" +
          "ஓம் பாலாய நம\n" +
          "ஓம் அபால விக்ரமாய நம\n" +
          "ஓம் ஸர்வபத்தாரணாய நம\n" +
          "ஓம் துர்க்காய நம\n" +
          "ஓம் துஷ்டபூத நிஷேவிதாய நம\n" +
          "ஓம் காமிநே நம\n" +
          "ஓம் கலாநிதயே நம\n" +
          "ஓம் காந்தாய நம\n" +
          "ஓம் காமிநீ வசக்ருதே நம\n" +
          "ஓம் வசினே நம\n" +
          "ஓம் ஸர்வ சித்திப்ரதாய நம\n" +
          "ஓம் வைத்யாய நம\n" +
          "ஓம் ப்ரபவே நம\n" +
          "ஓம் விஷ்ணவே நம\n"),
  'karuppar': Ashtothram(
      'ஸ்ரீ கருப்பர்',
      'karuppar',
      "ஓம் மகாகாளாய நம:\n" +
          "ஓம் ஸ்ரீம்காளாய நம:\n" +
          "ஓம் ஸ்ரீம்ஸஸிலெக்ஷணாய நம:\n" +
          "ஓம் ஸ்ரீம்காரப்பிரியாய நம:\n" +
          "ஓம் ஸ்ரீம்காராய நம:\n" +
          "ஓம் க்ஷீம்காராய நம:\n" +
          "ஓம் துவிம்காராய நம:\n" +
          "ஓம் ஏககாராய நம:\n" +
          "ஓம் ஏமகோராய நம:\n" +
          "ஓம் ஸெரைபூஜிதாய நம:\n" +
          "\n" +
          "ஓம் அம்ஸாய நம:\n" +
          "ஓம் அம்ஸபநயே நம:\n" +
          "ஓம் அம்ஸத்வஜாய நம:\n" +
          "ஓம் அம்ஸ அஸ்திராய நம:\n" +
          "ஓம் அம்ஸருபகாய நம:\n" +
          "ஓம் ஸர்வபீஜாய நம:\n" +
          "ஓம் ஸர்வதத்ரவிநாஸ்நாய நம:\n" +
          "ஓம் ஹராய நம:\n" +
          "ஓம் அரியே நம:\n" +
          "ஓம் அரசாய நம:\n" +
          "\n" +
          "ஓம் ரத்யாய நம:\n" +
          "ஓம் ரமணாய நம:\n" +
          "ஓம் அரிஸோபிதாய நம:\n" +
          "ஓம் ரதாரூபாய நம:\n" +
          "ஓம் ரம்யாய நம:\n" +
          "ஓம் நவபூஷணாய நம:\n" +
          "ஓம் நவ்கோஷப்பிரியாய நம:\n" +
          "ஓம் மந்திறாய நம:\n" +
          "ஓம் சிவகாளாயா நம:\n" +
          "ஓம் சிவசக்தியே நம:\n" +
          "\n" +
          "ஓம் சிவகெணாய நம:\n" +
          "ஓம் வம்சகாளாய நம:\n" +
          "ஓம் யமாக்யாதாய நம:\n" +
          "ஓம் யவடாய நம:\n" +
          "ஓம் யமதரூபாய நம:\n" +
          "ஓம் யம்கக்காய நம:\n" +
          "ஓம் யஜமாநாய நம:\n" +
          "ஓம் யூகரோதயே நம:\n" +
          "ஓம் எஸ்எஸ்விநே நம:\n" +
          "ஓம் எமாய நம:\n" +
          "\n" +
          "ஓம் நமசிகதாய நம:\n" +
          "ஓம் மந்த்ரஷ்வரூபாய நம:\n" +
          "ஓம் ஸ்வசூத்ராய நம:\n" +
          "ஓம் சர்வதூதாய நம:\n" +
          "ஓம் மநோன்மநாய நம:\n" +
          "ஓம் மங்கஆஸயா நம:\n" +
          "ஓம் ரூபாய நம:\n" +
          "ஓம் ரூடாய நம:\n" +
          "ஓம் பார்வதியாய நம:\n" +
          "ஓம் வாஸபதிம்பிரபவே நம:\n" +
          "\n" +
          "ஓம் வச்ரணாய நம:\n" +
          "ஓம் தண்டபிரியாய நம:\n" +
          "ஓம் ரத்தாய நம:\n" +
          "ஓம் ரத்தாக்ஷணாய நம:\n" +
          "ஓம் ரகாசுந்த்றாய நம:\n" +
          "ஓம் ரங்காய நம:\n" +
          "ஓம் ரம்ஜிதாய நம:\n" +
          "ஓம் கெகராய நம:\n" +
          "ஓம் கணபூஜிதியா நம:\n" +
          "ஓம் தீரதிவயாய நம:\n" +
          "\n" +
          "ஓம் ராஜதாய் நம:\n" +
          "ஓம் ராஜஸாய நம:\n" +
          "ஓம் ராஜிபலோசநாய நம:\n" +
          "ஓம் யத்குரியாய நம:\n" +
          "ஓம் யத்பாதறாய நம:\n" +
          "ஓம் கந்தப்பிரியாய நம:\n" +
          "ஓம் கெர்பகுண்டலாய நம:\n" +
          "ஓம் கருயணா நம:\n" +
          "ஓம் கநவல்லபாய நம:\n" +
          "ஓம் கம்யநாஸாய நம:\n" +
          "\n" +
          "ஓம் கம்காளாய நம:\n" +
          "ஓம் ஜராய நம:\n" +
          "ஓம் ருத்ரஸோபிதாய நம:\n" +
          "ஓம் ருத்ரவாதநாய நம:\n" +
          "ஓம் ருத்ரவஜாய நம:\n" +
          "ஓம் வம்ஸாய நம:\n" +
          "ஓம் பாஸவிமோஸநாய நம:\n" +
          "ஓம் பாஸஅஸ்தாய நம:\n" +
          "ஓம் வாதரூடாய நம:\n" +
          "ஓம் வாஸம்கோடாய நம:\n" +
          "\n" +
          "ஓம் யங்காய நம:\n" +
          "ஓம் யசேகாய நம:\n" +
          "ஓம் யத்பூச்யாய நம:\n" +
          "ஓம் யதாகோடியே நம:\n" +
          "ஓம் யமவாங்கியே நம:\n" +
          "ஓம் யம்காளாய நம:\n" +
          "ஓம் யம்கோட்டிய நம:\n" +
          "ஓம் வகாய நம:\n" +
          "ஓம் ஸ்வாமிநாதாய நம:\n" +
          "ஓம் ஸத்வஜாய நம:\n" +
          "\n" +
          "ஓம் ஸ்வஸநாய நம:\n" +
          "ஓம் ஸ்வாமிநேய நம:\n" +
          "ஓம் ஸ்வாதிஸ்டாய நம:\n" +
          "ஓம் ஸ்வாமிசகாய நம:\n" +
          "ஓம் ஈடாகாய நம:\n" +
          "ஓம் அரிணே நம:\n" +
          "ஓம் ஆஸாய நம:\n" +
          "ஓம் காகளாய நம:\n" +
          "ஓம் ஆஸஷநே நம:\n" +
          "ஓம் ஆப்யநாய நம:\n" +
          "ஓம் மகாகாளேஸ்வரஸ்மிநே நம:\n" +
          "\n" +
          "ஓம் ஏகாநனம் நம:\n" +
          "ஓம் துவிநேத்திரம் நம:\n" +
          "ஓம் பாணிநாய நம:\n" +
          "ஓம் துவிபுஜம் நம:\n" +
          "ஓம் கெர்க்கம் நம:\n" +
          "ஓம் தெண்டம் தீர்க்கபாகு தீர்க்க நம:\n" +
          "ஓம் சூஸ்திரம் கிருஷ்ணாவாம் நம:\n" +
          "ஓம் கிருஷ்ணலோஜனம் நம:\n"),
  'thulasi': Ashtothram(
      'ஸ்ரீ துளசி',
      'thulasi',
      "ஓம் ஶ்ரீ துலஸீதே³வ்யை நம꞉ |\n" +
          "ஓம் ஶ்ரீ ஸக்²யை நம꞉ |\n" +
          "ஓம் ஶ்ரீப⁴த்³ராயை நம꞉ |\n" +
          "ஓம் ஶ்ரீமனோஜ்ஞானபல்லவாயை நம꞉ |\n" +
          "ஓம் புரந்த³ரஸதீபூஜ்யாயை நம꞉ |\n" +
          "ஓம் புண்யதா³யை நம꞉ |\n" +
          "ஓம் புண்யரூபிண்யை நம꞉ |\n" +
          "ஓம் ஜ்ஞானவிஜ்ஞானஜனந்யை நம꞉ |\n" +
          "ஓம் தத்த்வஜ்ஞான ஸ்வரூபிண்யை நம꞉ |\n" +
          "ஓம் ஜானகீது³꞉க²ஶமன்யை நம꞉ || 10 ||\n" +
          "\n" +
          "ஓம் ஜனார்த³ன ப்ரியாயை நம꞉ |\n" +
          "ஓம் ஸர்வகல்மஷ ஸம்ஹார்யை நம꞉ |\n" +
          "ஓம் ஸ்மரகோடி ஸமப்ரபா⁴யை நம꞉ |\n" +
          "ஓம் பாஞ்சாலீ பூஜ்யசரணாயை நம꞉ |\n" +
          "ஓம் பாபாரண்யத³வானலாயை நம꞉ |\n" +
          "ஓம் காமிதார்த² ப்ரதா³யை நம꞉ |\n" +
          "ஓம் கௌ³ரீஶாரதா³ஸம்ஸேவிதாயை நம꞉ |\n" +
          "ஓம் வந்தா³ருஜன மந்தா³ராயை நம꞉ |\n" +
          "ஓம் நிலிம்பாப⁴ரணாஸக்தாயை நம꞉ |\n" +
          "ஓம் லக்ஷ்மீசந்த்³ரஸஹோத³ர்யை நம꞉ |\n" +
          "ஓம் ஸனகாதி³ முனித்⁴யேயாயை நம꞉ || 20 ||\n" +
          "\n" +
          "ஓம் க்ருஷ்ணானந்த³ஜனித்ர்யை நம꞉ |\n" +
          "ஓம் சிதா³னந்த³ஸ்வரூபிண்யை நம꞉ |\n" +
          "ஓம் நாராயண்யை நம꞉ |\n" +
          "ஓம் ஸத்யரூபாயை நம꞉ |\n" +
          "ஓம் மாயாதீதாயை நம꞉ |\n" +
          "ஓம் மஹேஶ்வர்யை நம꞉ |\n" +
          "ஓம் வத³னச்ச²வினிர்தூ⁴தராகாபூர்ணனிஶாகராயை நம꞉ |\n" +
          "ஓம் ரோசனாபங்கதிலகலஸன்னிடலபா⁴ஸுராயை நம꞉ |\n" +
          "ஓம் ஶுப⁴ப்ரதா³யை நம꞉ |\n" +
          "ஓம் ஶுத்³தா⁴யை நம꞉ || 30 ||\n" +
          "\n" +
          "ஓம் பல்லவோஷ்ட்²யை நம꞉ |\n" +
          "ஓம் பத்³மமுக்²யை நம꞉ |\n" +
          "ஓம் பு²ல்லபத்³மத³ளேக்ஷணாயை நம꞉ |\n" +
          "ஓம் சாம்பேயகலிகாகாரனாஸாத³ண்ட³விராஜிதாயை நம꞉ |\n" +
          "ஓம் மந்த³ஸ்மிதாயை நம꞉ |\n" +
          "ஓம் மஞ்ஜுலாங்க்³யை நம꞉ |\n" +
          "ஓம் மாத⁴வப்ரியபா⁴மின்யை நம꞉ |\n" +
          "ஓம் மாணிக்யகங்கணாட்⁴யாயை நம꞉ |\n" +
          "ஓம் மணிகுண்ட³லமண்டி³தாயை நம꞉ |\n" +
          "ஓம் இந்த்³ரஸம்பத்கர்யை நம꞉ |\n" +
          "ஓம் ஶக்த்யை நம꞉ || 40 ||\n" +
          "\n" +
          "ஓம் இந்த்³ரகோ³பனிபா⁴ம்ஶுகாயை நம꞉ |\n" +
          "ஓம் க்ஷீராப்³தி⁴தனயாயை நம꞉ |\n" +
          "ஓம் க்ஷீரஸாக³ரஸம்ப⁴வாயை நம꞉ |\n" +
          "ஓம் ஶாந்திகாந்திகு³ணோபேதாயை நம꞉ |\n" +
          "ஓம் ப்³ருந்தா³னுகு³ணஸம்பத்யை நம꞉ |\n" +
          "ஓம் பூதாத்மிகாயை நம꞉ |\n" +
          "ஓம் பூதனாதி³ஸ்வரூபிண்யை நம꞉ |\n" +
          "ஓம் யோக³த்⁴யேயாயை நம꞉ |\n" +
          "ஓம் யோகா³னந்த³கராயை நம꞉ |\n" +
          "ஓம் சதுர்வர்க³ப்ரதா³யை நம꞉ || 50 ||\n" +
          "\n" +
          "ஓம் சாதுர்வர்ணைகபாவனாயை நம꞉ |\n" +
          "ஓம் த்ரிலோகஜனந்யை நம꞉ |\n" +
          "ஓம் க்³ருஹமேதி⁴ஸமாராத்⁴யாயை நம꞉ |\n" +
          "ஓம் ஸதா³னாங்க³ணபாவனாயை நம꞉ |\n" +
          "ஓம் முனீந்த்³ரஹ்ருத³யாவாஸாயை நம꞉ |\n" +
          "ஓம் மூலப்ரக்ருதிஸஞ்ஜ்ஞிகாயை நம꞉ |\n" +
          "ஓம் ப்³ரஹ்மரூபிண்யை நம꞉ |\n" +
          "ஓம் பரஞ்ஜ்யோதிஷே நம꞉ |\n" +
          "ஓம் அவாம்ங்மானஸகோ³சராயை நம꞉ |\n" +
          "ஓம் பஞ்சபூ⁴தாத்மிகாயை நம꞉ || 60 ||\n" +
          "\n" +
          "ஓம் பஞ்சகலாத்மிகாயை நம꞉ |\n" +
          "ஓம் யோகா³ச்யுதாயை நம꞉ |\n" +
          "ஓம் யஜ்ஞரூபிண்யை நம꞉ |\n" +
          "ஓம் ஸம்ஸாரது³꞉க²ஶமன்யை நம꞉ |\n" +
          "ஓம் ஸ்ருஷ்டிஸ்தி²த்யந்தகாரிண்யை நம꞉ |\n" +
          "ஓம் ஸர்வப்ரபஞ்ச நிர்மாத்ர்யை நம꞉ |\n" +
          "ஓம் வைஷ்ணவ்யை நம꞉ |\n" +
          "ஓம் மது⁴ரஸ்வராயை நம꞉ |\n" +
          "ஓம் நிர்கு³ணாயை நம꞉ |\n" +
          "ஓம் நித்யாயை நம꞉ || 70 ||\n" +
          "\n" +
          "ஓம் நிராடங்காயை நம꞉ |\n" +
          "ஓம் தீ³னஜனபாலனதத்பராயை நம꞉ |\n" +
          "ஓம் க்வணத்கிங்கிணிகாஜாலரத்ன காஞ்சீலஸத்கட்யை நம꞉ |\n" +
          "ஓம் சலன்மஞ்ஜீர சரணாயை நம꞉ |\n" +
          "ஓம் சதுரானநஸேவிதாயை நம꞉ |\n" +
          "ஓம் அஹோராத்ரகாரிண்யை நம꞉ |\n" +
          "ஓம் முக்தாஹாரப⁴ராக்ராந்தாயை நம꞉ |\n" +
          "ஓம் முத்³ரிகாரத்னபா⁴ஸுராயை நம꞉ |\n" +
          "ஓம் ஸித்³த⁴ப்ரதா³யை நம꞉ |\n" +
          "ஓம் அமலாயை நம꞉ || 80 ||\n" +
          "\n" +
          "ஓம் கமலாயை நம꞉ |\n" +
          "ஓம் லோகஸுந்த³ர்யை நம꞉ |\n" +
          "ஓம் ஹேமகும்ப⁴குசத்³வயாயை நம꞉ |\n" +
          "ஓம் லஸிதகும்ப⁴குசத்³வயை நம꞉ |\n" +
          "ஓம் சஞ்சலாயை நம꞉ |\n" +
          "ஓம் லக்ஷ்ம்யை நம꞉ |\n" +
          "ஓம் ஶ்ரீக்ருஷ்ணப்ரியாயை நம꞉ |\n" +
          "ஓம் ஶ்ரீராமப்ரியாயை நம꞉ |\n" +
          "ஓம் ஶ்ரீவிஷ்ணுப்ரியாயை நம꞉ |\n" +
          "ஓம் ஶங்கர்யை நம꞉ || 90 ||\n" +
          "\n" +
          "ஓம் ஶிவஶங்கர்யை நம꞉ |\n" +
          "ஓம் துலஸ்யை நம꞉ |\n" +
          "ஓம் குந்த³குட்மலரத³னாயை நம꞉ |\n" +
          "ஓம் பக்வபி³ம்போ³ஷ்ட்²யை நம꞉ |\n" +
          "ஓம் ஶரச்சந்த்³ரிகாயை நம꞉ |\n" +
          "ஓம் சாம்பேயனாஸிகாயை நம꞉ |\n" +
          "ஓம் கம்பு³ஸுந்த³ர க³ளாயை நம꞉ |\n" +
          "ஓம் தடில்ல தாங்க்³யை நம꞉ |\n" +
          "ஓம் மத்த ப³ம்ப⁴ரகுந்தாயை நம꞉ |\n" +
          "ஓம் நக்ஷத்ரனிப⁴னகா²யை நம꞉ | 100\n" +
          "\n" +
          "ஓம் ரம்பா⁴னிபோ⁴ருயுக்³மாயை நம꞉ |\n" +
          "ஓம் ஸைகதஶ்ரோண்யை நம꞉ |\n" +
          "ஓம் மந்த³கண்டீ²ரவமத்⁴யாயை நம꞉ |\n" +
          "ஓம் கீரவாண்யை நம꞉ |\n" +
          "ஓம் ஶ்ரீமஹாதுலஸ்யை நம꞉ | 105\n"),
  'indiran': Ashtothram(
      'ஸ்ரீ இந்திரன்',
      'indiran',
      "ஓம் இந்திராய நம:\n" +
          "ஓம் மஹேந்திராய நம:\n" +
          "ஓம் தேவேந்திராய நம:\n" +
          "ஓம் வ்ருத்ராரயே நம:\n" +
          "ஓம் பாகஸாஸநாய நம:\n" +
          "ஓம் ஐராவதஸீஸயந்தாய நம:\n" +
          "ஓம் பிடௌஜஸே நம:\n" +
          "ஓம் ஸ்வர்நாயகாய நம:\n" +
          "ஓம் ஸஹஸ்ரநேத்ராய நம:\n" +
          "\n" +
          "ஓம் சுபகாய நம:\n" +
          "\n" +
          "ஓம் ஸதமன்யவே நம:\n" +
          "ஓம் புரந்தராய நம:\n" +
          "ஓம் த்ரிலோகாதிபதாய நம:\n" +
          "ஓம் ஸ்ரீமதே நம:\n" +
          "ஓம் ஸசீகாந்தாய நம:\n" +
          "ஓம் ஸுசிஸ்மிதாய நம:\n" +
          "ஓம் வாஸ்தோஷ்பதாய நம:\n" +
          "ஓம் வலாராதாய நம:\n" +
          "ஓம் ஜம்பாராய நம:\n" +
          "ஓம் வேதபர்வநாய நம:\n" +
          "\n" +
          "ஓம் த்விபுஜான்விதாய நம:\n" +
          "ஓம் ஸிநாஸீராய நம:\n" +
          "ஓம் வஜ்ரஹஸ்தாய நம:\n" +
          "ஓம் நகாராய நம:\n" +
          "ஓம் மேநகாப்ரியாய நம:\n" +
          "ஓம் வ்ருத்த ஸ்ரவாஸ நம:\n" +
          "ஓம் காஸ்யபேயாய நம:\n" +
          "ஓம் ஜயந்தஜநகாய நம:\n" +
          "ஓம் ஹராய நம:\n" +
          "ஓம் உச்சைஸ்ரவஸமா யுக்தாய நம:\n" +
          "\n" +
          "ஓம் ஸ்வர்கே ஸாய நம:\n" +
          "ஓம் அதிதிநந்தநாய நம:\n" +
          "ஓம் ஜீமுத வாஹநாய நம:\n" +
          "ஓம் ஜிஷ்ணவே நம:\n" +
          "ஓம் அஹல்யாகாமுகாய நம:\n" +
          "ஓம் வ்ருஷ்ணே நம:\n" +
          "ஓம் உபேந்ரபூர்வஜாய நம:\n" +
          "ஓம் ஸக்ராய நம:\n" +
          "ஓம் ராமகார்யதுரந்தராய நம:\n" +
          "ஓம் திக்பாலநாயகாய நம:\n" +
          "\n" +
          "ஓம் ப்ராக்ஞாய நம:\n" +
          "ஓம் காமதேனு ஸமன்விதாய நம:\n" +
          "ஓம் கௌஸும்ப வஸநோபேதாய நம:\n" +
          "ஓம் வாஸவாய நம:\n" +
          "ஓம் வாமநாக்ரஜாய நம:\n" +
          "ஓம் மகவதெ நம:\n" +
          "ஓம் யக்ஞசுப்ரீதாய நம:\n" +
          "ஓம் ஸுத்ராம்ணே நம:\n" +
          "ஓம் யக்ஞபோஜநாய நம:\n" +
          "ஓம் சிந்தாமணீஸமாயுதாய நம:\n" +
          "\n" +
          "ஓம் பர்ஜன்யாய நம:\n" +
          "ஓம் தீன்பாந்தவாய நம:\n" +
          "ஓம் நமுச்சயே நம:\n" +
          "ஓம் ஹவிர்போக்த்ரே நம:\n" +
          "ஓம் ஸுதாஹாராய நம:\n" +
          "ஓம் ஸுலோலுபாய நம:\n" +
          "ஓம் ஊர்வஸீப்ரேம நிரதாய நம:\n" +
          "ஓம் ஸுதர்மாஸ்தான நாயகாய நம:\n" +
          "ஓம் கல்பத்ருமேஸாய நம:\n" +
          "ஓம் ராஜேந்திராய நம:\n" +
          "\n" +
          "ஓம் நாகாதிபஸமர்ச்சிதாய நம:\n" +
          "ஓம் ஸுகேஸிநாட்யஸுப்ரிதாய நம:\n" +
          "ஓம் திவ்ய ரத்னகிரீடபாத நம:\n" +
          "ஓம் ஸாந்தாய நம:\n" +
          "ஓம் தாந்தாய நம:\n" +
          "ஓம் த்யாம்போதயெ நம:\n" +
          "ஓம் ஜபோத நதபோபஹ்ருதே நம:\n" +
          "ஓம் அஹிப்ரியாய நம:\n" +
          "ஓம் விஷ்ணுபக்தாய நம:\n" +
          "ஓம் திவ்யஸிம்ஹாஸநஸ்திதாய நம:\n" +
          "\n" +
          "ஓம் ருதுதாம்நே நம:\n" +
          "ஓம் ஸத்யவாதிநே நம:\n" +
          "ஓம் ரம்பா லிங்கி தாக்ரஹாய நம:\n" +
          "ஓம் க்ருஷ்ணானுவார நம:\n" +
          "ஓம் ஸுப்ரீதாய நம:\n" +
          "ஓம் ஸதா ஸந்துஷ்ட மாநஸாய நம:\n" +
          "ஓம் காண்டீ விஜநகாய நம:\n" +
          "ஓம் விஷ்ணவே நம:\n" +
          "ஓம் ஸைல, பக்ஷ, ப்ரபேதகாய நம:\n" +
          "ஓம் புண்யாத்மநே நம:\n" +
          "ஓம் வாலிஜநகாய நம:\n" +
          "\n" +
          "ஓம் தக்ஷகோரக ரக்ஷகாய நம:\n" +
          "ஓம் லேகர்ஷபாய நம:\n" +
          "ஓம் தர்மஸ்ரீலாய நம:\n" +
          "ஓம் துராஸாஹெ நம:\n" +
          "ஓம் நிர்மலாஸயாய நம:\n" +
          "ஓம் ஆகண்டலாய நம:\n" +
          "ஓம் வஜ்ரதே ஹாய நம:\n" +
          "ஓம் மருத்வதெ நம:\n" +
          "ஓம் ஜய வர்த நாய நம:\n" +
          "ஓம் ஸங்க்ரந்தநாய நம:\n" +
          "\n" +
          "ஓம் ஹரிஹராய நம:\n" +
          "ஓம் பீஷணாய நம:\n" +
          "ஓம் சண்டவிக்ரமாய நம:\n" +
          "ஓம் ஸத்யாத்மநே நம:\n" +
          "ஓம் பலிதர்ப்பக்நாய நம:\n" +
          "ஓம் புருஹூதநாய நம:\n" +
          "ஓம் பரந்தபாய நம:\n" +
          "ஓம் முநிவந்தியாய நம:\n" +
          "ஓம் யக்ஷஸேவ்யாய நம:\n" +
          "ஓம் வேதாங்காய நம:\n" +
          "\n" +
          "ஓம் ப்ரஹ்மண்யாய நம:\n" +
          "ஓம் புண்டரீகாக்ஷõய நம:\n" +
          "ஓம் ப்ரத்யும்ந ப்ரியபாந்த வாய நம:\n" +
          "ஓம் ப்ராசீனபர்ஹிஷே நம:\n" +
          "ஓம் அநகாய நம:\n" +
          "ஓம் ப்ருதநாஸாஹே நம:\n" +
          "ஓம் புலோம ஜிநே நம:\n" +
          "ஓம் ஸகலோஷ்டார்த்ததாய நம:\n"),
  'varunan': Ashtothram(
      'ஸ்ரீ வருணன்',
      'varunan',
      "ஓம் வருணாய நம:\n" +
          "ஓம் பஸ்சி மாதீ ஸாய நம:\n" +
          "ஓம் பராஜிதாய நம:\n" +
          "ஓம் பாஸ ஹஸ்தாய நம:\n" +
          "ஓம் ஸமுதம ராத்மனே நம:\n" +
          "ஓம் ஸூத்தா த்மனே நம:\n" +
          "ஓம் நக்ர வாஹாநாய நம:\n" +
          "ஓம் ஸக்ராபி முக ஸம்ஸ்தாய நம:\n" +
          "ஓம் ஸித்த புர்யா லயாஸ்ரயாய நம:\n" +
          "ஓம் தீர்த்தேஸாய நம:\n" +
          "\n" +
          "ஓம் பத்மிநீ காந்தாய நம:\n" +
          "ஓம் ஸூதா கும்ப கராப்ஜராஜே நம:\n" +
          "ஓம் ஸாது ஸந்த்யா தர்ஸினே நம:\n" +
          "ஓம் அம்ப நாதிரி விஹாரபுவே நம:\n" +
          "ஓம் அஸ்த ஸீமா நாயகாய நம:\n" +
          "ஓம் ஜலமூர்தயே நம:\n" +
          "ஓம் ஜலாஸ்ரமாய நம:\n" +
          "ஓம் ஜலஜார்ச ஸூப்ரிதாய நம:\n" +
          "ஓம் ஜலஜாயத லோசநாய நம:\n" +
          "ஓம் யாத பதயே நம:\n" +
          "\n" +
          "ஓம் அமேயாத்மனே நம:\n" +
          "ஓம் ப்ரசேதஸே நம:\n" +
          "ஓம் பிரீதி வர்த தநாய நம:\n" +
          "ஓம் ரஸநேந்திரிய நாதாய நம:\n" +
          "ஓம் ரஸபுஸ்டி விதாயகாய நம:\n" +
          "ஓம் மேகா தீஸாய நம:\n" +
          "ஓம் வ்ருஷ்டி கர்த்ரே நம:\n" +
          "ஓம் வாருணீ ஜனகாய நம:\n" +
          "ஓம் அநாயகாய நம:\n" +
          "ஓம் பலராம ப்ரியாய நம:\n" +
          "\n" +
          "ஓம் தீராய நம:\n" +
          "ஓம் பல பத்ர ஸூகப்ரதாய நம:\n" +
          "ஓம் ஸ்வஸ்தி கிருதே நம:\n" +
          "ஓம் ஸ்வஸ்தி வாசக ஸம்பூஜ்யாய நம:\n" +
          "ஓம் ஸுப தாயகாய நம:\n" +
          "ஓம் விஷ்ணு சாப க்ருஹீத்ரே நம:\n" +
          "ஓம் யாகசந்துஷ்ட்ட மாநஸாய நம:\n" +
          "ஓம் ஹரிஸ் சந்த்ர மஹாயாக ஸூப்ரிதாய நம:\n" +
          "ஓம் வரதாயகாய நம:\n" +
          "ஓம் வாயு நிர்ருதி மத்யஸ்தாய நம:\n" +
          "\n" +
          "ஓம் அஞ்ஜநேபோ பரிஸ்திதாய நம:\n" +
          "ஓம் ரத்ன மாலாந்வித களாய நம:\n" +
          "ஓம் முக்தா ஜாலாஸூ தோரணாய நம:\n" +
          "ஓம் யாதோ கண மஹாஸைன்யாய நம:\n" +
          "ஓம் யாதோ வ்ருத்தி விதாகாய நம:\n" +
          "ஓம் நக்ரஸ்தாய நம:\n" +
          "ஓம் நந்த கோபார்ண ஸ்ரீ கிருஷ்ண தோஷகாய நம:\n" +
          "ஓம் அஸ்வமேதீ யாஸ்வ நாதாய நம:\n" +
          "ஓம் காண்டீ வத நுஸ்ஸம்க் ரஹாய நம:\n" +
          "ஓம் ஸபடாம் கஸ்வர்ண வர்ணதாத்ரே நம:\n" +
          "\n" +
          "ஓம் பூத தயாபராய நம:\n" +
          "ஓம் கல்யாண ரூபாய நம:\n" +
          "ஓம் காலஜ்ஞாய நம:\n" +
          "ஓம் கலாபிநே நம:\n" +
          "ஓம் கனகத்யுதயே நம:\n" +
          "ஓம் ஸாபா நுக்ரஹ தக்ஷõய நம:\n" +
          "ஓம் ஸப்த ஸாகார நாயகாய நம:\n" +
          "ஓம் வாயு ப்ரியாய நம:\n" +
          "ஓம் ஸதா நந்தாய நம:\n" +
          "ஓம் வைஸ்வ தேவ ஸமர்சிதாய நம:\n" +
          "\n" +
          "ஓம் தஸாந நவதோத் யோக ஸஹாயாய நம:\n" +
          "ஓம் ஸர்வ ரக்ஷகாய நம:\n" +
          "ஓம் ஸ்ரீ ராம பக்தி ஸம்யுக்தாய நம:\n" +
          "ஓம் ஸ்ரீ கிருஷ்ண ப்ரீதி காரகாய நம:\n" +
          "ஓம் கருணாம்ருத ஸம்யுக்தாய நம:\n" +
          "ஓம் ஸரணாகத வத்ஸலாய நம:\n" +
          "ஓம் ஸர்வ ரத்நவிபூ ஷாட்யாய நம:\n" +
          "ஓம் ஸீதளாய நம:\n" +
          "ஓம் தேவ தோத்தமாய நம:\n" +
          "ஓம் அருணோதய காஞ்சிணே நம:\n" +
          "\n" +
          "ஓம் ப்ரதீ சீஸ்தாந ஸம்ஸ்ரயாய நம:\n" +
          "ஓம் கம்பீர ரூபாய நம:\n" +
          "ஓம் காம்பீர்ய தாயிநே நம:\n" +
          "ஓம் ஸந்தான தாயகாய நம:\n" +
          "ஓம் ஸத்ய ஸந்தாய நம:\n" +
          "ஓம் ஸத்வ ஹதாய நம:\n" +
          "ஓம் ஸாயம் ஸந்த் யாஸு தோஷிதாய நம:\n" +
          "ஓம் நவமேகா பிமாநிநே நம:\n" +
          "ஓம் க்ரீஷ்ம தாப நிவாரகாய நம:\n" +
          "ஓம் ஸாகராந்த ஸ்சராய நம:\n" +
          "\n" +
          "ஓம் தீ மதே நம:\n" +
          "ஓம் ஸர்வ வ்யாபிநே நம:\n" +
          "ஓம் ஜிதேந்திரியாய நம:\n" +
          "ஓம் வார்த்தி பூர்ணகராய நம:\n" +
          "ஓம் மத்ய நிர்மாத்ரே நம:\n" +
          "ஓம் ஸர்வதோ முகாய நம:\n" +
          "ஓம் வால்மீகி தாதாய நம:\n" +
          "ஓம் வாஸிஷ்ட த்விதீய ஜநிகாரணாய நம:\n" +
          "ஓம் ஸார்வ பௌம ஸமாரத்தியாய நம:\n" +
          "ஓம் காமதாய நம:\n" +
          "\n" +
          "ஓம் கல்மஷா பஹாய நம:\n" +
          "ஓம் விவாஹ கால ஸம்பூஜ்யாய நம:\n" +
          "ஓம் புஷ்டிதாய நம:\n" +
          "ஓம் பத்ம வ்ருத்தி க்ருதே நம:\n" +
          "ஓம் கர்ம ஸூத்தி கராய நம:\n" +
          "ஓம் தக்ஷõய நம:\n" +
          "ஓம் நித்யா நந்தாய நம:\n" +
          "ஓம் நிராமயாய நம:\n" +
          "ஓம் மஹேந்த்ர ஸத்ருஸாய நம:\n" +
          "ஓம் மாயிநே நம:\n" +
          "\n" +
          "ஓம் லோக ப்ரீதி விதா யகாய நம:\n" +
          "ஓம் வல்மீக் பேத்ரே நம:\n" +
          "ஓம் ப்ராஜ்ஞாய நம:\n" +
          "ஓம் ஸூதாரூபாய நம:\n" +
          "ஓம் ருசி ப்ரதாய நம:\n" +
          "ஓம் தாந ஸெளம்டாய நம:\n" +
          "ஓம் தயா ஸீலாய நம:\n" +
          "ஓம் ரஸா நந்த விதாயகா நம:\n"),
  '108': Ashtothram(
      '108 திவ்ய தேசங்கள்',
      '108',
      "1 ஸ்ரீரங்கம்\n" +
          "ஸ்ரீ ரங்கநாயகீ ஸமேத ஸ்ரீ ரங்கநாதாய நமஹ\n" +
          "\n" +
          "2 திருக்கோழி\n" +
          "ஸ்ரீ வாஸலக்ஷ்மீ ஸமேத ஸ்ரீ அழகியமணவாள ஸ்வாமினே நமஹ\n" +
          "\n" +
          "3 திருக்கரம்பனூர்\n" +
          "ஸ்ரீ பூர்வாதேவீ ஸமேத ஸ்ரீ புருஷோத்தமாய நமஹ\n" +
          "\n" +
          "4 திருவெள்ளறை\n" +
          "ஸ்ரீ பங்கஜவல்லீ ஸமேத ஸ்ரீ புண்டரீகாக்ஷாய நமஹ\n" +
          "\n" +
          "5 திருஅன்பில்\n" +
          "ஸ்ரீ அழகியவல்லீ ஸமேத திருவடிவழகியநம்பி ஸ்வாமிநே நமஹ\n" +
          "\n" +
          "6 திருப்பேர்நகர்\n" +
          "ஸ்ரீ கமலவல்லீ (இந்திராதேவி) ஸமேத அப்பக்குடத்தான் ஸ்வாமிநே நமஹ\n" +
          "\n" +
          "7 திருக்கண்டியூர்\n" +
          "ஸ்ரீ கமலவல்லீ ஸமேத ஸ்ரீ அரன்சாபந்தீர்த்த ஸ்வாமிநே நமஹ\n" +
          "\n" +
          "8 திருக்கூடலூர்\n" +
          "ஸ்ரீ பத்மாஸநவல்லீ ஸமேத ஸ்ரீ வையங்காத்த ஸ்வாமிநே நமஹ\n" +
          "\n" +
          "9 திருக்கவித்தலம்\n" +
          "ஸ்ரீ ரமாமணிவல்லீ ஸமேத ஸ்ரீ கஜேந்த்ரவரதாய நமஹ\n" +
          "\n" +
          "10 திருப்புள்ளம்பூதங்குடி\n" +
          "ஸ்ரீ பொற்றாமரையாள் ஸமேத ஸ்ரீ வல்வில்ராமாய நமஹ\n" +
          "\n" +
          "11 திருஆதனூர்\n" +
          "ஸ்ரீ ரங்கநாயகீ ஸமேத ஸ்ரீ ஆண்டளக்குமையன் ஸ்வாமிநே நமஹ\n" +
          "\n" +
          "12 திருக்குடந்தை\n" +
          "ஸ்ரீ கோமளவல்லீ ஸமேத ஸ்ரீ சாரங்கபாணியே நமஹ\n" +
          "\n" +
          "13 திருவிண்ணகர்\n" +
          "ஸ்ரீ பூமிதேவி ஸமேத ஒப்பிலியப்பன் ஸ்வாமிநே நமஹ\n" +
          "\n" +
          "14 திருநறையூர்\n" +
          "ஸ்ரீ நம்பிக்கை நாச்சியார் ஸ்ரீவஞ்சுளவல்லி ஸமேத ஸ்ரீ நம்பிஸ்வாமிநே நமஹ\n" +
          "\n" +
          "15 திருச்சேறை\n" +
          "ஸ்ரீ ஸாரநாயகீ ஸமேத ஸ்ரீ சாரநாதாய நமஹ\n" +
          "\n" +
          "16 திருக்கண்ணமங்கை\n" +
          "ஸ்ரீ அபிஷேகவல்லீ ஸமேத ஸ்ரீ பக்தவத்ஸலாய நமஹ\n" +
          "\n" +
          "17 திருக்கண்ணபுரம்\n" +
          "ஸ்ரீ கண்ணபுரநாயகீ ஸமேத ஸ்ரீ சௌரிராஜாய நமஹ\n" +
          "\n" +
          "18 திருக்கண்ணங்குடி\n" +
          "ஸ்ரீ அரவிந்தவல்லீ ஸமேத ஸ்ரீ சியாமளமேனி ஸ்வாமிநே நமஹ\n" +
          "\n" +
          "19 திருநாகை\n" +
          "ஸ்ரீ சௌந்தர்யவல்லீ ஸமேத ஸ்ரீ சௌந்தர்யராஜாய நமஹ\n" +
          "\n" +
          "20 திருத்தஞ்சை மாமணிக்கோவில்\n" +
          "ஸ்ரீசெங்கமலவல்லீ ஸமேத ஸ்ரீ நீலமேக ஸ்வாமிநே நமஹ\n" +
          "\n" +
          "21 திருநந்திபுரவிண்ணகரம்\n" +
          "ஸ்ரீ செண்பகவல்லீ ஸமேத ஸ்ரீ விண்ணகர ஜகந்நாதாய நமஹ\n" +
          "\n" +
          "22 திருவெள்ளியங்குடி\n" +
          "ஸ்ரீ மரகதவல்லீ ஸமேத ஸ்ரீ கோலவில்லிராமாய நமஹ\n" +
          "\n" +
          "23 திருவழுந்துர்\n" +
          "ஸ்ரீ செங்கமலவல்லீ ஸமேத ஸ்ரீ ஆமருவியப்ப ஸ்வாமிநே நமஹ\n" +
          "\n" +
          "24 திருச்சிறுபுலியூர்\n" +
          "ஸ்ரீ திருமாமகள் ஸமேத ஸ்ரீ அருமாகடல் ஸ்வாமிநே நமஹ\n" +
          "\n" +
          "25 திருத்தலைச்சங்கநாண்மதியம்\n" +
          "ஸ்ரீ தலைச்சங்க நாச்சியார் ஸமேத ஸ்ரீ நாண்மதிய ஸ்வாமிநே நமஹ\n" +
          "\n" +
          "26 திருஇந்தளூர்\n" +
          "ஸ்ரீ சந்திரசாபவிமோசனவல்லீ ஸமேத ஸ்ரீ சுகந்தவன பரிமளரங்கநாதாய நமஹ\n" +
          "\n" +
          "27 திருகாவளம்பாடி\n" +
          "ஸ்ரீ மடவரல்மங்கை ஸமேத ஸ்ரீ கோபாலக்ருஷ்ணாய நமஹ\n" +
          "\n" +
          "28 திருக்காழிச்சீராம விண்ணகரம்\n" +
          "ஸ்ரீ மட்டவிழுங்குழலி ஸமேத ஸ்ரீ தாடாள ஸ்வாமிநே நமஹ\n" +
          "\n" +
          "29 திருஅரிமேயவிண்ணகரம்\n" +
          "ஸ்ரீ அமிர்தகடவல்லி ஸமேத ஸ்ரீ குடமாடுகூத்த ஸ்வாமிநே நமஹ\n" +
          "\n" +
          "30 திருவண்புருஷோத்தமம்\n" +
          "ஸ்ரீ புருஷோத்தமநாயகீ ஸமேத ஸ்ரீ புருஷோத்தமாய நமஹ\n" +
          "\n" +
          "31 திருசெம்பொன் செய்கோயில்\n" +
          "ஸ்ரீ அல்லிமாமலர் நாச்சியார் ஸமேத ஸ்ரீ பேரருளாள ஸ்வாமிநே நமஹ\n" +
          "\n" +
          "32 திருமணிமாடக் கோயில்\n" +
          "ஸ்ரீ புண்டரீகவல்லீ ஸமேத ஸ்ரீ நந்தாவிளக்கு ஸ்வாமிநே நமஹ\n" +
          "\n" +
          "33 திருவைகுந்தவிண்ணகரம்\n" +
          "ஸ்ரீ வைகுந்தவல்லீ ஸமேத ஸ்ரீ வைகுந்தநாதாய நமஹ\n" +
          "\n" +
          "34 திருவாலி திருநகரி\n" +
          "ஸ்ரீ அம்ருதகடவல்லீ ஸமேத ஸ்ரீ வயலாளிமணவாள ஸ்வாமிநே நமஹ\n" +
          "\n" +
          "35 திருத்தேவனார்தொகை\n" +
          "ஸ்ரீ கடல்மகள் நாச்சியார் ஸமேத ஸ்ரீ தெய்வநாயகாய நமஹ\n" +
          "\n" +
          "36 திருத்தெற்றியம்பலம்\n" +
          "ஸ்ரீ செங்கமலவல்லீ ஸமேத ஸ்ரீ செங்கண்மால் ஸ்வாமிநே நமஹ\n" +
          "\n" +
          "37 திருமணிக்கூடம்\n" +
          "ஸ்ரீ திருமாமகள் நாச்சியார் ஸமேத ஸ்ரீ மணிக்கூட நாயகாய நமஹ\n" +
          "\n" +
          "38 திருவெள்ளக்குளம்\n" +
          "ஸ்ரீ பூவார் திருமகள் நாச்சியார் ஸமேத ஸ்ரீ கண்ணநாராயணாய நமஹ\n" +
          "\n" +
          "39 திருப்பார்த்தன்பள்ளி\n" +
          "ஸ்ரீ தாமரைநாயகீ ஸமேத ஸ்ரீ தாமரையாள்கேள்வன் ஸ்வாமிநே நமஹ\n" +
          "\n" +
          "40 திருச்சித்ரக்கூடம்\n" +
          "ஸ்ரீ புண்டரீகவல்லீ ஸமேத ஸ்ரீ கோவிந்தராஜாய நமஹ\n" +
          "\n" +
          "41 திருவஹீந்த்ரபுரம்\n" +
          "ஸ்ரீ வைகுண்ட நாயகீ (ஹேமாம்புஜவல்லி தாயார்) ஸமேத ஸ்ரீ தெய்வநாயகாய நமஹ\n" +
          "\n" +
          "42 திருக்கோவலூர்\n" +
          "ஸ்ரீ பூங்கோவல் நாச்சியார் ஸமேத ஸ்ரீ த்ரிவிக்ரமாய நமஹ\n" +
          "\n" +
          "43 திருக்கச்சி\n" +
          "ஸ்ரீ பெருந்தேவித்தாயார் ஸமேத ஸ்ரீ பேரருளாள (ஸ்ரீ வரதராஜன்) ஸ்வாமிநே நமஹ\n" +
          "\n" +
          "44 அஷ்டபுயகரம்\n" +
          "ஸ்ரீ அலர்மேல்மங்கை ஸமேத ஸ்ரீ ஆதிகேசவாய நமஹ\n" +
          "\n" +
          "45 திருத்தண்கால்\n" +
          "ஸ்ரீ மரகதவல்லீ ஸமேத ஸ்ரீ தீபப்பிரகாசய நமஹ\n" +
          "\n" +
          "46 திருவேளுக்கை\n" +
          "ஸ்ரீ வேளுக்கைவல்லீ ஸமேத ஸ்ரீ முகுந்தநாயகாய நமஹ\n" +
          "\n" +
          "47 திருநீரகம்\n" +
          "ஸ்ரீ நிலமங்கைவல்லீ ஸமேத ஸ்ரீ ஜகதீஸாய நமஹ\n" +
          "\n" +
          "48 திருப்பாடகம்\n" +
          "ஸ்ரீ ருக்மணி ஸத்யபாமாதேவீ ஸமேத ஸ்ரீ பாண்டவதூதாய நமஹ\n" +
          "\n" +
          "49 திருநிலாத்திங்கள் துண்டம்\n" +
          "ஸ்ரீ நேர்ஒருவரில்லாவல்லீ ஸமேத ஸ்ரீ நிலாத்திங்கள்துண்டத்தான் ஸ்வாமிநே நமஹ\n" +
          "\n" +
          "50 திருஊரகம்\n" +
          "ஸ்ரீ அமுதவல்லீ ஸமேத ஸ்ரீ உலகளந்தான் ஸ்வாமிநே நமஹ\n" +
          "\n" +
          "51 திருவெஃகா\n" +
          "ஸ்ரீ கோமளவல்லீ ஸமேத ஸ்ரீ சொன்னவண்ணம் செய்த ஸ்வாமிநே நமஹ\n" +
          "\n" +
          "52 திருக்காரகம்\n" +
          "ஸ்ரீ பத்மாமணி நாச்சியார் ஸமேத ஸ்ரீ கருணாகராய நமஹ\n" +
          "\n" +
          "53 திருக்கார்வானம்\n" +
          "ஸ்ரீ கமலவல்லீ ஸமேத ஸ்ரீ கள்வன் ஸ்வாமிநே நமஹ\n" +
          "\n" +
          "54 திருக்கள்வனூர்\n" +
          "ஸ்ரீ அஞ்சிலைவல்லீ ஸமேத ஸ்ரீ ஆதிவராகாய ஸ்வாமிநே நமஹ\n" +
          "\n" +
          "55 திருப்பவளவண்ணம்\n" +
          "ஸ்ரீ பவளவல்லீ ஸமேத ஸ்ரீ பவளவண்ண ஸ்வாமிநே நமஹ\n" +
          "\n" +
          "56 திருப்பரமேஸ்வரவிண்ணகரம்\n" +
          "ஸ்ரீ வைகுந்தவல்லீ ஸமேத ஸ்ரீ பரமபதநாதாய நமஹ\n" +
          "\n" +
          "57 திருப்புட்குழி\n" +
          "ஸ்ரீ மரகதவல்லீ ஸமேத ஸ்ரீ விஜயராகவாய நமஹ\n" +
          "\n" +
          "58 திருநின்றவூர்\n" +
          "ஸ்ரீ என்னைபெற்றதாயார் ஸமேத ஸ்ரீ பக்தவத்சலாய நமஹ\n" +
          "\n" +
          "59 திருஎவ்வுள்\n" +
          "ஸ்ரீ கனகவல்லீ ஸமேத ஸ்ரீ வீரராகவாய நமஹ\n" +
          "\n" +
          "60 திருவல்லிக்கேணி\n" +
          "ஸ்ரீ ருக்மணி ஸமேத ஸ்ரீ வேங்கடக்ருஷ்ணாய நமஹ\n" +
          "\n" +
          "61 திருநீர்மலை\n" +
          "ஸ்ரீ அணிமா மலர்மங்கை ஸமேத ஸ்ரீ நீர்வண்ணன் ஸ்வாமிநே நமஹ\n" +
          "\n" +
          "62 திருஇடவெந்தை\n" +
          "ஸ்ரீ கோமளவல்லீ ஸமேத ஸ்ரீ நித்யகல்யாண வராஹாய நமஹ\n" +
          "\n" +
          "63 திருக்கடல்மல்லை\n" +
          "ஸ்ரீ நிலமங்கைநாச்சியார் ஸமேத ஸ்ரீ ஸ்தல சயனத்துறைவான் ஸ்வாமிநே நமஹ\n" +
          "\n" +
          "64திருக்கடிகை\n" +
          "ஸ்ரீ அம்ருதவல்லீ ஸமேத ஸ்ரீ யோக நரசிம்ஹாய நமஹ\n" +
          "\n" +
          "65 திருநாவாய்\n" +
          "ஸ்ரீ மலர்மங்கை நாச்சியார் ஸமேத ஸ்ரீ நாராயணாய நமஹ\n" +
          "\n" +
          "66 திருவித்துவக்கோடு\n" +
          "ஸ்ரீ வித்வக்கோட்டுவல்லீ ஸமேத ஸ்ரீ உய்ய வந்தான் ஸ்வாமிநே நமஹ\n" +
          "\n" +
          "67 திருக்காட்கரை\n" +
          "ஸ்ரீ பெருஞ்செல்வநாயகீ (வாத்சல்யவல்லி) ஸமேத ஸ்ரீ காட்கரையப்பன் ஸ்வாமிநே நமஹ\n" +
          "\n" +
          "68 திருமூழிக்களம்\n" +
          "ஸ்ரீ மதுரவேணீ ஸமேத ஸ்ரீ திருமூழிக்களத்தான் ஸ்வாமிநே நமஹ\n" +
          "\n" +
          "69 திருவல்லவாழ்\n" +
          "ஸ்ரீ திருக்கொழுந்து நாச்சியார் ஸமேத ஸ்ரீ கோலப்பிரான் ஸ்வாமிநே நமஹ\n" +
          "\n" +
          "70 திருக்கடித்தானம்\n" +
          "ஸ்ரீ கற்பகவல்லீ ஸமேத ஸ்ரீ அற்புதநாராயணாய நமஹ\n" +
          "\n" +
          "71 திருச்செங்குன்றூர்\n" +
          "ஸ்ரீ செங்கமலவல்லீ ஸமேத ஸ்ரீ இமயவரப்பன் ஸ்வாமிநே நமஹ\n" +
          "\n" +
          "72 திருப்புலியூர்\n" +
          "ஸ்ரீ பொற்கொடி நாச்சியார் ஸமேத ஸ்ரீ மாயப்பிரான் ஸ்வாமிநே நமஹ\n" +
          "\n" +
          "73 திருவாறன்விளை\n" +
          "ஸ்ரீ பத்மாசன நாச்சியார் ஸமேத ஸ்ரீ திருக்குறளப்பன் ஸ்வாமிநே நமஹ\n" +
          "\n" +
          "74 திருவண்வண்டூர்\n" +
          "ஸ்ரீ கமலவல்லீ ஸமேத ஸ்ரீ பாம்பணையப்பன் ஸ்வாமிநே நமஹ\n" +
          "\n" +
          "75 திருவனந்தபுரம்\n" +
          "ஸ்ரீ ஹரிலக்ஷ்மீ ஸமேத ஸ்ரீ அனந்தபத்மநாபாய நமஹ\n" +
          "\n" +
          "76 திருவாட்டாறு\n" +
          "ஸ்ரீ மரகதவல்லீ ஸமேத ஸ்ரீ ஆதிகேசவாய நமஹ\n" +
          "\n" +
          "77 திருவண்பரிசாரம்\n" +
          "ஸ்ரீ கமலவல்லீ ஸமேத ஸ்ரீ திருக்குறளப்பன் ஸ்வாமிநே நமஹ\n" +
          "\n" +
          "78 திருக்குறுங்குடி\n" +
          "ஸ்ரீ குறுங்குடிவல்லீ ஸமேத ஸ்ரீ வைஷ்ணவநம்பி ஸ்வாமிநே நமஹ\n" +
          "\n" +
          "79 திருச்சிரீவரமங்கை\n" +
          "ஸ்ரீ ஸ்ரீவரமங்கை நாச்சியார் ஸமேத ஸ்ரீ தோதாத்ரி தெய்வநாயகாய நமஹ\n" +
          "\n" +
          "80 ஸ்ரீவைகுண்டம் (நவதிருப்பதி)\n" +
          "ஸ்ரீ வைகுந்தவல்லீ ஸமேத ஸ்ரீ கள்ளப்பிரான் ஸ்வாமிநே நமஹ\n" +
          "\n" +
          "81 திருவரகுணமங்கை (நவதிருப்பதி)\n" +
          "ஸ்ரீ வரகுணவல்லீ ஸமேத ஸ்ரீ விஜயாஸநாய நமஹ\n" +
          "\n" +
          "82 திருப்புளிங்குடி (நவதிருப்பதி)\n" +
          "ஸ்ரீ மலர்மகள் நாச்சியார் ஸமேத ஸ்ரீகாய்சினவேந்தன் ஸ்வாமிநே நமஹ\n" +
          "\n" +
          "83 திருத்தொலைவில்லி மங்கலம் (நவதிருப்பதி)\n" +
          "ஸ்ரீ கருந்தடங்கண்ணி ஸமேத ஸ்ரீ தேவப்பிரான் ஸ்வாமிநே ஸ்ரீஆரவிந்தலோசநாயச நமஹ\n" +
          "\n" +
          "84 திருக்குளந்தை (நவதிருப்பதி)\n" +
          "ஸ்ரீ குளந்தைவல்லீ ஸமேத ஸ்ரீ மாயகூத்தன் ஸ்வாமிநே நமஹ\n" +
          "\n" +
          "85 திருக்கோளுர் (நவதிருப்பதி)\n" +
          "ஸ்ரீ கோளுர்வல்லீ ஸமேத ஸ்ரீ வைத்தமாநிதி ஸ்வாமிநே நமஹ\n" +
          "\n" +
          "86 தென்திருப்பேரை (நவதிருப்பதி)\n" +
          "ஸ்ரீ குழைக்காதுவல்லீ ஸமேத ஸ்ரீ மகர நெடுங்குழைக்காதன் ஸ்வாமிநே நமஹ\n" +
          "\n" +
          "87 திருக்குருகூர் (நவதிருப்பதி)\n" +
          "ஸ்ரீ ஆதிநாதவல்லீ ஸமேத ஸ்ரீ ஆதிநாதாய நமஹ\n" +
          "\n" +
          "88 திருவில்லிபுத்தூர்\n" +
          "ஸ்ரீ கோதா ஸமேத ஸ்ரீ ரங்கமன்னார் ஸ்வாமிநே ஸ்ரீ வடபத்ரசாயிநேச நமஹ\n" +
          "\n" +
          "89 திருத்தங்கல்\n" +
          "ஸ்ரீ அன்னநாயகீ ஸமேத திருத்தண்கால் அப்பன் ஸ்வாமிநே நமஹ\n" +
          "\n" +
          "90 திருக்கூடல்\n" +
          "ஸ்ரீ மதுரவல்லீ (ஸ்ரீ வகுளவல்லீ) ஸமேத ஸ்ரீ கூடலழகர் ஸ்வாமிநே நமஹ\n" +
          "\n" +
          "91 திருமாலிருஞ்சோலை\n" +
          "ஸ்ரீ சுந்தரவல்லீ ஸமேத ஸ்ரீ சுந்தரராஜாய நமஹ\n" +
          "\n" +
          "92 திருமோகூர்\n" +
          "ஸ்ரீ மோஹநவல்லீ ஸமேத ஸ்ரீ காளமேக ஸ்வாமிநே நமஹ\n" +
          "\n" +
          "93 திருகோஷ்டியூர்\n" +
          "ஸ்ரீ திருமாமகள் நாச்சியார் ஸமேத ஸ்ரீசௌம்யநாராயணாய நமஹ\n" +
          "\n" +
          "94 திருப்புல்லாணி\n" +
          "ஸ்ரீ கல்யாணவல்லீ ஸமேத ஸ்ரீ கல்யாண ஜகந்நாதாய நமஹ\n" +
          "\n" +
          "95 திருமெய்யம்\n" +
          "ஸ்ரீ உய்யவந்தாள் நாச்சியார் ஸமேத ஸ்ரீ ஸத்யகிரிநாதாய நமஹ\n" +
          "\n" +
          "96 திருஅயோத்தி\n" +
          "ஸ்ரீ ஸீதா ஸமேத ஸ்ரீ ரகுநாயகாய நமஹ\n" +
          "\n" +
          "97 நைமிசாரண்யம்\n" +
          "ஸ்ரீ ஸ்ரீஹரிலக்ஷ்மீ ஸமேத ஸ்ரீ தேவராஜாய நமஹ\n" +
          "\n" +
          "98திருப்பிரிதி\n" +
          "ஸ்ரீ பரிமளவல்லீ ஸமேத ஸ்ரீ பரமபுருஷாய நமஹ\n" +
          "\n" +
          "99 கண்டமென்னும் கடிநகர்\n" +
          "ஸ்ரீ புண்டரீகவல்லீ ஸமேத ஸ்ரீ நீலமேகாய நமஹ\n" +
          "\n" +
          "100 திருவதரி\n" +
          "ஸ்ரீ அரவிந்தவல்லீ ஸமேத ஸ்ரீ பத்ரீ நாராயணாய நமஹ\n" +
          "\n" +
          "101 திருச்சாளக்கிராமம்\n" +
          "ஸ்ரீதேவீநாச்சியார் ஸமேத ஸ்ரீ மூர்த்தயே நமஹ\n" +
          "\n" +
          "102 திருவடமதுரை\n" +
          "ஸ்ரீ ருக்மிணீ ஸத்தியபாமா ஸமேத ஸ்ரீ கோவர்த்தநேசாய நமஹ\n" +
          "\n" +
          "103 திருஆய்ப்பாடி\n" +
          "ஸ்ரீ ருக்மணீ ஸத்யபாமா நாயிகா ஸமேத ஸ்ரீ நவ மோகனக்ருஷ்ணாய நமஹ\n" +
          "\n" +
          "104 திருத்துவாரகை\n" +
          "ஸ்ரீ கல்யாணநாச்சியார் ஸமேத ஸ்ரீ கல்யாணநாராயணாய நமஹ\n" +
          "\n" +
          "105 திருச்சிங்கவேள் குன்றம்\n" +
          "ஸ்ரீ லக்ஷ்மீநாச்சியார் ஸமேத ஸ்ரீ நரசிம்ஹாய நமஹ\n" +
          "\n" +
          "106 திருவேங்கடம்\n" +
          "ஸ்ரீ அலர்மேல் மங்கைத்தாயார் ஸமேத ஸ்ரீ திருவேங்கட ஸ்வாமிநே நமஹ\n" +
          "\n" +
          "107திருப்பாற்கடல்\n" +
          "ஸ்ரீ ஸ்ரீகடல்மகள் நாச்சியார் ஸமேத ஸ்ரீ ஷீராப்திநாதாய நமஹ\n" +
          "\n" +
          "108 திருப்பரமபதம்\n" +
          "ஸ்ரீ பெரியபிராட்டியார் ஸமேத ஸ்ரீ பரமபதநாதாய நமஹ\n"),
  'vishvakshenar': Ashtothram(
      'ஸ்ரீ விஷ்வக்ஸேநர்',
      'vishvakshenar',
      "ஓம் ஶ்ரீமத்ஸூத்ரவதீநாதா²ய நம꞉ |\n" +
          "ஓம் ஶ்ரீவிஷ்வக்ஸேனாய நம꞉ |\n" +
          "ஓம் சதுர்பு⁴ஜாய நம꞉ |\n" +
          "ஓம் ஶ்ரீவாஸுதே³வஸேனாந்யாய நம꞉ |\n" +
          "ஓம் ஶ்ரீஶஹஸ்தாவலம்ப³தா³ய நம꞉ |\n" +
          "ஓம் ஸர்வாரம்பே⁴ஷுஸம்பூஜ்யாய நம꞉ |\n" +
          "ஓம் க³ஜாஸ்யாதி³பரீவ்ருதாய நம꞉ |\n" +
          "ஓம் ஸர்வதா³ஸர்வகார்யேஷுஸர்வவிக்⁴னநிவர்தகாய நம꞉ |\n" +
          "ஓம் தீ⁴ரோதா³த்தாய நம꞉ | 9\n" +
          "\n" +
          "ஓம் ஶுசயே நம꞉ |\n" +
          "ஓம் த³க்ஷாய நம꞉ |\n" +
          "ஓம் மாத⁴வாஜ்ஞாப்ரவர்தகாய நம꞉ |\n" +
          "ஓம் ஹரிஸங்கல்பதோவிஶ்வஸ்ருஷ்டிஸ்தி²திலயாதி³க்ருதே நம꞉ |\n" +
          "ஓம் தர்ஜனீமுத்³ரயாவிஶ்வநியந்த்ரே நம꞉ |\n" +
          "ஓம் நியதாத்மவதே நம꞉ |\n" +
          "ஓம் விஷ்ணுப்ரதிநித⁴யே நம꞉ |\n" +
          "ஓம் ஶ்ரீமதே நம꞉ |\n" +
          "ஓம் விஷ்ணுமார்கா³னுகா³ய நம꞉ | 18\n" +
          "\n" +
          "ஓம் ஸுதி⁴யே நம꞉ |\n" +
          "ஓம் ஶங்கி²னே நம꞉ |\n" +
          "ஓம் சக்ரிணே நம꞉ |\n" +
          "ஓம் க³தி³னே நம꞉ |\n" +
          "ஓம் ஶார்ங்கி³ணே நம꞉ |\n" +
          "ஓம் நானாப்ரஹரணாயுதா⁴ய நம꞉ |\n" +
          "ஓம் ஸுரஸேனானந்த³காரிணே நம꞉ |\n" +
          "ஓம் தை³த்யஸேனப⁴யங்கராய நம꞉ |\n" +
          "ஓம் அபி⁴யாத்ரே நம꞉ | 27\n" +
          "\n" +
          "ஓம் ப்ரஹர்த்ரே நம꞉ |\n" +
          "ஓம் ஸேனானயவிஶாரதா³ய நம꞉ |\n" +
          "ஓம் பூ⁴தப்ரேதபிஶாசாதி³ஸர்வஶத்ருநிவாரகாய நம꞉ |\n" +
          "ஓம் ஶௌரிவீரகதா²லாபினே நம꞉ |\n" +
          "ஓம் யஜ்ஞவிக்⁴னகராந்தகாய நம꞉ |\n" +
          "ஓம் கடாக்ஷமாத்ரவிஜ்ஞாதவிஷ்ணுசித்தாய நம꞉ |\n" +
          "ஓம் சதுர்க³தயே நம꞉ |\n" +
          "ஓம் ஸர்வலோகஹிதகாங்க்ஷிணே நம꞉ |\n" +
          "ஓம் ஸர்வலோகாப⁴யப்ரதா³ய நம꞉ | 36\n" +
          "\n" +
          "ஓம் ஆஜானுபா³ஹவே நம꞉ |\n" +
          "ஓம் ஸுஶிரஸே நம꞉ |\n" +
          "ஓம் ஸுலலாடாய நம꞉ |\n" +
          "ஓம் ஸுநாஸிகாய நம꞉ |\n" +
          "ஓம் பீனவக்ஷஸே நம꞉ |\n" +
          "ஓம் விஶாலாக்ஷாய நம꞉ |\n" +
          "ஓம் மேக⁴க³ம்பீ⁴ரநிஸ்வனாய நம꞉ |\n" +
          "ஓம் ஸிம்ஹமத்⁴யாய நம꞉ |\n" +
          "ஓம் ஸிம்ஹக³தயே நம꞉ | 45\n" +
          "\n" +
          "ஓம் ஸிம்ஹாக்ஷாய நம꞉ |\n" +
          "ஓம் ஸிம்ஹவிக்ரமாய நம꞉ |\n" +
          "ஓம் கிரீடகர்ணிகாமுக்தாஹாரகேயூரபூ⁴ஷிதாய நம꞉ |\n" +
          "ஓம் அங்கு³ளீமுத்³ரிகாப்⁴ராஜத³ங்கு³ளயே நம꞉ |\n" +
          "ஓம் ஸ்மரஸுந்த³ராய நம꞉ |\n" +
          "ஓம் யஜ்ஞோபவீதினே நம꞉ |\n" +
          "ஓம் ஸர்வோத்தரோத்தரீயாய நம꞉ |\n" +
          "ஓம் ஸுஶோப⁴னாய நம꞉ |\n" +
          "ஓம் பீதாம்ப³ரத⁴ராய நம꞉ | 54\n" +
          "\n" +
          "ஓம் ஸ்ரக்³விணே நம꞉ |\n" +
          "ஓம் தி³வ்யக³ந்தா⁴னுலேபனாய நம꞉ |\n" +
          "ஓம் ரம்யோர்த்⁴வபுண்ட்³ரதிலகாய நம꞉ |\n" +
          "ஓம் த³யாஞ்சிதத்³ருக³ஞ்சலாய நம꞉ |\n" +
          "ஓம் அஸ்த்ரவித்³யாஸ்பு²ரன்மூர்தயே நம꞉ |\n" +
          "ஓம் ரஶநாஶோபி⁴மத்⁴யமாய நம꞉ |\n" +
          "ஓம் கடிப³ந்த⁴த்ஸருன்யஸ்தக²ட்³கா³ய நம꞉ |\n" +
          "ஓம் ஹரிநிஷேவிதாய நம꞉ |\n" +
          "ஓம் ரத்னமஞ்ஜுலமஞ்ஜீரஶிஞ்ஜானபத³பங்கஜாய நம꞉ | 63\n" +
          "\n" +
          "ஓம் மந்த்ரகோ³ப்த்ரே நம꞉ |\n" +
          "ஓம் அதிக³ம்பீ⁴ராய நம꞉ |\n" +
          "ஓம் தீ³ர்க⁴த³ர்ஶினே நம꞉ |\n" +
          "ஓம் ப்ரதாபவதே நம꞉ |\n" +
          "ஓம் ஸர்வஜ்ஞாய நம꞉ |\n" +
          "ஓம் ஸர்வஶக்தயே நம꞉ |\n" +
          "ஓம் நிகி²லோபாயகோவிதா³ய நம꞉ |\n" +
          "ஓம் அதீந்த்³ராய நம꞉ |\n" +
          "ஓம் அப்ரமத்தாய நம꞉ | 72\n" +
          "\n" +
          "ஓம் வேத்ரத³ண்ட³த⁴ராய நம꞉ |\n" +
          "ஓம் ப்ரப⁴வே நம꞉ |\n" +
          "ஓம் ஸமயஜ்ஞாய நம꞉ |\n" +
          "ஓம் ஶுபா⁴சாராய நம꞉ |\n" +
          "ஓம் ஸுமனஸே நம꞉ |\n" +
          "ஓம் ஸுமனஸ꞉ ப்ரியாய நம꞉ |\n" +
          "ஓம் மந்த³ஸ்மிதாஞ்சிதமுகா²ய நம꞉ |\n" +
          "ஓம் ஶ்ரீபூ⁴னீளாப்ரியங்கராய நம꞉ |\n" +
          "ஓம் அனந்தக³ருடா³தீ³னாம் ப்ரியக்ருதே நம꞉ | 81\n" +
          "\n" +
          "ஓம் ப்ரியபூ⁴ஷணாய நம꞉ |\n" +
          "ஓம் விஷ்ணுகிங்கரவர்க³ஸ்ய தத்தத்கார்யோபதே³ஶகாய நம꞉ |\n" +
          "ஓம் லக்ஷ்மீநாத²பதா³ம்போ⁴ஜஷட்பதா³ய நம꞉ |\n" +
          "ஓம் ஷட்பத³ப்ரியாய நம꞉ |\n" +
          "ஓம் ஶ்ரீதே³வ்யனுக்³ரஹப்ராப்த த்³வயமந்த்ராய நம꞉ |\n" +
          "ஓம் க்ருதாந்தவிதே³ நம꞉ |\n" +
          "ஓம் விஷ்ணுஸேவிததி³வ்யஸ்ரக் அம்ப³ராதி³நிஷேவித்ரே நம꞉ |\n" +
          "ஓம் ஶ்ரீஶப்ரியகராய நம꞉ |\n" +
          "ஓம் ஶ்ரீஶபு⁴க்தஶேஷைகபோ⁴ஜனாய நம꞉ | 90\n" +
          "\n" +
          "ஓம் ஸௌம்யமூர்தயே நம꞉ |\n" +
          "ஓம் ப்ரஸன்னாத்மனே நம꞉ |\n" +
          "ஓம் கருணாவருணாலயாய நம꞉ |\n" +
          "ஓம் கு³ருபங்க்திப்ரதா⁴னாய நம꞉ |\n" +
          "ஓம் ஶ்ரீஶட²கோபமுனேர்கு³ரவே நம꞉ |\n" +
          "ஓம் மந்த்ரரத்னானுஸந்தா⁴த்ரே நம꞉ |\n" +
          "ஓம் ந்யாஸமார்க³ப்ரவர்தகாய நம꞉ |\n" +
          "ஓம் வைகுண்ட²ஸூரி பரிஷந்நிர்வாஹகாய நம꞉ |\n" +
          "ஓம் உதா³ரதி⁴யே நம꞉ | 99\n" +
          "\n" +
          "ஓம் ப்ரஸன்னஜனஸம்ஸேவ்யாய நம꞉ |\n" +
          "ஓம் ப்ரஸன்னமுக²பங்கஜாய நம꞉ |\n" +
          "ஓம் ஸாது⁴லோகபரித்ராதே நம꞉ |\n" +
          "ஓம் து³ஷ்டஶிக்ஷணதத்பராய நம꞉ |\n" +
          "ஓம் ஶ்ரீமந்நாராயணபத³ஶரணத்வப்ரபோ³த⁴காய நம꞉ |\n" +
          "ஓம் ஶ்ரீவைப⁴வக்²யாபயித்ரே நம꞉ |\n" +
          "ஓம் ஸ்வவஶம்வத³மாத⁴வாய நம꞉ |\n" +
          "ஓம் விஷ்ணுனா பரமம் ஸாம்யமாபன்னாய நம꞉ |\n" +
          "ஓம் தே³ஶிகோத்தமாய நம꞉ | 108\n" +
          "ஓம் ஶ்ரீமதே விஷ்வக்ஸேனாய நம꞉ |\n"),
  'aanjaneyan': Ashtothram(
      'ஸ்ரீ ஆஞ்சநேயர்',
      'aanjaneyan',
      "ஓம் ஶ்ரீ ஆஞ்ஜனேயாய நம:\n" +
          "ஓம் மஹாவீராய நம:\n" +
          "ஓம் ஹனுமதே நம:\n" +
          "ஓம் மாருதாத்மஜாய நம:\n" +
          "ஓம் தத்த்வஜ்ஞானப்ரதா3ய நம:\n" +
          "ஓம் ஸீதாதே3வீமுத்3ராப்ரதா3யகாய நம:\n" +
          "ஓம் அஶோகவனிகாச்சேத்ரே நம:\n" +
          "ஓம் ஸர்வமாயாவிப4ஞ்ஜனாய நம:\n" +
          "ஓம் ஸர்வப3ன்த4விமோக்த்ரே நம: \n" +
          "ஓம் ரக்ஷோவித்4வம்ஸகாரகாயனம: (1௦)\n" +
          "ஓம் வரவித்3யா பரிஹாராய நம:\n" +
          "ஓம் பரஶௌர்ய வினாஶனாய நம:\n" +
          "ஓம் பரமன்த்ர நிராகர்த்ரே நம:\n" +
          "ஓம் பரமன்த்ர ப்ரபே4த3காய நம:\n" +
          "ஓம் ஸர்வக்3ரஹ வினாஶினே நம:\n" +
          "ஓம் பீ4மஸேன ஸஹாயக்ருதே நம:\n" +
          "ஓம் ஸர்வது3:க2 ஹராய நம:\n" +
          "ஓம் ஸர்வலோக சாரிணே நம:\n" +
          "ஓம் மனோஜவாய நம:\n" +
          "ஓம் பாரிஜாத த்4ருமமூலஸ்தா2ய நம: (2௦)\n" +
          "ஓம் ஸர்வமன்த்ர ஸ்வரூபவதே நம:\n" +
          "ஓம் ஸர்வதன்த்ர ஸ்வரூபிணே நம:\n" +
          "ஓம் ஸர்வயன்த்ராத்மகாய நம:\n" +
          "ஓம் கபீஶ்வராய நம:\n" +
          "ஓம் மஹாகாயாய நம:\n" +
          "ஓம் ஸர்வரோக3ஹராய நம:\n" +
          "ஓம் ப்ரப4வே நம:\n" +
          "ஓம் ப3லஸித்3தி4கராய நம:\n" +
          "ஓம் ஸர்வவித்3யாஸம்பத்ர்பதா3யகாய நம:\n" +
          "ஓம் கபிஸேனா நாயகாய நம: (3௦)\n" +
          "ஓம் ப4விஷ்யச்சதுரானநாய நம:\n" +
          "ஓம் குமார ப்3ரஹ்மசாரிணே நம:\n" +
          "ஓம் ரத்னகுண்ட3ல தீ3ப்திமதே நம:\n" +
          "ஓம் ஸஞ்சலத்3வால ஸன்னத்3த4லம்ப3மான ஶிகோ2ஜ்ஜ்வலாய நம:\n" +
          "ஓம் க3ன்த4ர்வ வித்3யாதத்த்வஜ்ஞாய நம:\n" +
          "ஓம் மஹாப3லபராக்ரமாய நம:\n" +
          "ஓம் காராக்3ருஹ விமோக்த்ரே நம:\n" +
          "ஓம் ஶ்ருங்க3லாப3ன்த4விமோசகாய நம:\n" +
          "ஓம் ஸாக3ரோத்தாரகாய நம:\n" +
          "ஓம் ப்ராஜ்ஞாய நம: (4௦)\n" +
          "ஓம் ராமதூ3தாய நம:\n" +
          "ஓம் ப்ரதாபவதே நம:\n" +
          "ஓம் வானராய நம:\n" +
          "ஓம் கேஸரீஸுதாய நம:\n" +
          "ஓம் ஸீதாஶோக நிவாரணாய நம:\n" +
          "ஓம் அஞ்ஜனா க3ர்ப4ஸம்பூ4தாய நம:\n" +
          "ஓம் பா3லார்க ஸத்3ருஶானநாய நம:\n" +
          "ஓம் விபீ4ஷண ப்ரியகராய நம:\n" +
          "ஓம் த3ஶக்3ரீவ குலான்தகாய நம:\n" +
          "ஓம் லக்ஷ்மண ப்ராணதா3த்ரே நம: (5௦)\n" +
          "ஓம் வஜ்ரகாயாய நம:\n" +
          "ஓம் மஹாத்3யுதயே நம:\n" +
          "ஓம் சிரஞ்ஜீவினே நம:\n" +
          "ஓம் ராமப4க்தாய நம:\n" +
          "ஓம் தை3த்யகார்ய விகா4தகாய நம:\n" +
          "ஓம் அக்ஷஹன்த்ரே நம:\n" +
          "ஓம் காஞ்சனாபா4ய நம:\n" +
          "ஓம் பஞ்சவக்த்ராய நம:\n" +
          "ஓம் மஹாதபஸே நம:\n" +
          "ஓம் லங்கிணீப4ஞ்ஜனாய நம: (6௦)\n" +
          "ஓம் ஶ்ரீமதே நம:\n" +
          "ஓம் ஸிம்ஹிகாப்ராணப4ஞ்ஜனாய நம:\n" +
          "ஓம் க3ன்த4மாத3ன ஶைலஸ்தா2ய நம:\n" +
          "ஓம் லங்காபுர விதா3ஹகாய நம:\n" +
          "ஓம் ஸுக்3ரீவ ஸசிவாய நம:\n" +
          "ஓம் தீ4ராய நம:\n" +
          "ஓம் ஶூராய நம:\n" +
          "ஓம் தை3த்யகுலான்தகாய நம:\n" +
          "ஓம் ஸுரார்சிதாய நம:\n" +
          "ஓம் மஹாதேஜஸே நம: (7௦)\n" +
          "ஓம் ராமசூடா3மணி ப்ரதா3ய நம:\n" +
          "ஓம் காமரூபிணே நம:\n" +
          "ஓம் ஶ்ரீ பிங்க3ல்தா3க்ஷாய நம:\n" +
          "ஓம் வார்தி4மைனாகபூஜிதாய நம:\n" +
          "ஓம் கப3ல்தீ3க்ருத மார்தாண்ட3மண்ட3லாய நம:\n" +
          "ஓம் விஜிதேன்த்3ரியாய நம:\n" +
          "ஓம் ராமஸுக்3ரீவ ஸன்தா4த்ரே நம:\n" +
          "ஓம் மஹாராவண மர்த3னாய நம:\n" +
          "ஓம் ஸ்ப2டிகாபா4ய நம:\n" +
          "ஓம் வாக3தீ4ஶாய நம: (8௦)\n" +
          "ஓம் நவவ்யாக்ருதி பண்டி3தாய நம:\n" +
          "ஓம் சதுர்பா3ஹவே நம:\n" +
          "ஓம் தீ3னப3ன்த4வே நம:\n" +
          "ஓம் மஹாத்மனே நம:\n" +
          "ஓம் ப4க்தவத்ஸலாய நம:\n" +
          "ஓம் ஸஞ்ஜீவன நகா3ர்த்ரே நம:\n" +
          "ஓம் ஶுசயே நம:\n" +
          "ஓம் வாக்3மினே நம:\n" +
          "ஓம் த்3ருட4வ்ரதாய நம: (9௦)\n" +
          "ஓம் காலனேமி ப்ரமத2னாய நம:\n" +
          "ஓம் ஹரிமர்கட மர்கடாயனம:\n" +
          "ஓம் தா3ன்தாய நம:\n" +
          "ஓம் ஶான்தாய நம:\n" +
          "ஓம் ப்ரஸன்னாத்மனே நம:\n" +
          "ஓம் ஶதகண்ட2 மதா3பஹ்ருதேனம:\n" +
          "ஓம் யோகி3னே நம:\n" +
          "ஓம் ராமகதா2லோலாய நம:\n" +
          "ஓம் ஸீதான்வேஷண பண்டி3தாய நம:\n" +
          "ஓம் வஜ்ரனகா2ய நம: (1௦௦)\n" +
          "ஓம் ருத்3ரவீர்ய ஸமுத்3ப4வாய நம:\n" +
          "ஓம் இன்த்3ரஜித்ப்ரஹிதாமோக4 ப்3ரஹ்மாஸ்த்ரனிவாரகாய நம:\n" +
          "ஓம் பார்த2த்4வஜாக்3ர ஸம்வாஸினே நம:\n" +
          "ஓம் ஶரபஞ்ஜர பே4த3காய நம:\n" +
          "ஓம் த3ஶபா3ஹவே நம:\n" +
          "ஓம் லோகபூஜ்யாய நம:\n" +
          "ஓம் ஜாம்ப3வதீத்ப்ரீதிவர்த4னாய நம:\n" +
          "ஓம் ஸீதாஸமேத ஶ்ரீராமபாத3ஸேவாது3ரன்த4ராய நம:\n"),
  'garuda': Ashtothram(
      'ஸ்ரீ கருடன்',
      'garuda',
      "ஓம் கருடாய நம:\n" +
          "ஓம் வைநதேயாய நம:\n" +
          "ஓம் ககபதயே நம:\n" +
          "ஓம் காஸ்யபாய நம:\n" +
          "ஓம் அக்நயே நம:\n" +
          "ஓம் மஹாபலாய நம:\n" +
          "ஓம் தப்தகாந்சநவர்ணாபாய நம:\n" +
          "ஓம் ஸுபர்ணாய நம:\n" +
          "ஓம் ஹரிவாஹநாய நம:\n" +
          "ஓம் சந்தோமயாய நம: || 10 ||\n" +
          "\n" +
          "ஓம் மஹாதேஜஸே நம:\n" +
          "ஓம் மஹோத்ஸஹாய நம:\n" +
          "ஓம் மஹாபலாய நம:\n" +
          "ஓம் ப்ரஹ்மண்யாய நம:\n" +
          "ஓம் விஸ்ணுபக்தாய நம:\n" +
          "ஓம் குந்தேந்துதவளாநநாய நம:\n" +
          "ஓம் சக்ரபாணிதராய நம:\n" +
          "ஓம் ஸ்ரீமதே நம:\n" +
          "ஓம் நாகாரயே நம:\n" +
          "ஓம் நாகபூஸணாய நம: || 20 ||\n" +
          "\n" +
          "ஓம் விக்யாநதாய நம:\n" +
          "ஓம் விஸேஸக்யாய நம:\n" +
          "ஓம் வித்யாநிதயே நம:\n" +
          "ஓம் அநாமயாய நம:\n" +
          "ஓம் பூதிதாய நம:\n" +
          "ஓம் புவநதாத்ரே நம:\n" +
          "ஓம் பூஸயாய நம:\n" +
          "ஓம் பக்தவத்ஸலாய நம:\n" +
          "ஓம் ஸப்தசந்தோமயாய நம:\n" +
          "ஓம் பக்ஸிணே நம: || 30 ||\n" +
          "\n" +
          "ஓம் ஸுராஸுரபூஜிதாய நம:\n" +
          "ஓம் கஜபுஜே நம:\n" +
          "ஓம் கச்சபாஸிநே நம:\n" +
          "ஓம் தைத்யஹந்த்ரே நம:\n" +
          "ஓம் அருணாநுஜாய நம:\n" +
          "ஓம் அம்றுதாம்ஸாய நம:\n" +
          "ஓம் அம்றுதவபுஸே நம:\n" +
          "ஓம் ஆநந்தநிதயே நம:\n" +
          "ஓம் அவ்யயாய நம:\n" +
          "ஓம் நிகமாத்மநே நம: || 40 ||\n" +
          "\n" +
          "ஓம் நிராஹாராய நம:\n" +
          "ஓம் நிஸ்த்ரைகுண்யாய நம:\n" +
          "ஓம் நிரவ்யாய நம:\n" +
          "ஓம் நிர்விகல்பாய நம:\n" +
          "ஓம் பரஸ்மைஜ்யோதிஸே நம:\n" +
          "ஓம் பராத்பரதராய நம:\n" +
          "ஓம் பரஸ்மை நம:\n" +
          "ஓம் ஸுபாந்காய நம:\n" +
          "ஓம் ஸுபதாய நம:\n" +
          "ஓம் ஸூராய நம: || 50 ||\n" +
          "\n" +
          "ஓம் ஸூக்ஸ்மரூபிணே நம:\n" +
          "ஓம் ப்றுஹத்தநவே நம:\n" +
          "ஓம் விஸாஸிநே நம:\n" +
          "ஓம் விதிதாத்மநே நம:\n" +
          "ஓம் விதிதாய நம:\n" +
          "ஓம் ஜயவர்தநாய நம:\n" +
          "ஓம் தார்ட்யாந்காய நம:\n" +
          "ஓம் ஜகதீஸாய நம:\n" +
          "ஓம் ஜநார்தநம:ாத்வஜாய நம:\n" +
          "ஓம் ஸதாம்ஸந்தாபவிச்சேத்ரே நம: || 60 ||\n" +
          "\n" +
          "ஓம் ஜராமரணவர்ஜிதாய நம:\n" +
          "ஓம் கல்யாணதாய நம:\n" +
          "ஓம் காலாதீதாய நம:\n" +
          "ஓம் கலாதரஸமப்ரபாய நம:\n" +
          "ஓம் ஸோமபாய நம:\n" +
          "ஓம் ஸுரஸந்கேஸாய நம:\n" +
          "ஓம் யக்யாந்காய நம:\n" +
          "ஓம் யக்யபூஸணாய நம:\n" +
          "ஓம் மஹாஜவாய நம:\n" +
          "ஓம் ஜிதாமித்ராய நம: || 70 ||\n" +
          "\n" +
          "ஓம் மந்மதப்ரியபாந்தவாய நம:\n" +
          "ஓம் ஸந்கப்றுதே நம:\n" +
          "ஓம் சக்ரதாரிணே நம:\n" +
          "ஓம் பாலாய நம:\n" +
          "ஓம் பஹுபராக்ரமாய நம:\n" +
          "ஓம் ஸுதாகும்பதராய நம:\n" +
          "ஓம் தீமதே நம:\n" +
          "ஓம் துராதர்ஸாய நம:\n" +
          "ஓம் துராரிக்நே நம:\n" +
          "ஓம் வஜ்ராந்காய நம: || 80 ||\n" +
          "\n" +
          "ஓம் வரதாய நம:\n" +
          "ஓம் வந்த்யாய நம:\n" +
          "ஓம் வாயுவேகாய நம:\n" +
          "ஓம் வரப்ரதாய நம:\n" +
          "ஓம் விநுதாநந்தநாய நம:\n" +
          "ஓம் ஸ்ரீதாய நம:\n" +
          "ஓம் விஜிதாராதிஸந்குலாய நம:\n" +
          "ஓம் பதத்வரிஸ்டராய நம:\n" +
          "ஓம் ஸர்வேஸாய நம:\n" +
          "ஓம் பாபக்நே நம: || 90 ||\n" +
          "\n" +
          "ஓம் பாபநாஸநாய நம:\n" +
          "ஓம் அக்நிஜிதே நம:\n" +
          "ஓம் ஜயகோஸாய நம:\n" +
          "ஓம் ஜகதாஹ்லாதகாரகாய நம:\n" +
          "ஓம் வஜ்ரநாஸாய நம:\n" +
          "ஓம் ஸுவக்த்ராய நம:\n" +
          "ஓம் ஸத்ருக்நாய நம:\n" +
          "ஓம் மதபந்ஜநாய நம:\n" +
          "ஓம் காலக்யாய நம:\n" +
          "ஓம் கமலேஸ்டாய நம: || 100 ||\n" +
          "\n" +
          "ஓம் கலிதோஸநிவாரணாய நம:\n" +
          "ஓம் வித்யுந்நிபாய நம:\n" +
          "ஓம் விஸாலாந்காய நம:\n" +
          "ஓம் விநுதாதாஸ்யவிமோசநாய நம:\n" +
          "ஓம் ஸ்தோமாத்மநே நம:\n" +
          "ஓம் த்ரயீமூர்த்நே நம:\n" +
          "ஓம் பூம்நே நம:\n" +
          "ஓம் காயத்ரலோசநாய நம:\n" +
          "ஓம் ஸாமகாநரதாய நம:\n" +
          "ஓம் ஸ்ரக்விநே நம: || 110 ||\n" +
          "\n" +
          "ஓம் ஸ்வச்சந்தகதயே நம:\n" +
          "ஓம் அக்ரண்யே நம:\n" +
          "ஓம் ஸ்ரீபக்ஸிராஜபரப்ரஹ்மணே நம: || 113 ||\n"),
  'hayagreeva': Ashtothram(
      'ஸ்ரீ ஹயக்ரீவர்',
      'hayagreeva',
      "ஓம் ஹயக்³ரீவாய நம: ।\n" +
          "ஓம் மஹாவிஷ்ணவே நம: ।\n" +
          "ஓம் கேஶவாய நம: ।\n" +
          "ஓம் மது⁴ஸூத³நாய நம: ।\n" +
          "ஓம் கோ³விந்தா³ய நம: ।\n" +
          "ஓம் புண்ட³ரீகாக்ஷாய நம: ।\n" +
          "ஓம் விஷ்ணவே நம: ।\n" +
          "ஓம் விஶ்வம்ப⁴ராய நம: ।\n" +
          "ஓம் ஹரயே நம: ।\n" +
          "ஓம் ஆதி³த்யாய நம: ।\n" +
          "ஓம் ஸர்வவாகீ³ஶாய நம: ।\n" +
          "ஓம் ஸர்வாதா⁴ராய நம: ।\n" +
          "ஓம் ஸநாதநாய நம: ।\n" +
          "ஓம் நிராதா⁴ராய நம: ।\n" +
          "ஓம் நிராகாராய நம: ।\n" +
          "ஓம் நிரீஶாய நம: ।\n" +
          "ஓம் நிருபத்³ரவாய நம: ।\n" +
          "ஓம் நிரஞ்ஜநாய நம: ।\n" +
          "ஓம் நிஷ்கலங்காய நம: ।\n" +
          "ஓம் நித்யத்ருʼப்தாய நம: ॥ 20 ॥\n" +
          "\n" +
          "\n" +
          "ஓம் நிராமயாய நம: ।\n" +
          "ஓம் சிதா³நந்த³மயாய நம: ।\n" +
          "ஓம் ஸாக்ஷிணே நம: ।\n" +
          "ஓம் ஶரண்யாய நம: ।\n" +
          "ஓம் ஸர்வதா³யகாய நம: ।\n" +
          "ஓம் ஶ்ரீமதே நம: ।\n" +
          "ஓம் லோகத்ரயாதீ⁴ஶாய நம: ।\n" +
          "ஓம் ஶிவாய நம: ।\n" +
          "ஓம் ஸாரஸ்வதப்ரதா³ய நம: ।\n" +
          "ஓம் வேதோ³த்³த⁴ர்த்ரே நம: ।\n" +
          "ஓம் வேத³நித⁴யே நம: ।\n" +
          "ஓம் வேத³வேத்³யாய நம: ।\n" +
          "ஓம் ப்ரபோ³த⁴நாய நம: ।\n" +
          "ஓம் பூர்ணாய நம: ।\n" +
          "ஓம் பூரயித்ரே நம: ।\n" +
          "ஓம் புண்யாய நம: ।\n" +
          "ஓம் புண்யகீர்தயே நம: ।\n" +
          "ஓம் பராத்பராய நம: ।\n" +
          "ஓம் பரமாத்மநே நம: ।\n" +
          "ஓம் பரஸ்மை நம: ।\n" +
          "ஓம் ஜ்யோதிஷே நம: ॥ 40 ॥\n" +
          "\n" +
          "ஓம் பரேஶாய நம: ।\n" +
          "ஓம் பாரகா³ய நம: ।\n" +
          "ஓம் பராய நம: ।\n" +
          "ஓம் ஸர்வவேதா³த்மகாய நம: ।\n" +
          "ஓம் விது³ஷே நம: ।\n" +
          "ஓம் வேத³வேதா³ந்தபாரகா³ய நம: ।\n" +
          "ஓம் ஸகலோபநிஷத்³வேத்³யாய நம: ।\n" +
          "ஓம் நிஷ்கலாய நம: ।\n" +
          "ஓம் ஸர்வஶாஸ்த்ரக்ருʼதே நம: ।\n" +
          "ஓம் அக்ஷமாலாஜ்ஞாநமுத்³ராயுக்தஹஸ்தாய நம: ।\n" +
          "ஓம் வரப்ரதா³ய நம: ।\n" +
          "ஓம் புராணபுருஷாய நம: ।\n" +
          "ஓம் ஶ்ரேஷ்டா²ய நம: ।\n" +
          "ஓம் ஶரண்யாய நம: ।\n" +
          "ஓம் பரமேஶ்வராய நம: ।\n" +
          "ஓம் ஶாந்தாய நம: ।\n" +
          "ஓம் தா³ந்தாய நம: ।\n" +
          "ஓம் ஜிதக்ரோதா⁴ய நம: ।\n" +
          "ஓம் ஜிதாமித்ராய நம: ।\n" +
          "ஓம் ஜக³ந்மயாய நம: ॥ 60 ॥\n" +
          "\n" +
          "ஓம் ஜந்மம்ருʼத்யுஹராய நம: ।\n" +
          "ஓம் ஜீவாய நம: ।\n" +
          "ஓம் ஜயதா³ய நம: ।\n" +
          "ஓம் ஜாட்³யநாஶநாய நம: ।\n" +
          "ஓம் ஜபப்ரியாய நம: ।\n" +
          "ஓம் ஜபஸ்துத்யாய நம: ।\n" +
          "ஓம் ஜாபகப்ரியக்ருʼதே நம: ।\n" +
          "ஓம் ப்ரப⁴வே நம: ।\n" +
          "ஓம் விமலாய நம: ।\n" +
          "ஓம் விஶ்வரூபாய நம: ।\n" +
          "ஓம் விஶ்வகோ³ப்த்ரே நம: ।\n" +
          "ஓம் விதி⁴ஸ்துதாய நம: ।\n" +
          "ஓம் விதீ⁴ந்த்³ரஶிவஸம்ஸ்துத்யாய நம: ।\n" +
          "ஓம் ஶாந்திதா³ய நம: ।\n" +
          "ஓம் க்ஷாந்திபாரகா³ய நம: ।\n" +
          "ஓம் ஶ்ரேய:ப்ரதா³ய நம: ।\n" +
          "ஓம் ஶ்ருதிமயாய நம: ।\n" +
          "ஓம் ஶ்ரேயஸாம் பதயே நம: ।\n" +
          "ஓம் ஈஶ்வராய நம: ।\n" +
          "ஓம் அச்யுதாய நம: ॥ 80 ॥\n" +
          "\n" +
          "ஓம் அநந்தரூபாய நம: ।\n" +
          "ஓம் ப்ராணதா³ய நம: ।\n" +
          "ஓம் ப்ருʼதி²வீபதயே நம: ।\n" +
          "ஓம் அவ்யக்தாய நம: ।\n" +
          "ஓம் வ்யக்தரூபாய நம: ।\n" +
          "ஓம் ஸர்வஸாக்ஷிணே நம: ।\n" +
          "ஓம் தமோஹராய நம: ।\n" +
          "ஓம் அஜ்ஞாநநாஶகாய நம: ।\n" +
          "ஓம் ஜ்ஞாநிநே நம: ।\n" +
          "ஓம் பூர்ணசந்த்³ரஸமப்ரபா⁴ய நம: ।\n" +
          "ஓம் ஜ்ஞாநதா³ய நம: ।\n" +
          "ஓம் வாக்பதயே நம: ।\n" +
          "ஓம் யோகி³நே நம: ।\n" +
          "ஓம் யோகீ³ஶாய நம: ।\n" +
          "ஓம் ஸர்வகாமதா³ய நம: ।\n" +
          "ஓம் மஹாயோகி³நே நம: ।\n" +
          "ஓம் மஹாமௌநிநே நம: ।\n" +
          "ஓம் மௌநீஶாய நம: ।\n" +
          "ஓம் ஶ்ரேயஸாம் நித⁴யே நம: ।\n" +
          "ஓம் ஹம்ஸாய நம: ॥ 100 ॥\n" +
          "\n" +
          "ஓம் பரமஹம்ஸாய நம: ।\n" +
          "ஓம் விஶ்வகோ³ப்த்ரே நம: ।\n" +
          "ஓம் விராஜே நம: ।\n" +
          "ஓம் ஸ்வராஜே நம: ।\n" +
          "ஓம் ஶுத்³த⁴ஸ்ப²டிகஸங்காஶாய நம: ।\n" +
          "ஓம் ஜடாமண்ட³லஸம்யுதாய நம: ।\n" +
          "ஓம் ஆதி³மத்⁴யாந்தரஹிதாய நம: ।\n" +
          "ஓம் ஸர்வவாகீ³ஶ்வரேஶ்வராய நம: ॥ 108 ॥\n"),
  'varaha': Ashtothram(
      'ஸ்ரீ வராஹர்',
      'varaha',
      "ஶ்ரீ வராஹாய நம:\n" +
          "மஹீநாதா²ய\n" +
          "பூர்ணாநந்தா³ய\n" +
          "ஜக³த்பதயே ।\n" +
          "நிர்கு³ணாய\n" +
          "நிஷ்கலாய\n" +
          "அநந்தாய\n" +
          "த³ண்ட³காந்தக்ருʼதே\n" +
          "அவ்யயாய ।\n" +
          "ஹிரண்யாக்ஷாந்தக்ருʼதே\n" +
          "தே³வாய\n" +
          "பூர்ணஷாட்³கு³ண்யவிக்³ரஹாய ।\n" +
          "லயோத³தி⁴விஹாரிணே\n" +
          "ஸர்வப்ராணஹிதே ரதாய\n" +
          "அநந்தரூபாய\n" +
          "அநந்தஶ்ரியே ।\n" +
          "ஜிதமந்யவே\n" +
          "ப⁴யாபஹாய\n" +
          "வேதா³ந்தவேத்³யாய\n" +
          "வேதி³நே நம: ॥ 20 ॥\n" +
          "\n" +
          "\n" +
          "வேத³க³ர்பா⁴ய நம:\n" +
          "ஸநாதநாய\n" +
          "ஸஹஸ்ராக்ஷாய\n" +
          "புண்யக³ந்தா⁴ய ।\n" +
          "கல்பக்ருʼதே\n" +
          "க்ஷிதிப்⁴ருʼதே\n" +
          "ஹரயே\n" +
          "பத்³மநாபா⁴ய ।\n" +
          "ஸுராத்⁴யக்ஷாய\n" +
          "ஹேமாங்கா³ய\n" +
          "த³க்ஷிணாமுகா²ய\n" +
          "மஹாகோலாய ।\n" +
          "மஹாபா³ஹவே\n" +
          "ஸர்வதே³வநமஸ்க்ருʼதாய\n" +
          "ஹ்ருʼஷீகேஶாய\n" +
          "ப்ரஸந்நாத்மநே ।\n" +
          "ஸர்வப⁴க்தப⁴யாபஹாய\n" +
          "யஜ்ஞப்⁴ருʼதே\n" +
          "யஜ்ஞக்ருʼதே ।\n" +
          "ஸாக்ஷிணே நம: ॥ 40 ॥\n" +
          "\n" +
          "\n" +
          "யஜ்ஞாங்கா³ய நம:\n" +
          "யஜ்ஞவாஹநாய\n" +
          "ஹவ்யபு⁴ஜே\n" +
          "ஹவ்யதே³வாய ।\n" +
          "ஸதா³வ்யக்தாய\n" +
          "க்ருʼபாகராய\n" +
          "தே³வபூ⁴மிகு³ரவே\n" +
          "காந்தாய\n" +
          "த⁴ர்மகு³ஹ்யாய ।\n" +
          "வ்ருʼஷாகபயே\n" +
          "ஸ்ருவதுண்டா³ய\n" +
          "வக்ரத³ம்ஷ்ட்ராய\n" +
          "நீலகேஶாய\n" +
          "மஹாப³லாய ।\n" +
          "பூதாத்மநே\n" +
          "வேத³நேத்ரே\n" +
          "தே³ஹஹர்த்ருʼஶிரோஹராய\n" +
          "வேதா³தி³க்ருʼதே ।\n" +
          "வேத³கு³ஹ்யாய\n" +
          "ஸர்வவேத³ப்ரவர்தகாய நம: ॥ 60 ॥\n" +
          "\n" +
          "க³பீ⁴ராக்ஷாய நம:\n" +
          "த்ரித⁴ர்மணே\n" +
          "க³ம்பீ⁴ராத்மநே\n" +
          "மஹேஶ்வராய ।\n" +
          "ஆநந்த³வநகா³ய\n" +
          "தி³வ்யாய\n" +
          "ப்³ரஹ்மநாஸாஸமுத்³ப⁴வாய\n" +
          "ஸிந்து⁴தீரநிஷேவிணே ।\n" +
          "க்ஷேமக்ருʼதே\n" +
          "ஸாத்வதாம் பதயே\n" +
          "இந்த்³ரத்ராத்ரே\n" +
          "ஜக³த்த்ராத்ரே ।\n" +
          "மஹேந்த்³ரோத்³த³ண்ட³க³ர்வக்⁴நே\n" +
          "ப⁴க்தவஶ்யாய\n" +
          "ஸதோ³த்³யுக்தாய\n" +
          "நிஜாநந்தா³ய ।\n" +
          "ரமாபதயே\n" +
          "ஸ்துதிப்ரியாய\n" +
          "ஶுபா⁴ங்கா³ய ।\n" +
          "புண்யஶ்ரவணகீர்தநாய நம: ॥ 80 ॥\n" +
          "\n" +
          "ஸத்யக்ருʼதே நம:\n" +
          "ஸத்யஸங்கல்பாய\n" +
          "ஸத்யவாசே\n" +
          "ஸத்யவிக்ரமாய ।\n" +
          "ஸத்யேந கூ³டா⁴ய\n" +
          "ஸத்யாத்மநே\n" +
          "காலாதீதாய\n" +
          "கு³ணாதி⁴காய\n" +
          "பரஸ்மை ஜ்யோதிஷே ।\n" +
          "பரஸ்மை தா⁴ம்நே\n" +
          "பரமாய புருஷாய\n" +
          "பராய\n" +
          "கல்யாணக்ருʼதே\n" +
          "கவயே ।\n" +
          "கர்த்ரே\n" +
          "கர்மஸாக்ஷிணே\n" +
          "ஜிதேந்த்³ரியாய\n" +
          "கர்மக்ருʼதே\n" +
          "கர்மகாண்ட³ஸ்ய\n" +
          "ஸம்ப்ரதா³யப்ரவர்தகாய\n" +
          "ஸர்வாந்தகாய நம: ॥ 100 ॥\n" +
          "\n" +
          "\n" +
          "ஸர்வகா³ய நம:\n" +
          "ஸர்வார்தா²ய\n" +
          "ஸர்வப⁴க்ஷகாய\n" +
          "ஸர்வலோகபதயே ।\n" +
          "ஶ்ரீமதே ஶ்ரீமுஷ்ணேஶாய\n" +
          "ஶுபே⁴க்ஷணாய\n" +
          "ஸர்வதே³வப்ரியாய ।\n" +
          "ஸாக்ஷிணே நம: ॥ 108 ॥\n"),
  'dhanvanthri': Ashtothram(
      'ஸ்ரீ தன்வந்திரி',
      'dhanvanthri',
      "ஓம் அதிதேவாய நம:\n" +
          "ஓம் ஸுராஸுரவந்திதாய நம:\n" +
          "ஓம் வயஸ்ஸ்தாபகாய நம:\n" +
          "ஓம் ஸர்வாமயத்வம்ஸகாய நம:\n" +
          "ஓம் பயாபஹாய நம:\n" +
          "ஓம் ம்ருத்யுஞ்ஜயாய நம:\n" +
          "ஓம் விவிதௌஷததாத்ரே நம:\n" +
          "ஓம் ஸர்வேச்வராய நம:\n" +
          "ஓம் சங்கசக்ரதராய நம:\n" +
          "ஓம் அம்ருதகலசஹஸ்தாய நம:\n" +
          "ஓம் சல்யதந்த்ரவிசாரதாய நம:\n" +
          "ஓம் திவ்யௌஷததராய நம:\n" +
          "ஓம் கருணாம்ருதஸாகராய நம:\n" +
          "ஓம் ஸுககராய நம:\n" +
          "ஓம் சஸ்த்ரக்ரியாகுசலாய நம:\n" +
          "ஓம் தீராய நம:\n" +
          "ஓம் நிரீஹாய நம:\n" +
          "ஓம் சுபதாய நம:\n" +
          "ஓம் மஹாதயாளவே நம:\n" +
          "ஓம் பிஷக்தமாய நம:\n" +
          "ஓம் ப்ராணதாய நம:\n" +
          "ஓம் வித்வத்வராய நம:\n" +
          "ஓம் ஆர்த்தத்ராண பராணாய நம:\n" +
          "ஓம் ஆயுர்வேத ப்ரசாரகாய நம:\n" +
          "ஓம் அஷ்டாங்கயோக நிபுணாய நம:\n" +
          "ஓம் ஜகதுத்தாரகாய நம:\n" +
          "ஓம் அநுத்தமாய நம:\n" +
          "ஓம் ஸர்வஜ்ஞாய நம:\n" +
          "ஓம் விஷ்ணவே நம:\n" +
          "ஓம் ஸமாநாதிகவர்ஜிதாய நம:\n" +
          "ஓம் ஸர்வப்ராணி ஸுஹ்ருதே நம:\n" +
          "ஓம் ஸர்வமங்களகராய நம:\n" +
          "ஓம் ஸர்வார்த்ததாத்ரே நம:\n" +
          "ஓம் மஹாமேதாவிநே நம:\n" +
          "ஓம் அம்ருதபாய நம:\n" +
          "ஓம் ஸத்யஸ்ந்தாய நம:\n" +
          "ஓம் ஆச்ரிதஜநவத்ஸலாய நம:\n" +
          "ஓம் ஸாங்காகதவேத வேத்யாய நம:\n" +
          "ஓம் அம்ருதாசாய நம:\n" +
          "ஓம் அம்ருதலபுஷே நம:\n" +
          "ஓம் ப்ராண நிலயாய நம:\n" +
          "ஓம் புண்டரீகாக்ஷõய நம:\n" +
          "ஓம் லோகாத்யக்ஷõய நம:\n" +
          "ஓம் ப்ராணஜீவநாய நம:\n" +
          "ஓம் ஜந்மமருத்யுஜராதிகாய நம:\n" +
          "ஓம் ஸத்கதிப்ரதாய நம:\n" +
          "ஓம் மஹோத்ஸாஹாய நம:\n" +
          "ஓம் ஸமஸ்தடக்தஸுகதாத்ரே நம:\n" +
          "ஓம் ஸஹிஷ்ணவே நம:\n" +
          "ஓம் ஸித்தாய நம:\n" +
          "ஓம் ஸமாத்மநே நம:\n" +
          "ஓம் வைத்யரத்நாய நம:\n" +
          "ஓம் அம்ருத்யவே நம:\n" +
          "ஓம் மஹாகுரவே நம:\n" +
          "ஓம் அம்ருதாம்சோத்பவாய நம:\n" +
          "ஓம் ஷேமக்ருதே நம:\n" +
          "ஓம் வம்சவர்தநாய நம:\n" +
          "ஓம் வீதபயாய நம:\n" +
          "ஓம் ப்ராணப்ருதே நம:\n" +
          "ஓம் க்ஷீராப்திஜந்மநே நம:\n" +
          "ஓம் சந்த்ர ஸஹோதராய நம:\n" +
          "ஓம் ஸர்வலோக வந்திதாய நம:\n" +
          "ஓம் பரப்ரஹ்மணே நம:\n" +
          "ஓம் யஜ்ஞபோக்தரே நம:\n" +
          "ஓம் புணயச்லோகாய நம:\n" +
          "ஓம் பூஜ்யாபாதாய நம:\n" +
          "ஓம்ஸநாதநதமாய நம:\n" +
          "ஓம் ஸ்வஸ்திதாய நம:\n" +
          "ஓம் தீர்க்காயுஷ்காரகாய நம:\n" +
          "ஓம் புராண புருஷோத்தமாயநம:\n" +
          "ஓம் அமரப்ரபவே நம:\n" +
          "ஓம் அம்ருதாய நம:\n" +
          "ஓம் நாராயணாய நம:\n" +
          "ஓம் ஒளஷதாய நம:\n" +
          "ஓம் ஸர்வாநுகூலாய நம:\n" +
          "ஓம் சோகநாசநாய நம:\n" +
          "ஓம் லோகபந்தவே நம:\n" +
          "ஓம் நாநாரோகார்த்தி பஞ்ஜநாயநம:\n" +
          "ஓம் ப்ரஜாநாம் ஜீவஹேதவே நம:\n" +
          "ஓம் ப்ரஜாரக்ஷணதீக்ஷிதாய நம:\n" +
          "ஓம் சுக்லவாஸஸே நம:\n" +
          "ஓம்புருஷார்த்த ப்ரதாய நம:\n" +
          "ஓம் ப்ரசாந்தாத்மநே நம:\n" +
          "ஓம் பக்தஸர்வார்த்த ஸாதகாய நம:\n" +
          "ஓம்போகபாக்யப்ரதாத்ரே நம:\n" +
          "ஓம் மஹைச்வர்யதாயகாய நம:\n" +
          "ஓம் லோகசல்யஹ்ருதே நம:\n" +
          "ஓம் சதுர்ப்புஜாய நம:\n"),
  'sathyaNarayanan': Ashtothram(
      'ஸ்ரீ ஸத்யநாராயணன்',
      'sathyaNarayanan',
      "ஓம் ஸத்யதே³வாய நம꞉ |\n" +
          "ஓம் ஸத்யாத்மனே நம꞉ |\n" +
          "ஓம் ஸத்யபூ⁴தாய நம꞉ |\n" +
          "ஓம் ஸத்யபுருஷாய நம꞉ |\n" +
          "ஓம் ஸத்யனாதா²ய நம꞉ |\n" +
          "ஓம் ஸத்யஸாக்ஷிணே நம꞉ |\n" +
          "ஓம் ஸத்யயோகா³ய நம꞉ |\n" +
          "ஓம் ஸத்யஜ்ஞானாய நம꞉ |\n" +
          "ஓம் ஸத்யஜ்ஞானப்ரியாய நம꞉ | 9\n" +
          "\n" +
          "ஓம் ஸத்யனித⁴யே நம꞉ |\n" +
          "ஓம் ஸத்யஸம்ப⁴வாய நம꞉ |\n" +
          "ஓம் ஸத்யப்ரப⁴வே நம꞉ |\n" +
          "ஓம் ஸத்யேஶ்வராய நம꞉ |\n" +
          "ஓம் ஸத்யகர்மணே நம꞉ |\n" +
          "ஓம் ஸத்யபவித்ராய நம꞉ |\n" +
          "ஓம் ஸத்யமங்க³ளாய நம꞉ |\n" +
          "ஓம் ஸத்யக³ர்பா⁴ய நம꞉ |\n" +
          "ஓம் ஸத்யப்ரஜாபதயே நம꞉ | 18\n" +
          "\n" +
          "ஓம் ஸத்யவிக்ரமாய நம꞉ |\n" +
          "ஓம் ஸத்யஸித்³தா⁴ய நம꞉ |\n" +
          "ஓம் ஸத்யா(அ)ச்யுதாய நம꞉ |\n" +
          "ஓம் ஸத்யவீராய நம꞉ |\n" +
          "ஓம் ஸத்யபோ³தா⁴ய நம꞉ |\n" +
          "ஓம் ஸத்யத⁴ர்மாய நம꞉ |\n" +
          "ஓம் ஸத்யாக்³ரஜாய நம꞉ |\n" +
          "ஓம் ஸத்யஸந்துஷ்டாய நம꞉ |\n" +
          "ஓம் ஸத்யவராஹாய நம꞉ | 27\n" +
          "\n" +
          "ஓம் ஸத்யபாராயணாய நம꞉ |\n" +
          "ஓம் ஸத்யபூர்ணாய நம꞉ |\n" +
          "ஓம் ஸத்யௌஷதா⁴ய நம꞉ |\n" +
          "ஓம் ஸத்யஶாஶ்வதாய நம꞉ |\n" +
          "ஓம் ஸத்யப்ரவர்த⁴னாய நம꞉ |\n" +
          "ஓம் ஸத்யவிப⁴வே நம꞉ |\n" +
          "ஓம் ஸத்யஜ்யேஷ்டா²ய நம꞉ |\n" +
          "ஓம் ஸத்யஶ்ரேஷ்டா²ய நம꞉ |\n" +
          "ஓம் ஸத்யவிக்ரமிணே நம꞉ | 36\n" +
          "\n" +
          "ஓம் ஸத்யத⁴ன்வினே நம꞉ |\n" +
          "ஓம் ஸத்யமேதா⁴ய நம꞉ |\n" +
          "ஓம் ஸத்யாதீ⁴ஶாய நம꞉ |\n" +
          "ஓம் ஸத்யக்ரதவே நம꞉ |\n" +
          "ஓம் ஸத்யகாலாய நம꞉ |\n" +
          "ஓம் ஸத்யவத்ஸலாய நம꞉ |\n" +
          "ஓம் ஸத்யவஸவே நம꞉ |\n" +
          "ஓம் ஸத்யமேகா⁴ய நம꞉ |\n" +
          "ஓம் ஸத்யருத்³ராய நம꞉ | 45\n" +
          "\n" +
          "ஓம் ஸத்யப்³ரஹ்மணே நம꞉ |\n" +
          "ஓம் ஸத்யா(அ)ம்ருதாய நம꞉ |\n" +
          "ஓம் ஸத்யவேதா³ங்கா³ய நம꞉ |\n" +
          "ஓம் ஸத்யசதுராத்மனே நம꞉ |\n" +
          "ஓம் ஸத்யபோ⁴க்த்ரே நம꞉ |\n" +
          "ஓம் ஸத்யஶுசயே நம꞉ |\n" +
          "ஓம் ஸத்யார்ஜிதாய நம꞉ |\n" +
          "ஓம் ஸத்யேந்த்³ராய நம꞉ |\n" +
          "ஓம் ஸத்யஸங்க³ராய நம꞉ | 54\n" +
          "\n" +
          "ஓம் ஸத்யஸ்வர்கா³ய நம꞉ |\n" +
          "ஓம் ஸத்யனியமாய நம꞉ |\n" +
          "ஓம் ஸத்யமேதா⁴ய நம꞉ |\n" +
          "ஓம் ஸத்யவேத்³யாய நம꞉ |\n" +
          "ஓம் ஸத்யபீயூஷாய நம꞉ |\n" +
          "ஓம் ஸத்யமாயாய நம꞉ |\n" +
          "ஓம் ஸத்யமோஹாய நம꞉ |\n" +
          "ஓம் ஸத்யஸுரானந்தா³ய நம꞉ |\n" +
          "ஓம் ஸத்யஸாக³ராய நம꞉ | 63\n" +
          "\n" +
          "ஓம் ஸத்யதபஸே நம꞉ |\n" +
          "ஓம் ஸத்யஸிம்ஹாய நம꞉ |\n" +
          "ஓம் ஸத்யம்ருகா³ய நம꞉ |\n" +
          "ஓம் ஸத்யலோகபாலகாய நம꞉ |\n" +
          "ஓம் ஸத்யஸ்தி²தாய நம꞉ |\n" +
          "ஓம் ஸத்யதி³க்பாலகாய நம꞉ |\n" +
          "ஓம் ஸத்யத⁴னுர்த⁴ராய நம꞉ |\n" +
          "ஓம் ஸத்யாம்பு³ஜாய நம꞉ |\n" +
          "ஓம் ஸத்யவாக்யாய நம꞉ | 72\n" +
          "\n" +
          "ஓம் ஸத்யகு³ரவே நம꞉ |\n" +
          "ஓம் ஸத்யன்யாயாய நம꞉ |\n" +
          "ஓம் ஸத்யஸாக்ஷிணே நம꞉ |\n" +
          "ஓம் ஸத்யஸம்வ்ருதாய நம꞉ |\n" +
          "ஓம் ஸத்யஸம்ப்ரதா³ய நம꞉ |\n" +
          "ஓம் ஸத்யவஹ்னயே நம꞉ |\n" +
          "ஓம் ஸத்யவாயுவே நம꞉ |\n" +
          "ஓம் ஸத்யஶிக²ராய நம꞉ |\n" +
          "ஓம் ஸத்யானந்தா³ய நம꞉ | 81\n" +
          "\n" +
          "ஓம் ஸத்யாதி⁴ராஜாய நம꞉ |\n" +
          "ஓம் ஸத்யஶ்ரீபாதா³ய நம꞉ |\n" +
          "ஓம் ஸத்யகு³ஹ்யாய நம꞉ |\n" +
          "ஓம் ஸத்யோத³ராய நம꞉ |\n" +
          "ஓம் ஸத்யஹ்ருத³யாய நம꞉ |\n" +
          "ஓம் ஸத்யகமலாய நம꞉ |\n" +
          "ஓம் ஸத்யனாலாய நம꞉ |\n" +
          "ஓம் ஸத்யஹஸ்தாய நம꞉ |\n" +
          "ஓம் ஸத்யபா³ஹவே நம꞉ | 90\n" +
          "\n" +
          "ஓம் ஸத்யமுகா²ய நம꞉ |\n" +
          "ஓம் ஸத்யஜிஹ்வாய நம꞉ |\n" +
          "ஓம் ஸத்யத³ம்ஷ்ட்ராய நம꞉ |\n" +
          "ஓம் ஸத்யனாஸிகாய நம꞉ |\n" +
          "ஓம் ஸத்யஶ்ரோத்ராய நம꞉ |\n" +
          "ஓம் ஸத்யசக்ஷஸே நம꞉ |\n" +
          "ஓம் ஸத்யஶிரஸே நம꞉ |\n" +
          "ஓம் ஸத்யமுகுடாய நம꞉ |\n" +
          "ஓம் ஸத்யாம்ப³ராய நம꞉ | 99\n" +
          "\n" +
          "ஓம் ஸத்யாப⁴ரணாய நம꞉ |\n" +
          "ஓம் ஸத்யாயுதா⁴ய நம꞉ |\n" +
          "ஓம் ஸத்யஶ்ரீவல்லபா⁴ய நம꞉ |\n" +
          "ஓம் ஸத்யகு³ப்தாய நம꞉ |\n" +
          "ஓம் ஸத்யபுஷ்கராய நம꞉ |\n" +
          "ஓம் ஸத்யத்⁴ருதாய நம꞉ |\n" +
          "ஓம் ஸத்யபா⁴மாரதாய நம꞉ |\n" +
          "ஓம் ஸத்யக்³ருஹரூபிணே நம꞉ |\n" +
          "ஓம் ஸத்யப்ரஹரணாயுதா⁴ய நம꞉ | 108\n"),
  'kuberar': Ashtothram(
      'ஸ்ரீ குபேரன்',
      'kuberar',
      "ஓம் குபே³ராய நம꞉ ।\n" +
          "ஓம் த⁴நதா³ய நம꞉ ।\n" +
          "ஓம் ஶ்ரீமதே நம꞉ ।\n" +
          "ஓம் யக்ஷேஶாய நம꞉ ।\n" +
          "ஓம் கு³ஹ்யகேஶ்வராய நம꞉ ।\n" +
          "ஓம் நிதீ⁴ஶாய நம꞉ ।\n" +
          "ஓம் ஶங்கரஸகா²ய நம꞉ ।\n" +
          "ஓம் மஹாலக்ஷ்மீநிவாஸபு⁴வே நம꞉ ।\n" +
          "ஓம் மஹாபத்³மநிதீ⁴ஶாய நம꞉ । 9\n" +
          "\n" +
          "ஓம் பூர்ணாய நம꞉ ।\n" +
          "ஓம் பத்³மநிதீ⁴ஶ்வராய நம꞉ ।\n" +
          "ஓம் ஶங்கா²க்²யநிதி⁴நாதா²ய நம꞉ ।\n" +
          "ஓம் மகராக்²யநிதி⁴ப்ரியாய நம꞉ ।\n" +
          "ஓம் ஸுகச்ச²பநிதீ⁴ஶாய நம꞉ ।\n" +
          "ஓம் முகுந்த³நிதி⁴நாயகாய நம꞉ ।\n" +
          "ஓம் குந்தா³க்²யநிதி⁴நாதா²ய நம꞉ ।\n" +
          "ஓம் நீலநித்⁴யதி⁴பாய நம꞉ ।\n" +
          "ஓம் மஹதே நம꞉ । 18\n" +
          "\n" +
          "ஓம் க²ர்வநித்⁴யதி⁴பாய நம꞉ ।\n" +
          "ஓம் பூஜ்யாய நம꞉ ।\n" +
          "ஓம் லக்ஷ்மிஸாம்ராஜ்யதா³யகாய நம꞉ ।\n" +
          "ஓம் இலாவிடா³புத்ராய நம꞉ ।\n" +
          "ஓம் கோஶாதீ⁴ஶாய நம꞉ ।\n" +
          "ஓம் குலாதீ⁴ஶாய நம꞉ ।\n" +
          "ஓம் அஶ்வாரூடா⁴ய நம꞉ ।\n" +
          "ஓம் விஶ்வவந்த்³யாய நம꞉ ।\n" +
          "ஓம் விஶேஷஜ்ஞாய நம꞉ । 27\n" +
          "\n" +
          "ஓம் விஶாரதா³ய நம꞉ ।\n" +
          "ஓம் ளகூப³ரநாதா²ய நம꞉ ।\n" +
          "ஓம் மணிக்³ரீவபித்ரே நம꞉ ।\n" +
          "ஓம் கூ³ட⁴மந்த்ராய நம꞉ ।\n" +
          "ஓம் வைஶ்ரவணாய நம꞉ ।\n" +
          "ஓம் சித்ரளேகா²மந꞉ப்ரியாய நம꞉ ।\n" +
          "ஓம் ஏகபிஞ்சா²ய நம꞉ ।\n" +
          "ஓம் அலகாதீ⁴ஶாய நம꞉ ।\n" +
          "ஓம் பௌலஸ்த்யாய நம꞉ । 36\n" +
          "\n" +
          "ஓம் நரவாஹநாய நம꞉ ।\n" +
          "ஓம் கைலாஸஶைலநிலயாய நம꞉ ।\n" +
          "ஓம் ராஜ்யதா³ய நம꞉ ।\n" +
          "ஓம் ராவணாக்³ரஜாய நம꞉ ।\n" +
          "ஓம் சித்ரசைத்ரரதா²ய நம꞉ ।\n" +
          "ஓம் உத்³யாநவிஹாராய நம꞉ ।\n" +
          "ஓம் விஹாரஸுகுதூஹலாய நம꞉ ।\n" +
          "ஓம் மஹோத்ஸாஹாய நம꞉ ।\n" +
          "ஓம் மஹாப்ராஜ்ஞாய நம꞉ । 45\n" +
          "\n" +
          "ஓம் ஸதா³புஷ்பகவாஹநாய நம꞉ ।\n" +
          "ஓம் ஸார்வபௌ⁴மாய நம꞉ ।\n" +
          "ஓம் அங்க³நாதா²ய நம꞉ ।\n" +
          "ஓம் ஸோமாய நம꞉ ।\n" +
          "ஓம் ஸௌம்யாதி³கேஶ்வராய நம꞉ ।\n" +
          "ஓம் புண்யாத்மநே நம꞉ ।\n" +
          "ஓம் புருஹூத ஶ்ரியை நம꞉ ।\n" +
          "ஓம் ஸர்வபுண்யஜநேஶ்வராய நம꞉ ।\n" +
          "ஓம் நித்யகீர்தயே நம꞉ । 54\n" +
          "\n" +
          "ஓம் நிதி⁴வேத்ரே நம꞉ ।\n" +
          "ஓம் லங்காப்ராக்த⁴நநாயகாய நம꞉ ।\n" +
          "ஓம் யக்ஷிணீவ்ருதாய நம꞉ ।\n" +
          "ஓம் யக்ஷாய நம꞉ ।\n" +
          "ஓம் பரமஶாந்தாத்மநே நம꞉ ।\n" +
          "ஓம் யக்ஷராஜாய நம꞉ ।\n" +
          "ஓம் யக்ஷிணீ ஹ்ருத³யாய நம꞉ ।\n" +
          "ஓம் கிந்நரேஶ்வராய நம꞉ ।\n" +
          "ஓம் கிம்புருஷநாதா²ய நம꞉ । 63\n" +
          "\n" +
          "ஓம் நாதா²ய நம꞉ ।\n" +
          "ஓம் க²ட்³கா³யுதா⁴ய நம꞉ ।\n" +
          "ஓம் வஶிநே நம꞉ ।\n" +
          "ஓம் ஈஶாநத³க்ஷபார்ஶ்வஸ்தா²ய நம꞉ ।\n" +
          "ஓம் வாயுவாமஸமாஶ்ரயாய நம꞉ ।\n" +
          "ஓம் த⁴ர்மமார்கை³கநிரதாய நம꞉ ।\n" +
          "ஓம் த⁴ர்மஸம்முக²ஸம்ஸ்தி²தாய நம꞉ ।\n" +
          "ஓம் வித்தேஶ்வராய நம꞉ ।\n" +
          "ஓம் த⁴நாத்⁴யக்ஷாய நம꞉ । 72\n" +
          "\n" +
          "ஓம் அஷ்டலக்ஷ்ம்யாஶ்ரிதாலயாய நம꞉ ।\n" +
          "ஓம் மநுஷ்யத⁴ர்மிணே நம꞉ ।\n" +
          "ஓம் ஸத்க்ருதாய நம꞉ ।\n" +
          "ஓம் கோஶலக்ஷ்மீ ஸமாஶ்ரிதாய நம꞉ ।\n" +
          "ஓம் த⁴நலக்ஷ்மீ நித்யநிவாஸாய நம꞉ ।\n" +
          "ஓம் தா⁴ந்யலக்ஷ்மீ நிவாஸபு⁴வே நம꞉ ।\n" +
          "ஓம் அஷ்டலக்ஷ்மீ ஸதா³வாஸாய நம꞉ ।\n" +
          "ஓம் க³ஜலக்ஷ்மீ ஸ்தி²ராளயாய நம꞉ ।\n" +
          "ஓம் ராஜ்யலக்ஷ்மீ ஜந்மகே³ஹாய நம꞉ । 81\n" +
          "\n" +
          "ஓம் தை⁴ர்யலக்ஷ்மீ க்ருபாஶ்ரயாய நம꞉ ।\n" +
          "ஓம் அக²ண்டை³ஶ்வர்ய ஸம்யுக்தாய நம꞉ ।\n" +
          "ஓம் நித்யாநந்தா³ய நம꞉ ।\n" +
          "ஓம் ஸாக³ராஶ்ரயாய நம꞉ ।\n" +
          "ஓம் நித்யத்ருப்தாய நம꞉ ।\n" +
          "ஓம் நிதி⁴தா⁴த்ரே நம꞉ ।\n" +
          "ஓம் நிராஶ்ரயாய நம꞉ ।\n" +
          "ஓம் நிருபத்³ரவாய நம꞉ ।\n" +
          "ஓம் நித்யகாமாய நம꞉ । 90\n" +
          "\n" +
          "ஓம் நிராகாங்க்ஷாய நம꞉ ।\n" +
          "ஓம் நிருபாதி⁴கவாஸபு⁴வே நம꞉ ।\n" +
          "ஓம் ஶாந்தாய நம꞉ ।\n" +
          "ஓம் ஸர்வகு³ணோபேதாய நம꞉ ।\n" +
          "ஓம் ஸர்வஜ்ஞாய நம꞉ ।\n" +
          "ஓம் ஸர்வஸம்மதாய நம꞉ ।\n" +
          "ஓம் ஸர்வாணிகருணாபாத்ராய நம꞉ ।\n" +
          "ஓம் ஸதா³நந்த³க்ருபாலயாய நம꞉ ।\n" +
          "ஓம் க³ந்த⁴ர்வகுலஸம்ஸேவ்யாய நம꞉ । 99\n" +
          "\n" +
          "ஓம் ஸௌக³ந்தி⁴ககுஸுமப்ரியாய நம꞉ ।\n" +
          "ஓம் ஸ்வர்ணநக³ரீவாஸாய நம꞉ ।\n" +
          "ஓம் நிதி⁴பீட²ஸமாஶ்ரயாய நம꞉ ।\n" +
          "ஓம் மஹாமேரூத்தரஸ்தா²யிநே நம꞉ ।\n" +
          "ஓம் மஹர்ஷிக³ணஸம்ஸ்துதாய நம꞉ ।\n" +
          "ஓம் துஷ்டாய நம꞉ ।\n" +
          "ஓம் ஶூர்பணகா² ஜ்யேஷ்டா²ய நம꞉ ।\n" +
          "ஓம் ஶிவபூஜாரதாய நம꞉ ।\n" +
          "ஓம் அநகா⁴ய நம꞉ । 108\n"),
  'bhramha': Ashtothram(
      'ஸ்ரீ பிரம்மா',
      'bhramha',
      "ஓம் ப்ரஹ்மணே நம:\n" +
          "ஓம் வாகதீஸாய நம:\n" +
          "ஓம் ஸுரஜ்யேஷ்டாய நம:\n" +
          "ஓம் ஹிரண்யகர்பாய நம:\n" +
          "ஓம் பரமேஷ்டநே நம:\n" +
          "ஓம் லோகேஸாய நம:\n" +
          "ஓம் பிதாமஹாய நம:\n" +
          "ஓம் வாணீவல்லபாய நம:\n" +
          "ஓம் பத்மஜாய நம:\n" +
          "ஓம் விரிஞ்சிநே நம:\n" +
          "\n" +
          "ஓம் தேவதேவாய நம:\n" +
          "ஓம் கமண்டலுதராய நம:\n" +
          "ஓம் கௌதமபூஜ்யாய நம:\n" +
          "ஓம் அக்ஷமாலாதராய நம:\n" +
          "ஓம் ஸ்ருஷ்டிகர்த்ரே நம:\n" +
          "ஓம் ஸுத்தவிக்ரஹாய நம:\n" +
          "ஓம் அனஸூயாவத்ஸலாய நம:\n" +
          "ஓம் வராஹஜனகாய நம:\n" +
          "ஓம் விபீஷணஸன்னுதாய நம:\n" +
          "ஓம் ஸத்யலோகநிவாஸினே நம:\n" +
          "\n" +
          "ஓம் அஹல்யா ஜன்மகர்த்ரே நம:\n" +
          "ஓம் வேததாரிணே நம:\n" +
          "ஓம் ராவணபூஜ்யாய நம:\n" +
          "ஓம் ஹரிப்ரியாய நம:\n" +
          "ஓம் ஹிரண்யவபுஷே நம:\n" +
          "ஓம் அத்ரிஸுதாய நம:\n" +
          "ஓம் ஸனகாதி ஸுபூஜ்யாய நம:\n" +
          "ஓம் பாஞ்சராத்ரவிதாயினே நம:\n" +
          "ஓம் தேவேந்த்ர பூஜ்யாய நம:\n" +
          "ஓம் லோபாமுத்ரார்சிதாய நம:\n" +
          "\n" +
          "ஓம் நாராயணாத்மபூதாய  நம:\n" +
          "ஓம் ராமதர்ஸனதாயினே நம:\n" +
          "ஓம் ஸ்வயம்புவே நம:\n" +
          "ஓம் ரவிமண்டல லவர்தினே நம:\n" +
          "ஓம் ஹம்ஸாவாஹாதிரூடாய நம:\n" +
          "ஓம் ஹமாசலநிவாஸினே நம:\n" +
          "ஓம் திலோத்தமா ஜன்மகர்த்ரே நம:\n" +
          "ஓம் ஸாரபூதாய நம:\n" +
          "ஓம் ஸஹ்யாத்ரிவாஸாயா நம:\n" +
          "ஓம் காவேரீ ஜனகாய நம:\n" +
          "\n" +
          "ஓம் தாத்ரே நம:\n" +
          "ஓம் விதாத்ரே நம:\n" +
          "ஓம் வால்மீக்யானந்த தாய நம:\n" +
          "ஓம் ஆத்மபுவே நம:\n" +
          "ஓம் ப்ரஹ்மாஸ்த்ரதாரிணே நம:\n" +
          "ஓம் த்ரயீமூர்தயே நம:\n" +
          "\n" +
          "ஓம் ஸிதிகண்டஸகாய நம:\n" +
          "ஓம் தாமோதரப்ரீதிகர்த்ரே நம:\n" +
          "ஓம் விஷ்ணுபக்தாய நம:\n" +
          "ஓம் பகீரதஸுபூஜ்யாய நம:\n" +
          "\n" +
          "ஓம் கவேர முக்திதாயினே நம:\n" +
          "ஓம் நாரதா திஸுபூஜ்யாய நம:\n" +
          "ஓம் ஸ்ரீரமாஸூனவே நம:\n" +
          "ஓம் பார்தப்ரஹ்மாஸ்த்ரதாத்ரே நம:\n" +
          "ஓம் விஸுத்தமானஸாய நம:\n" +
          "ஓம் பத்மாஸனஸ்தாய நம:\n" +
          "ஓம் சதுர்ஹஸ்தாய நம:\n" +
          "ஓம் த்ரைலோக்யநாதாய நம:\n" +
          "ஓம் ஸிவவிஷ்ணு ப்ரியாய நம:\n" +
          "ஓம் ஸாத்விகாய நம:\n" +
          "\n" +
          "ஓம் ப்ரஹ்மஸூத்ரோஜ்வலாய நம:\n" +
          "ஓம் ஸாதுமித்ராய நம:\n" +
          "ஓம் காலரூபாய நம:\n" +
          "ஓம் தக்ஷப்ராணதாத்ரே நம:\n" +
          "ஓம் ஸர்வஸ்ருஷ்டிகராய நம:\n" +
          "ஓம் நாரதபித்ரே நம:\n" +
          "ஓம் வராபயகராய நம:\n" +
          "ஓம் கலாகாஷ்டாஸ்வரூபாய நம:\n" +
          "ஓம் வீணாகானப்ரியாய நம:\n" +
          "ஓம் விஸ்வவந்த்யாய நம:\n" +
          "\n" +
          "ஓம் வித்யாதீஸாய நம:\n" +
          "ஓம் ஸதாதும்புரு ஸேவ்யாய நம:\n" +
          "ஓம் ஸந்துஷ்டமனஸே நம:\n" +
          "ஓம் விஸ்வாமித்ர ஸுபூஜ்யாய நம:\n" +
          "ஓம் ஜகன்னாதாய நம:\n" +
          "ஓம் ப்ரஹ்மர்ஷி ஜனவந்த்யாய நம:\n" +
          "ஓம் சதுர்வக்த்ராய நம:\n" +
          "ஓம் ஸ்ரீகந்தர்பதநூநாஸகாரணாய நம:\n" +
          "ஓம் கோடிஸூர்யப்ரகாஸாய நம:\n" +
          "ஓம் நாதரூபாய நம:\n" +
          "\n" +
          "ஓம் ரவிவம்ஸ ஸூபூஜ்யாய நம:\n" +
          "ஓம் அகஸ்த்ய ஸன்னுதாய நம:\n" +
          "ஓம் ரத்னபூஷண தேஹாய நம:\n" +
          "ஓம் திவ்யாம்பரதராய நம:\n" +
          "ஓம் ஸிஹ்மாஸனஸ்தாய நம:\n" +
          "ஓம் ரத்னாகரநுதாய நம:\n" +
          "ஓம் பக்தாபீஷ்டப்ரதாத்ரே நம:\n" +
          "ஓம் ரங்க த்யானபராய நம:\n" +
          "ஓம் லோகபூஜ்யாய நம:\n" +
          "ஓம் அம்புஜாக்ஷப்ரியாய நம:\n" +
          "\n" +
          "ஓம் ஸர்வஜனானந்தகராய நம:\n" +
          "ஓம் ப்ரபவே நம:\n" +
          "ஓம் திவ்யதேஹாய நம:\n" +
          "ஓம் ஸர்வாபீஷ்டப்ரதாய நம:\n" +
          "ஓம் ஸுரவந்த்யாய நம:\n" +
          "ஓம் ரக்தவர்ணாய நம:\n" +
          "ஓம் ஸத்யஸ்வரூபாய நம:\n" +
          "ஓம் ஸத்யவாசே நம:\n" +
          "ஓம் ஓங்காரரூபாய நம:\n" +
          "ஓம் வேத ஸ்வரூபிணே நம:\n" +
          "\n" +
          "ஓம் ஸகுணரூபாய நம:\n" +
          "ஓம் ஸத்யமூர்தயே நம:\n" +
          "ஓம் ஸச்சிதானந்தரூபாய நம:\n" +
          "ஓம் ஆத்மாராமஸ்வரூபிணே நம:\n" +
          "ஓம் லக்ஷ்யார்த பத ரூபாய நம:\n" +
          "ஓம் ஆதிமத்யாந்தரூபிணே நம:\n" +
          "ஓம் தத்வஸ்வரூபாய நம:\n" +
          "ஓம் த்ரிமாத்ரார்த ஸ்வரூபிணே நம:\n" +
          "ஓம் ஹம்ஸஸ்வரூபாய நம:\n" +
          "ஓம் அஜபாமந்த்ர ரூபிணே நம:\n"),
  'sarashwathi': Ashtothram(
      'ஸ்ரீ ஸரஸ்வதி',
      'sarashwathi',
      "ஓம் ஶ்ரீ ஸரஸ்வத்யை நம:\n" +
          "ஓம் மஹாப4த்3ராயை நம:\n" +
          "ஓம் மஹாமாயாயை நம:\n" +
          "ஓம் வரப்ரதா3யை நம:\n" +
          "ஓம் ஶ்ரீப்ரதா3யை நம:\n" +
          "ஓம் பத்3மனிலயாயை நம:\n" +
          "ஓம் பத்3மாக்ஷ்யை நம:\n" +
          "ஓம் பத்3மவக்த்ரிகாயை நம:\n" +
          "ஓம் ஶிவானுஜாயை நம:\n" +
          "ஓம் புஸ்தகஹஸ்தாயை நம: (1௦)\n" +
          "\n" +
          "ஓம் ஜ்ஞானமுத்3ராயை நம:\n" +
          "ஓம் ரமாயை நம:\n" +
          "ஓம் காமரூபாயை நம:\n" +
          "ஓம் மஹாவித்3யாயை நம:\n" +
          "ஓம் மஹாபாதக நாஶின்யை நம:\n" +
          "ஓம் மஹாஶ்ரயாயை நம:\n" +
          "ஓம் மாலின்யை நம:\n" +
          "ஓம் மஹாபோ4கா3யை நம:\n" +
          "ஓம் மஹாபு4ஜாயை நம:\n" +
          "ஓம் மஹாபா4கா3யை நம: (2௦)\n" +
          "\n" +
          "ஓம் மஹோத்ஸாஹாயை நம:\n" +
          "ஓம் தி3வ்யாங்கா3யை நம:\n" +
          "ஓம் ஸுரவன்தி3தாயை நம:\n" +
          "ஓம் மஹாகால்த்3யை நம:\n" +
          "ஓம் மஹாபாஶாயை நம:\n" +
          "ஓம் மஹாகாராயை நம:\n" +
          "ஓம் மஹாங்குஶாயை நம:\n" +
          "ஓம் ஸீதாயை நம:\n" +
          "ஓம் விமலாயை நம:\n" +
          "ஓம் விஶ்வாயை நம: (3௦)\n" +
          "\n" +
          "ஓம் வித்3யுன்மாலாயை நம:\n" +
          "ஓம் வைஷ்ணவ்யை நம:\n" +
          "ஓம் சன்த்3ரிகாயை நம:\n" +
          "ஓம் சன்த்3ரலேகா2விபூ4ஷிதாயை நம:\n" +
          "ஓம் மஹாப2லாயை நம:\n" +
          "ஓம் ஸாவித்ர்யை நம:\n" +
          "ஓம் ஸுரஸாயை நம:\n" +
          "ஓம் தே3வ்யை நம:\n" +
          "ஓம் தி3வ்யாலங்கார பூ4ஷிதாயை நம:\n" +
          "ஓம் வாக்3தே3வ்யை நம: (4௦)\n" +
          "\n" +
          "ஓம் வஸுதா4யை நம:\n" +
          "ஓம் தீவ்ராயை நம:\n" +
          "ஓம் மஹாப4த்3ராயை நம:\n" +
          "ஓம் மஹாப3லாயை நம:\n" +
          "ஓம் போ4க3தா3யை நம:\n" +
          "ஓம் பா4ரத்யை நம:\n" +
          "ஓம் பா4மாயை நம:\n" +
          "ஓம் கோ3மத்யை நம:\n" +
          "ஓம் ஜடிலாயை நம:\n" +
          "ஓம் வின்த்4யாவாஸாயை நம: (5௦)\n" +
          "\n" +
          "ஓம் சண்டி3காயை நம:\n" +
          "ஓம் ஸுப4த்3ராயை நம:\n" +
          "ஓம் ஸுரபூஜிதாயை நம:\n" +
          "ஓம் வினித்3ராயை நம:\n" +
          "ஓம் வைஷ்ணவ்யை நம:\n" +
          "ஓம் ப்3ராஹ்ம்யை நம:\n" +
          "ஓம் ப்3ரஹ்மஜ்ஞானைகஸாத4னாயை நம:\n" +
          "ஓம் ஸௌதா3மின்யை நம:\n" +
          "ஓம் ஸுதா4மூர்தயே நம:\n" +
          "ஓம் ஸுவீணாயை நம: (6௦)\n" +
          "\n" +
          "ஓம் ஸுவாஸின்யை நம:\n" +
          "ஓம் வித்3யாரூபாயை நம:\n" +
          "ஓம் ப்3ரஹ்மஜாயாயை நம:\n" +
          "ஓம் விஶாலாயை நம:\n" +
          "ஓம் பத்3மலோசனாயை நம:\n" +
          "ஓம் ஶும்பா4ஸுர ப்ரமதி2ன்யை நம:\n" +
          "ஓம் தூ4ம்ரலோசன மர்தி3ன்யை நம:\n" +
          "ஓம் ஸர்வாத்மிகாயை நம:\n" +
          "ஓம் த்ரயீமூர்த்யை நம:\n" +
          "ஓம் ஶுப4தா3யை நம: (7௦)\n" +
          "\n" +
          "ஓம் ஶாஸ்த்ரரூபிண்யை நம:\n" +
          "ஓம் ஸர்வதே3வஸ்துதாயை நம:\n" +
          "ஓம் ஸௌம்யாயை நம:\n" +
          "ஓம் ஸுராஸுர நமஸ்க்ருதாயை நம:\n" +
          "ஓம் ரக்தபீ3ஜ நிஹன்த்ர்யை நம:\n" +
          "ஓம் சாமுண்டா3யை நம:\n" +
          "ஓம் முண்ட3காம்பி3காயை நம:\n" +
          "ஓம் கால்த3ராத்ர்யை நம:\n" +
          "ஓம் ப்ரஹரணாயை நம:\n" +
          "ஓம் கல்தா3தா4ராயை நம: (8௦)\n" +
          "\n" +
          "ஓம் நிரஞ்ஜனாயை நம:\n" +
          "ஓம் வராரோஹாயை நம:\n" +
          "ஓம் வாக்3தே3வ்யை நம:\n" +
          "ஓம் வாராஹ்யை நம:\n" +
          "ஓம் வாரிஜாஸனாயை நம:\n" +
          "ஓம் சித்ராம்ப3ராயை நம:\n" +
          "ஓம் சித்ரக3ன்தா4யை நம:\n" +
          "ஓம் சித்ரமால்ய விபூ4ஷிதாயை நம:\n" +
          "ஓம் கான்தாயை நம:\n" +
          "ஓம் காமப்ரதா3யை நம: (9௦)\n" +
          "\n" +
          "ஓம் வன்த்3யாயை நம:\n" +
          "ஓம் ரூபஸௌபா4க்3யதா3யின்யை நம:\n" +
          "ஓம் ஶ்வேதானநாயை நம:\n" +
          "ஓம் ரக்த மத்4யாயை நம:\n" +
          "ஓம் த்3விபு4ஜாயை நம:\n" +
          "ஓம் ஸுரபூஜிதாயை நம:\n" +
          "ஓம் நிரஞ்ஜனாயை நம:\n" +
          "ஓம் நீலஜங்கா4யை நம:\n" +
          "ஓம் சதுர்வர்க3ப2லப்ரதா3யை நம:\n" +
          "ஓம் சதுரானந ஸாம்ராஜ்ஜ்யை நம: (1௦௦)\n" +
          "\n" +
          "ஓம் ப்3ரஹ்மவிஷ்ணு ஶிவாத்மிகாயை நம:\n" +
          "ஓம் ஹம்ஸாஸனாயை நம:\n" +
          "ஓம் மஹாவித்3யாயை நம:\n" +
          "ஓம் மன்த்ரவித்3யாயை நம:\n" +
          "ஓம் ஸரஸ்வத்யை நம:\n" +
          "ஓம் மஹாஸரஸ்வத்யை நம:\n" +
          "ஓம் வித்3யாயை நம:\n" +
          "ஓம் ஜ்ஞானைகதத்பராயை நம: (1௦8)\n"),
  'gayathri': Ashtothram(
      'ஸ்ரீ காயத்ரி',
      'gayathri',
      "ஓம் தருணாதி3த்ய ஸங்காஶாயை நம:\n" +
          "ஓம் ஸஹஸ்ர நயனோஜ்ஜ்வலாயை நம:\n" +
          "ஓம் விசித்ர மால்யாப4ரணாயை நம: \n" +
          "ஓம் துஹினாசல வாஸின்யை நம:\n" +
          "ஓம் வரதா3ப4ய ஹஸ்தாப்3ஜாயை நம:\n" +
          "ஓம் ரேவாதீர நிவாஸின்யை நம:\n" +
          "ஓம் ப்ரணித்யய விஶேஷஜ்ஞாயை நம:\n" +
          "ஓம் யன்த்ராக்ருத விராஜிதாயை நம:\n" +
          "ஓம் ப4த்3ரபாத3ப்ரியாயை நம:\n" +
          "ஓம் கோ3வின்த3 பத3கா3மின்யை நம: (1௦)\n" +
          "\n" +
          "ஓம் தே3வர்ஷிக3ண ஸம்ஸ்துத்யாயை நம:\n" +
          "ஓம் வனமாலா விபூ4ஷிதாயை நம:\n" +
          "ஓம் ஸ்யன்த3னோத்தம ஸம்ஸ்தா2னாயை நம:\n" +
          "ஓம் தீ4ரஜீமூத நிஸ்வனாயை நம:\n" +
          "ஓம் மத்தமாதங்க3 க3மனாயை நம:\n" +
          "ஓம் ஹிரண்யகமலாஸனாயை நம:\n" +
          "ஓம் தீ4ஜனாதா4ர நிரதாயை நம: \n" +
          "ஓம் யோகி3ன்யை நம:\n" +
          "ஓம் யோக3தா4ரிண்யை நம:\n" +
          "ஓம் நடனாட்யைக நிரதாயை நம: (2௦)\n" +
          "\n" +
          "ஓம் ப்ரணவாத்3யக்ஷராத்மிகாயை நம:\n" +
          "ஓம் சோரசாரக்ரியாஸக்தாயை நம:\n" +
          "ஓம் தா3ரித்3ர்யச்சே2த3காரிண்யை நம:\n" +
          "ஓம் யாத3வேன்த்3ர குலோத்3பூ4தாயை நம:\n" +
          "ஓம் துரீயபத2கா3மின்யை நம:\n" +
          "ஓம் கா3யத்ர்யை நம:\n" +
          "ஓம் கோ3மத்யை நம:\n" +
          "ஓம் க3ங்கா3யை நம:\n" +
          "ஓம் கௌ3தம்யை நம:\n" +
          "ஓம் க3ருடா3ஸனாயை நம: (3௦)\n" +
          "\n" +
          "ஓம் கே3யகா3னப்ரியாயை நம:\n" +
          "ஓம் கௌ3ர்யை நம:\n" +
          "ஓம் கோ3வின்த3பத3 பூஜிதாயை நம:\n" +
          "ஓம் க3ன்த4ர்வ நக3ராகாராயை நம:\n" +
          "ஓம் கௌ3ரவர்ணாயை நம:\n" +
          "ஓம் க3ணேஶ்வர்யை நம:\n" +
          "ஓம் க3தா3ஶ்ரயாயை நம:\n" +
          "ஓம் கு3ணவத்யை நம:\n" +
          "ஓம் க3ஹ்வர்யை நம:\n" +
          "ஓம் க3ணபூஜிதாயை நம: (4௦)\n" +
          "\n" +
          "ஓம் கு3ணத்ரய ஸமாயுக்தாயை நம:\n" +
          "ஓம் கு3ணத்ரய விவர்ஜிதாயை நம:\n" +
          "ஓம் கு3ஹாவாஸாயை நம:\n" +
          "ஓம் கு3ணாதா4ராயை நம:\n" +
          "ஓம் கு3ஹ்யாயை நம:\n" +
          "ஓம் க3ன்த4ர்வரூபிண்யை நம:\n" +
          "ஓம் கா3ர்க்3ய ப்ரியாயை நம:\n" +
          "ஓம் கு3ருபதா3யை நம:\n" +
          "ஓம் கு3ஹ்யலிங்கா3ங்க3 தா4ரின்யை நம:\n" +
          "ஓம் ஸாவித்ர்யை நம: (5௦)\n" +
          "\n" +
          "ஓம் ஸூர்யதனயாயை நம:\n" +
          "ஓம் ஸுஷும்னா நாடி3பே4தி3ன்யை நம: \n" +
          "ஓம் ஸுப்ரகாஶாயை நம:\n" +
          "ஓம் ஸுகா2ஸீனாயை நம:\n" +
          "ஓம் ஸுமத்யை நம:\n" +
          "ஓம் ஸுரபூஜிதாயை நம:\n" +
          "ஓம் ஸுஷுப்த்யவஸ்தா2யை நம:\n" +
          "ஓம் ஸுத3த்யை நம:\n" +
          "ஓம் ஸுன்த3ர்யை நம:\n" +
          "ஓம் ஸாக3ராம்ப3ராயை நம: (6௦)\n" +
          "\n" +
          "ஓம் ஸுதா4ம்ஶு பி3ம்ப3வத3னாயை நம:\n" +
          "ஓம் ஸுஸ்தன்யை நம:\n" +
          "ஓம் ஸுவிலோசனாயை நம:\n" +
          "ஓம் ஸீதாயை நம:\n" +
          "ஓம் ஸர்வாஶ்ரயாயை நம:\n" +
          "ஓம் ஸன்த்4யாயை நம:\n" +
          "ஓம் ஸுப2லாயை நம:\n" +
          "ஓம் ஸுக2தா3யின்யை நம:\n" +
          "ஓம் ஸுப்4ருவே நம:\n" +
          "ஓம் ஸுனாஸாயை நம: (7௦)\n" +
          "\n" +
          "ஓம் ஸுஶ்ரோண்யை நம:\n" +
          "ஓம் ஸம்ஸாரார்ணவதாரிண்யை நம:\n" +
          "ஓம் ஸாமகா3ன ப்ரியாயை நம:\n" +
          "ஓம் ஸாத்4வ்யை நம:\n" +
          "ஓம் ஸர்வாப4ரண பூஜிதாயை நம:\n" +
          "ஓம் வைஷ்ணவ்யை நம:\n" +
          "ஓம் விமலாகாராயை நம:\n" +
          "ஓம் மஹேன்த்3ர்யை நம:\n" +
          "ஓம் மன்த்ரரூபிண்யை நம:\n" +
          "ஓம் மஹாலக்ஷ்ம்யை நம: (8௦)\n" +
          "\n" +
          "ஓம் மஹாஸித்3த்4யை நம:\n" +
          "ஓம் மஹாமாயாயை நம:\n" +
          "ஓம் மஹேஶ்வர்யை நம:\n" +
          "ஓம் மோஹின்யை நம:\n" +
          "ஓம் மது4ஸூத3ன சோதி3தாயை நம:\n" +
          "ஓம் மீனாக்ஷ்யை நம:\n" +
          "ஓம் மது4ராவாஸாயை நம:\n" +
          "ஓம் நகே3ன்த்3ர தனயாயை நம:\n" +
          "ஓம் உமாயை நம:\n" +
          "ஓம் த்ரிவிக்ரம பதா3க்ரான்தாயை நம: (9௦)\n" +
          "\n" +
          "ஓம் த்ரிஸ்வராயை நம:\n" +
          "ஓம் த்ரிலோசனாயை நம:\n" +
          "ஓம் ஸூர்யமண்ட3ல மத்4யஸ்தா2யை நம:\n" +
          "ஓம் சன்த்3ரமண்ட3ல ஸம்ஸ்தி2தாயை நம:\n" +
          "ஓம் வஹ்னிமண்ட3ல மத்4யஸ்தா2யை நம:\n" +
          "ஓம் வாயுமண்ட3ல ஸம்ஸ்தி2தாயை நம:\n" +
          "ஓம் வ்யோமமண்ட3ல மத்4யஸ்தா2யை நம:\n" +
          "ஓம் சக்ரிண்யை நம:\n" +
          "ஓம் சக்ரரூபிண்யை நம:\n" +
          "ஓம் காலசக்ர விதானஸ்தா2யை நம: (1௦௦)\n" +
          "\n" +
          "ஓம் சன்த்3ரமண்ட3ல த3ர்பணாயை நம:\n" +
          "ஓம் ஜ்யோத்ஸ்னாதபானுலிப்தாங்க்3யை நம:\n" +
          "ஓம் மஹாமாருத வீஜிதாயை நம:\n" +
          "ஓம் ஸர்வமன்த்ராஶ்ரயாயை நம:\n" +
          "ஓம் தே4னவே நம: \n" +
          "ஓம் பாபக்4ன்யை நம:\n" +
          "ஓம் பரமேஶ்வர்யை நம: (1௦8)\n"),
  'sivan': Ashtothram(
      'ஸ்ரீ ஶிவன்',
      'sivan',
      "ஓஂ ஶிவாய நம:\n" +
          "ஓஂ மஹேஶ்வராய நம:\n" +
          "ஓஂ ஶம்ப⁴வே நம:\n" +
          "ஓஂ பினாகினே நம:\n" +
          "ஓஂ ஶஶிஶேக²ராய நம:\n" +
          "ஓஂ வாமதே³வாய நம:\n" +
          "ஓஂ விரூபாக்ஷாய நம:\n" +
          "ஓஂ கபர்தி³னே நம:\n" +
          "ஓஂ நீலலோஹிதாய நம:\n" +
          "ஓஂ ஶங்கராய நம: (1௦)\n" +
          "\n" +
          "ஓஂ ஶூலபாணயே நம:\n" +
          "ஓம் க²ட்வாங்கி³னே நம:\n" +
          "ஓஂ விஷ்ணுவல்லபா⁴ய நம:\n" +
          "ஓஂ ஶிபிவிஷ்டாய நம:\n" +
          "ஓஂ அம்பி³கானாதா²ய நம:\n" +
          "ஓஂ ஶ்ரீகண்டா²ய நம:\n" +
          "ஓம் ப⁴க்தவத்ஸலாய நம:\n" +
          "ஓம் ப⁴வாய நம:\n" +
          "ஓஂ ஶர்வாய நம:\n" +
          "ஓஂ த்ரிலோகேஶாய நம: (2௦)\n" +
          "\n" +
          "ஓஂ ஶிதிகண்டா²ய நம:\n" +
          "ஓஂ ஶிவாப்ரியாய நம:\n" +
          "ஓஂ உக்³ராய நம:\n" +
          "ஓஂ கபாலினே நம:\n" +
          "ஓஂ காமாரயே நம:\n" +
          "ஓஂ அன்த⁴காஸுர ஸூத³னாய நம:\n" +
          "ஓம் க³ங்கா³த⁴ராய நம:\n" +
          "ஓஂ லலாடாக்ஷாய நம:\n" +
          "ஓஂ காலகாலாய நம:\n" +
          "ஓஂ க்ருபானித⁴யே நம: (3௦)\n" +
          "\n" +
          "ஓம் பீ⁴மாய நம:\n" +
          "ஓஂ பரஶுஹஸ்தாய நம:\n" +
          "ஓஂ ம்ருக³பாணயே நம:\n" +
          "ஓஂ ஜடாத⁴ராய நம:\n" +
          "ஓஂ கைலாஸவாஸினே நம:\n" +
          "ஓஂ கவசினே நம:\n" +
          "ஓஂ கடோ²ராய நம:\n" +
          "ஓஂ த்ரிபுரான்தகாய நம:\n" +
          "ஓஂ வ்ருஷாங்காய நம:\n" +
          "ஓஂ வ்ருஷபா⁴ரூடா⁴ய நம: (4௦)\n" +
          "\n" +
          "ஓம் ப⁴ஸ்மோத்³தூ⁴ல்தி³த விக்³ரஹாய நம:\n" +
          "ஓஂ ஸாமப்ரியாய நம:\n" +
          "ஓஂ ஸ்வரமயாய நம:\n" +
          "ஓஂ த்ரயீமூர்தயே நம:\n" +
          "ஓஂ அனீஶ்வராய நம:\n" +
          "ஓஂ ஸர்வஜ்ஞாய நம:\n" +
          "ஓஂ பரமாத்மனே நம:\n" +
          "ஓஂ ஸோமஸூர்யாக்³னி லோசனாய நம:\n" +
          "ஓஂ ஹவிஷே நம:\n" +
          "ஓஂ யஜ்ஞமயாய நம: (5௦)\n" +
          "\n" +
          "ஓஂ ஸோமாய நம:\n" +
          "ஓஂ பஞ்சவக்த்ராய நம:\n" +
          "ஓஂ ஸதா³ஶிவாய நம:\n" +
          "ஓஂ விஶ்வேஶ்வராய நம:\n" +
          "ஓஂ வீரப⁴த்³ராய நம:\n" +
          "ஓம் க³ணனாதா²ய நம:\n" +
          "ஓஂ ப்ரஜாபதயே நம:\n" +
          "ஓஂ ஹிரண்யரேதஸே நம:\n" +
          "ஓம் து³ர்த⁴ர்ஷாய நம:\n" +
          "ஓம் கி³ரீஶாய நம: (6௦)\n" +
          "\n" +
          "ஓம் கி³ரிஶாய நம:\n" +
          "ஓஂ அனகா⁴ய நம:\n" +
          "ஓம் பு⁴ஜங்க³ பூ⁴ஷணாய நம:\n" +
          "ஓம் ப⁴ர்கா³ய நம:\n" +
          "ஓம் கி³ரித⁴ன்வனே நம:\n" +
          "ஓம் கி³ரிப்ரியாய நம:\n" +
          "ஓஂ க்ருத்திவாஸஸே நம:\n" +
          "ஓஂ புராராதயே நம:\n" +
          "ஓம் ப⁴க³வதே நம:\n" +
          "ஓஂ ப்ரமதா²தி⁴பாய நம: (7௦)\n" +
          "\n" +
          "ஓஂ ம்ருத்யுஞ்ஜயாய நம:\n" +
          "ஓஂ ஸூக்ஷ்மதனவே நம:\n" +
          "ஓஂ ஜக³த்³வ்யாபினே நம:\n" +
          "ஓஂ ஜக³த்³கு³ரவே நம:\n" +
          "ஓஂ வ்யோமகேஶாய நம:\n" +
          "ஓஂ மஹாஸேன ஜனகாய நம:\n" +
          "ஓஂ சாருவிக்ரமாய நம:\n" +
          "ஓஂ ருத்³ராய நம:\n" +
          "ஓம் பூ⁴தபதயே நம:\n" +
          "ஓஂ ஸ்தா²ணவே நம: (8௦)\n" +
          "\n" +
          "ஓஂ அஹிர்பு³த்⁴ன்யாய நம:\n" +
          "ஓம் தி³க³ம்ப³ராய நம:\n" +
          "ஓஂ அஷ்டமூர்தயே நம:\n" +
          "ஓஂ அனேகாத்மனே நம:\n" +
          "ஓஂ ஸ்வாத்த்விகாய நம:\n" +
          "ஓஂ ஶுத்³த⁴விக்³ரஹாய நம:\n" +
          "ஓஂ ஶாஶ்வதாய நம:\n" +
          "ஓம் க²ண்ட³பரஶவே நம:\n" +
          "ஓஂ அஜாய நம:\n" +
          "ஓஂ பாஶவிமோசகாய நம: (9௦)\n" +
          "\n" +
          "ஓஂ ம்ருடா³ய நம:\n" +
          "ஓஂ பஶுபதயே நம:\n" +
          "ஓம் தே³வாய நம:\n" +
          "ஓஂ மஹாதே³வாய நம:\n" +
          "ஓஂ அவ்யயாய நம:\n" +
          "ஓஂ ஹரயே நம:\n" +
          "ஓஂ பூஷத³ன்தபி⁴தே³ நம:\n" +
          "ஓஂ அவ்யக்³ராய நம:\n" +
          "ஓம் த³க்ஷாத்⁴வரஹராய நம:\n" +
          "ஓஂ ஹராய நம: (1௦௦)\n" +
          "\n" +
          "ஓம் ப⁴க³னேத்ரபி⁴தே³ நம:\n" +
          "ஓஂ அவ்யக்தாய நம:\n" +
          "ஓஂ ஸஹஸ்ராக்ஷாய நம:\n" +
          "ஓஂ ஸஹஸ்ரபாதே³ நம:\n" +
          "ஓஂ அபவர்க³ப்ரதா³ய நம:\n" +
          "ஓஂ அனந்தாய நம:\n" +
          "ஓஂ தாரகாய நம:\n" +
          "ஓஂ பரமேஶ்வராய நம: (1௦8)\n"),
  'gowri': Ashtothram(
      'ஸ்ரீ கௌரி',
      'gowri',
      "ஓம் மஹாமநோந்மணீஶக்த்யை நம: ।\n" +
          "ஓம் ஶிவஶக்த்யை நம: ।\n" +
          "ஓம் ஶிவங்கர்யை நம: ।\n" +
          "ஓம் இச்சா²ஶக்தி க்ரியாஶக்தி ஜ்ஞாநஶக்தி ஸ்வரூபிண்யை நம: ।\n" +
          "ஓம் ஶாந்த்யதீத கலாநந்தா³யை நம: ।\n" +
          "ஓம் ஶிவமாயாயை நம: ।\n" +
          "ஓம் ஶிவப்ரியாயை நம: ।\n" +
          "ஓம் ஸர்வஜ்ஞாயை நம: ।\n" +
          "ஓம் ஸுந்த³ர்யை நம: ।\n" +
          "ஓம் ஸௌம்யாயை நம: । 10 ।\n" +
          "\n" +
          "ஓம் ஸச்சிதா³நந்த³ரூபிண்யை நம: ।\n" +
          "ஓம் பராபராமய்யை நம: ।\n" +
          "ஓம் பா³லாயை நம: ।\n" +
          "ஓம் த்ரிபுராயை நம: ।\n" +
          "ஓம் குண்ட³ல்யை நம: ।\n" +
          "ஓம் ஶிவாயை நம: ।\n" +
          "ஓம் ருத்³ராண்யை நம: ।\n" +
          "ஓம் விஜயாயை நம: ।\n" +
          "ஓம் ஸர்வாயை நம: ।\n" +
          "ஓம் ஶர்வாண்யை நம: । 20 ।\n" +
          "\n" +
          "ஓம் பு⁴வநேஶ்வர்யை நம: ।\n" +
          "ஓம் கல்யாண்யை நம: ।\n" +
          "ஓம் ஶூலிந்யை நம: ।\n" +
          "ஓம் காந்தாயை நம: ।\n" +
          "ஓம் மஹாத்ரிபுரஸுந்த³ர்யை நம: ।\n" +
          "ஓம் மாலிந்யை நம: ।\n" +
          "ஓம் மாநிந்யை நம: ।\n" +
          "ஓம் மத³நோல்லாஸ மோஹிந்யை நம: ।\n" +
          "ஓம் மஹேஶ்வர்யை நம: ।\n" +
          "ஓம் மாதங்க்³யை நம: । 30 ।\n" +
          "\n" +
          "ஓம் ஶிவகாம்யை நம: ।\n" +
          "ஓம் சிதா³த்மிகாயை நம: ।\n" +
          "ஓம் காமாக்ஷ்யை நம: ।\n" +
          "ஓம் கமலாக்ஷ்யை நம: ।\n" +
          "ஓம் மீநாக்ஷ்யை நம: ।\n" +
          "ஓம் ஸர்வஸாக்ஷிண்யை நம: ।\n" +
          "ஓம் உமாதே³வ்யை நம: ।\n" +
          "ஓம் மஹாகால்யை நம: ।\n" +
          "ஓம் ஸாமாயை நம: ।\n" +
          "ஓம் ஸர்வஜநப்ரியாயை நம: । 40 ।\n" +
          "\n" +
          "ஓம் சித்புராயை நம: ।\n" +
          "ஓம் சித்³க⁴நாநந்தா³யை நம: ।\n" +
          "ஓம் சிந்மய்யை நம: ।\n" +
          "ஓம் சித்ஸ்வரூபிண்யை நம: ।\n" +
          "ஓம் மஹாஸரஸ்வத்யை நம: ।\n" +
          "ஓம் து³ர்கா³யை நம: ।\n" +
          "ஓம் ஜ்வாலாது³ர்கா³தி³மோஹிந்யை நம: ।\n" +
          "ஓம் நகுல்யை நம: ।\n" +
          "ஓம் ஶுத்³த⁴வித்³யாயை நம: ।\n" +
          "ஓம் ஸச்சிதா³நந்த³விக்³ரஹாயை நம: । 50 ।\n" +
          "\n" +
          "ஓம் ஸுப்ரபா⁴யை நம: ।\n" +
          "ஓம் ஸுப்ரபா⁴ஜ்வாலாயை நம: ।\n" +
          "ஓம் இந்த்³ராக்ஷ்யை நம: ।\n" +
          "ஓம் ஸர்வமோஹிந்யை நம: ।\n" +
          "ஓம் மஹேந்த்³ரஜாலமத்⁴யஸ்தா²யை நம: ।\n" +
          "ஓம் மாயாயை நம: ।\n" +
          "ஓம் மாயாவிநோதி³ந்யை நம: ।\n" +
          "ஓம் விஶ்வேஶ்வர்யை நம: ।\n" +
          "ஓம் வ்ருʼஷாரூடா⁴யை நம: ।\n" +
          "ஓம் வித்³யாஜாலவிநோதி³ந்யை நம: । 60 ।\n" +
          "\n" +
          "ஓம் மந்த்ரேஶ்வர்யை நம: ।\n" +
          "ஓம் மஹாலக்ஷ்ம்யை நம: ।\n" +
          "ஓம் மஹாகாலீப²லப்ரதா³யை நம: ।\n" +
          "ஓம் சதுர்வேத³விஶேஷஜ்ஞாயை நம: ।\n" +
          "ஓம் ஸாவித்ர்யை நம: ।\n" +
          "ஓம் ஸர்வதே³வதாயை நம: ।\n" +
          "ஓம் மஹேந்த்³ராண்யை நம: ।\n" +
          "ஓம் க³ணாத்⁴யக்ஷாயை நம: ।\n" +
          "ஓம் மஹாபை⁴ரவபூஜிதாயை நம: ।\n" +
          "ஓம் மஹாமாயாயை நம: । 70 ।\n" +
          "\n" +
          "ஓம் மஹாகோ⁴ராயை நம: ।\n" +
          "ஓம் மஹாதே³வ்யை நம: ।\n" +
          "ஓம் மலாபஹாயை நம: ।\n" +
          "ஓம் மஹிஷாஸுரஸம்ஹார்யை நம: ।\n" +
          "ஓம் சண்ட³முண்ட³குலாந்தகாயை நம: ।\n" +
          "ஓம் சக்ரேஶ்வர்யை நம: ।\n" +
          "ஓம் சதுர்வேத்³யை நம: ।\n" +
          "ஓம் ஸர்வதா³யை நம: ।\n" +
          "ஓம் ஸுரநாயிக்யை நம: ।\n" +
          "ஓம் ஷட்ஶாஸ்த்ரநிபுணாயை நம: । 80 ।\n" +
          "\n" +
          "ஓம் நித்யாயை நம: ।\n" +
          "ஓம் ஷட்³த³ர்ஶநவிசக்ஷணாயை நம: ।\n" +
          "ஓம் காலராத்ர்யை நம: ।\n" +
          "ஓம் கலாதீதாயை நம: ।\n" +
          "ஓம் கவிராஜமநோஹராயை நம: ।\n" +
          "ஓம் ஶாரதா³திலகாகாராயை நம: ।\n" +
          "ஓம் தீ⁴ராயை நம: ।\n" +
          "ஓம் தீ⁴ரஜநப்ரியாயை நம: ।\n" +
          "ஓம் உக்³ரபா⁴ர்யை நம: ।\n" +
          "ஓம் மஹாபா⁴ர்யை நம: । 90 ।\n" +
          "\n" +
          "ஓம் க்ஷிப்ரமார்யை நம: ।\n" +
          "ஓம் ரணப்ரியாயை நம: ।\n" +
          "ஓம் அந்நபூர்ணேஶ்வர்யை நம: ।\n" +
          "ஓம் மாத்ரே நம: ।\n" +
          "ஓம் ஸ்வர்ணாகாரதடித்ப்ரபா⁴யை நம: ।\n" +
          "ஓம் ஸ்வரவ்யஞ்ஜநவர்ணோத³யாயை நம: ।\n" +
          "ஓம் க³த்³யபத்³யாதி³காரணாயை நம: ।\n" +
          "ஓம் பத³வாக்யார்த²நிலயாயை நம: ।\n" +
          "ஓம் பி³ந்து³நாதா³தி³காரணாயை நம: ।\n" +
          "ஓம் மோக்ஷேஶமஹிஷ்யை நம: । 100 ।\n" +
          "\n" +
          "ஓம் ஸத்யாயை நம: ।\n" +
          "ஓம் பு⁴க்திமுக்திப²லப்ரதா³யை நம: ।\n" +
          "ஓம் விஜ்ஞாநதா³யிந்யை நம: ।\n" +
          "ஓம் ப்ரஜ்ஞாயை நம: ।\n" +
          "ஓம் ப்ரஜ்ஞாநப²லதா³யிந்யை நம: ।\n" +
          "ஓம் அஹங்காரகலாதீதாயை நம: ।\n" +
          "ஓம் பராஶக்த்யை நம: ।\n" +
          "ஓம் பராத்பராயை நம: । 108 ।\n"),
  'vigneshwarar': Ashtothram(
      'ஸ்ரீ விக்னேஸ்வரன்',
      'vigneshwarar',
      "ஓம் வினாயகாய நம:\n" +
          "ஓம் விக்4னராஜாய நம:\n" +
          "ஓம் கௌ3ரீபுத்ராய நம:\n" +
          "ஓம் க3ணேஶ்வராய நம:\n" +
          "ஓம் ஸ்கன்தா3க்3ரஜாய நம:\n" +
          "ஓம் அவ்யயாய நம:\n" +
          "ஓம் பூதாய நம:\n" +
          "ஓம் த3க்ஷாய நம:\n" +
          "ஓம் அத்4யக்ஷாய நம:\n" +
          "ஓம் த்3விஜப்ரியாய நம: (1௦)\n" +
          "\n" +
          "ஓம் அக்3னிக3ர்ப4ச்சி2தே3 நம:\n" +
          "ஓம் இன்த்3ரஶ்ரீப்ரதா3ய நம:\n" +
          "ஓம் வாணீப்ரதா3ய நம:\n" +
          "ஓம் அவ்யயாய நம:\n" +
          "ஓம் ஸர்வஸித்3தி4ப்ரதா3ய நம:\n" +
          "ஓம் ஶர்வதனயாய நம:\n" +
          "ஓம் ஶர்வரீப்ரியாய நம:\n" +
          "ஓம் ஸர்வாத்மகாய நம:\n" +
          "ஓம் ஸ்ருஷ்டிகர்த்ரே நம:\n" +
          "ஓம் தே3வாய நம: (2௦)\n" +
          "\n" +
          "ஓம் அனேகார்சிதாய நம:\n" +
          "ஓம் ஶிவாய நம:\n" +
          "ஓம் ஶுத்3தா4ய நம:\n" +
          "ஓம் பு3த்3தி4ப்ரியாய நம:\n" +
          "ஓம் ஶான்தாய நம:\n" +
          "ஓம் ப்3ரஹ்மசாரிணே நம:\n" +
          "ஓம் கஜ3ானநாய நம:\n" +
          "ஓம் த்3வைமாத்ரேயாய நம:\n" +
          "ஓம் முனிஸ்துத்யாய நம:\n" +
          "ஓம் ப4க்தவிக்4னவினாஶனாய நம: (3௦)\n" +
          "\n" +
          "ஓம் ஏகத3ன்தாய நம:\n" +
          "ஓம் சதுர்பா3ஹவே நம:\n" +
          "ஓம் சதுராய நம:\n" +
          "ஓம் ஶக்திஸம்யுதாய நம:\n" +
          "ஓம் லம்போ3த3ராய நம:\n" +
          "ஓம் ஶூர்பகர்ணாய நம:\n" +
          "ஓம் ஹரயே நம:\n" +
          "ஓம் ப்3ரஹ்மவிது3த்தமாய நம:\n" +
          "ஓம் காலாய நம:\n" +
          "ஓம் க்3ரஹபதயே நம: (4௦)\n" +
          "\n" +
          "ஓம் காமினே நம:\n" +
          "ஓம் ஸோமஸூர்யாக்3னிலோசனாய நம:\n" +
          "ஓம் பாஶாங்குஶத4ராய நம:\n" +
          "ஓம் சண்டா3ய நம:\n" +
          "ஓம் கு3ணாதீதாய நம:\n" +
          "ஓம் நிரஞ்ஜனாய நம:\n" +
          "ஓம் அகல்மஷாய நம:\n" +
          "ஓம் ஸ்வயம்ஸித்3தா4ய நம:\n" +
          "ஓம் ஸித்3தா4ர்சிதபதா3ம்பு3ஜாய நம:\n" +
          "ஓம் பீ3ஜாபூரப2லாஸக்தாய நம: (5௦)\n" +
          "\n" +
          "ஓம் வரதா3ய நம:\n" +
          "ஓம் ஶாஶ்வதாய நம:\n" +
          "ஓம் க்ருதினே நம:\n" +
          "ஓம் வித்3வத் ப்ரியாய நம:\n" +
          "ஓம் வீதப4யாய நம:\n" +
          "ஓம் க3தி3னே நம:\n" +
          "ஓம் சக்ரிணே நம:\n" +
          "ஓம் இக்ஷுசாபத்4ருதே நம:\n" +
          "ஓம் ஶ்ரீதா3ய நம:\n" +
          "ஓம் அஜாய நம: (6௦)\n" +
          "\n" +
          "ஓம் உத்பலகராய நம:\n" +
          "ஓம் ஶ்ரீப்ரதயே நம:\n" +
          "ஓம் ஸ்துதிஹர்ஷிதாய நம:\n" +
          "ஓம் குலாத்3ரிபே4த்த்ரே நம:\n" +
          "ஓம் ஜடிலாய நம:\n" +
          "ஓம் கலிகல்மஷனாஶனாய நம:\n" +
          "ஓம் சன்த்3ரசூடா3மணயே நம:\n" +
          "ஓம் கான்தாய நம:\n" +
          "ஓம் பாபஹாரிணே நம:\n" +
          "ஓம் ஸமாஹிதாய நம: (7௦)\n" +
          "\n" +
          "ஓம் ஆஶ்ரிதாய நம:\n" +
          "ஓம் ஶ்ரீகராய நம:\n" +
          "ஓம் ஸௌம்யாய நம:\n" +
          "ஓம் ப4க்தவாஞ்சி2ததா3யகாய நம:\n" +
          "ஓம் ஶான்தாய நம:\n" +
          "ஓம் கைவல்யஸுக2தா3ய நம:\n" +
          "ஓம் ஸச்சிதா3னந்த3விக்3ரஹாய நம:\n" +
          "ஓம் ஜ்ஞானினே நம:\n" +
          "ஓம் த3யாயுதாய நம:\n" +
          "ஓம் தா3ன்தாய நம: (8௦)\n" +
          "\n" +
          "ஓம் ப்3ரஹ்மத்3வேஷவிவர்ஜிதாய நம:\n" +
          "ஓம் ப்ரமத்ததை3த்யப4யதாய நம:\n" +
          "ஓம் ஶ்ரீகண்டா2ய நம:\n" +
          "ஓம் விபு3தே4ஶ்வராய நம:\n" +
          "ஓம் ரமார்சிதாய நம:\n" +
          "ஓம் நித4யே நம:\n" +
          "ஓம் நாக3ராஜயஜ்ஞோபவீதவதே நம:\n" +
          "ஓம் ஸ்தூ2லகண்டா2ய நம:\n" +
          "ஓம் ஸ்வயங்கர்த்ரே நம:\n" +
          "ஓம் ஸாமகோ4ஷப்ரியாய நம: (9௦)\n" +
          "\n" +
          "ஓம் பரஸ்மை நம:\n" +
          "ஓம் ஸ்தூ2லதுண்டா3ய நம:\n" +
          "ஓம் அக்3ரண்யே நம:\n" +
          "ஓம் தீ4ராய நம:\n" +
          "ஓம் வாகீ3ஶாய நம:\n" +
          "ஓம் ஸித்3தி4தா3யகாய நம:\n" +
          "ஓம் தூ3ர்வாபி3ல்வப்ரியாய நம:\n" +
          "ஓம் அவ்யக்தமூர்தயே நம:\n" +
          "ஓம் அத்3பு4தமூர்திமதே நம:\n" +
          "ஓம் ஶைலேன்த்3ர தனுஜோத்ஸங்க3கே2லனோத்ஸுக மானஸாய நம: (1௦௦)\n" +
          "\n" +
          "ஓம் ஸ்வலாவண்யஸுதாஸாரஜிதமன்மத2விக்3ரஹாய நம:\n" +
          "ஓம் ஸமஸ்தஜக3தா3தா4ராய நம:\n" +
          "ஓம் மாயினே நம:\n" +
          "ஓம் மூஷிகவாஹனாய நம:\n" +
          "ஓம் ஹ்ருஷ்டாய நம:\n" +
          "ஓம் துஷ்டாய நம:\n" +
          "ஓம் ப்ரஸன்னாத்மனே நம:\n" +
          "ஓம் ஸர்வஸித்3தி4ப்ரதா3யகாய நம: (1௦8)\n"),
  'subramaniyan': Ashtothram(
      'ஸ்ரீ சுப்ரமண்யர்',
      'subramaniyan',
      "ஓம் ஸ்கன்தா3ய நம:\n" +
          "ஓம் கு3ஹாய நம:\n" +
          "ஓம் ஷண்முகா2ய நம:\n" +
          "ஓம் பா2லனேத்ரஸுதாய நம:\n" +
          "ஓம் ப்ரப4வே நம:\n" +
          "ஓம் பிங்க3ல்தா3ய நம:\n" +
          "ஓம் க்ருத்திகாஸூனவே நம:\n" +
          "ஓம் ஶிகி2வாஹாய நம:\n" +
          "ஓம் த்3விஷட்3பு4ஜாய நம: \n" +
          "ஓம் த்3விஷண்ணேத்ராய நம: (1௦)\n" +
          "\n" +
          "ஓம் ஶக்தித4ராய நம:\n" +
          "ஓம் பிஶிதாஶ ப்ரப4ஞ்ஜனாய நம:\n" +
          "ஓம் தாரகாஸுர ஸம்ஹாரிணே நம:\n" +
          "ஓம் ரக்ஷோப3லவிமர்த3னாய நம:\n" +
          "ஓம் மத்தாய நம:\n" +
          "ஓம் ப்ரமத்தாய நம:\n" +
          "ஓம் உன்மத்தாய நம:\n" +
          "ஓம் ஸுரஸைன்ய ஸுரக்ஷகாய நம:\n" +
          "ஓம் தே3வஸேனாபதயே நம:\n" +
          "ஓம் ப்ராஜ்ஞாய நம: (2௦)\n" +
          "\n" +
          "ஓம் க்ருபால்த3வே நம:\n" +
          "ஓம் ப4க்தவத்ஸலாய நம:\n" +
          "ஓம் உமாஸுதாய நம:\n" +
          "ஓம் ஶக்தித4ராய நம:\n" +
          "ஓம் குமாராய நம:\n" +
          "ஓம் க்ரௌஞ்சதா3ரணாய நம: \n" +
          "ஓம் ஸேனான்யே நம:\n" +
          "ஓம் அக்3னிஜன்மனே நம:\n" +
          "ஓம் விஶாகா2ய நம:\n" +
          "ஓம் ஶங்கராத்மஜாய நம: (3௦)\n" +
          "\n" +
          "ஓம் ஶிவஸ்வாமினே நம:\n" +
          "ஓம் க3ண ஸ்வாமினே நம:\n" +
          "ஓம் ஸர்வஸ்வாமினே நம:\n" +
          "ஓம் ஸனாதனாய நம:\n" +
          "ஓம் அனந்தஶக்தயே நம:\n" +
          "ஓம் அக்ஷோப்4யாய நம:\n" +
          "ஓம் பார்வதீப்ரியனந்த3னாய நம:\n" +
          "ஓம் க3ங்கா3ஸுதாய நம:\n" +
          "ஓம் ஶரோத்3பூ4தாய நம:\n" +
          "ஓம் ஆஹூதாய நம: (4௦)\n" +
          "\n" +
          "ஓம் பாவகாத்மஜாய நம:\n" +
          "ஓம் ஜ்ரும்பா4ய நம:\n" +
          "ஓம் ப்ரஜ்ரும்பா4ய நம:\n" +
          "ஓம் உஜ்ஜ்ரும்பா4ய நம:\n" +
          "ஓம் கமலாஸன ஸம்ஸ்துதாய நம:\n" +
          "ஓம் ஏகவர்ணாய நம:\n" +
          "ஓம் த்3விவர்ணாய நம:\n" +
          "ஓம் த்ரிவர்ணாய நம:\n" +
          "ஓம் ஸுமனோஹராய நம:\n" +
          "ஓம் சதுர்வர்ணாய நம: (5௦)\n" +
          "\n" +
          "ஓம் பஞ்சவர்ணாய நம:\n" +
          "ஓம் ப்ரஜாபதயே நம:\n" +
          "ஓம் அஹஸ்பதயே நம:\n" +
          "ஓம் அக்3னிக3ர்பா4ய நம:\n" +
          "ஓம் ஶமீக3ர்பா4ய நம:\n" +
          "ஓம் விஶ்வரேதஸே நம:\n" +
          "ஓம் ஸுராரிக்4னே நம:\n" +
          "ஓம் ஹரித்3வர்ணாய நம:\n" +
          "ஓம் ஶுப4கராய நம:\n" +
          "ஓம் படவே நம: (6௦)\n" +
          "\n" +
          "ஓம் வடுவேஷப்4ருதே நம:\n" +
          "ஓம் பூஷ்ணே நம:\n" +
          "ஓம் க3ப4ஸ்தயே நம:\n" +
          "ஓம் க3ஹனாய நம:\n" +
          "ஓம் சன்த்3ரவர்ணாய நம:\n" +
          "ஓம் கல்தா3த4ராய நம:\n" +
          "ஓம் மாயாத4ராய நம:\n" +
          "ஓம் மஹாமாயினே நம:\n" +
          "ஓம் கைவல்யாய நம:\n" +
          "ஓம் ஶங்கராத்மஜாய நம: (7௦)\n" +
          "\n" +
          "ஓம் விஶ்வயோனயே நம:\n" +
          "ஓம் அமேயாத்மனே நம:\n" +
          "ஓம் தேஜோனித4யே நம:\n" +
          "ஓம் அனாமயாய நம:\n" +
          "ஓம் பரமேஷ்டி2னே நம:\n" +
          "ஓம் பரஸ்மை ப்3ரஹ்மணே நம:\n" +
          "ஓம் வேத3க3ர்பா4ய நம:\n" +
          "ஓம் விராட்ஸுதாய நம:\n" +
          "ஓம் புல்தி3ன்த3கன்யாப4ர்த்ரே நம:\n" +
          "ஓம் மஹாஸாரஸ்வதாவ்ருதாய நம: (8௦)\n" +
          "\n" +
          "ஓம் ஆஶ்ரிதாகி2லதா3த்ரே நம:\n" +
          "ஓம் சோரக்4னாய நம:\n" +
          "ஓம் ரோக3னாஶனாய நம:\n" +
          "ஓம் அனந்தமூர்தயே நம:\n" +
          "ஓம் ஆனந்தா3ய நம:\n" +
          "ஓம் ஶிகி2ண்டி3க்ருத கேதனாய நம:\n" +
          "ஓம் ட3ம்பா4ய நம:\n" +
          "ஓம் பரமட3ம்பா4ய நம:\n" +
          "ஓம் மஹாட3ம்பா4ய நம:\n" +
          "ஓம் வ்ருஷாகபயே நம: (9௦)\n" +
          "\n" +
          "ஓம் காரணோபாத்ததே3ஹாய நம:\n" +
          "ஓம் காரணாதீதவிக்3ரஹாய நம:\n" +
          "ஓம் அனீஶ்வராய நம:\n" +
          "ஓம் அம்ருதாய நம:\n" +
          "ஓம் ப்ராணாய நம:\n" +
          "ஓம் ப்ராணாயாமபராயணாய நம:\n" +
          "ஓம் விருத்3த4ஹன்த்ரே நம:\n" +
          "ஓம் வீரக்4னாய நம:\n" +
          "ஓம் ரக்தஶ்யாமக3ல்தா3ய நம:\n" +
          "ஓம் ஸுப்3ரஹ்மண்யாய நம: (1௦௦)\n" +
          "\n" +
          "ஓம் கு3ஹாய நம:\n" +
          "ஓம் ப்ரீதாய நம:\n" +
          "ஓம் ப்3ராஹ்மண்யாய நம:\n" +
          "ஓம் ப்3ராஹ்மணப்ரியாய நம:\n" +
          "ஓம் வம்ஶவ்ருத்3தி4கராய நம: \n" +
          "ஓம் வேதா3ய நம:\n" +
          "ஓம் வேத்3யாய நம: \n" +
          "ஓம் அக்ஷயப2லப்ரதா3ய நம: (1௦8)\n"),
  'dhakshina': Ashtothram(
      'ஸ்ரீ தக்ஷிணாமூர்த்தி',
      'dhakshina',
      "ஓம் வித்³யாரூபிணே நம: ।\n" +
          "ஓம் மஹாயோகி³நே நம: ।\n" +
          "ஓம் ஶுத்³த⁴ ஜ்ஞாநிநே நம: ।\n" +
          "ஓம் பிநாகத்⁴ருʼதே நம: ।\n" +
          "ஓம் ரத்நாலங்க்ருʼதஸர்வாங்கி³நே நம: ।\n" +
          "ஓம் ரத்நமௌலயே நம: ।\n" +
          "ஓம் ஜடாத⁴ராய நம: ।\n" +
          "ஓம் க³ங்கா³தா⁴ரிணே நம: ।\n" +
          "ஓம் அசலவாஸிநே நம: ।\n" +
          "ஓம் மஹாஜ்ஞாநிநே நம: ॥ 10॥\n" +
          "\n" +
          "ஓம் ஸமாதி⁴க்ருʼதே நம: ।\n" +
          "ஓம் அப்ரமேயாய நம: ।\n" +
          "ஓம் யோக³நித⁴யே நம: ।\n" +
          "ஓம் தாரகாய நம: ।\n" +
          "ஓம் ப⁴க்தவத்ஸலாய நம: ।\n" +
          "ஓம் ப்³ரஹ்மரூபிணே நம: ।\n" +
          "ஓம் ஜக³த்³வ்யாபிநே நம: ।\n" +
          "ஓம் விஷ்ணுமூர்தயே நம: ।\n" +
          "ஓம் புராதநாய நம: ।\n" +
          "ஓம் உக்ஷவாஹாய நம: ॥ 20॥\n" +
          "\n" +
          "ஓம் சர்மவாஸஸே நம: ।\n" +
          "ஓம் பீதாம்ப³ர விபூ⁴ஷணாய நம: ।\n" +
          "ஓம் மோக்ஷதா³யிநே நம: ।\n" +
          "ஓம் மோக்ஷ நித⁴யே நம: ।\n" +
          "ஓம் அந்த⁴காரயே நம: ।\n" +
          "ஓம் ஜக³த்பதயே நம: ।\n" +
          "ஓம் வித்³யாதா⁴ரிணே நம: ।\n" +
          "ஓம் ஶுக்ல தநவே நம: ।\n" +
          "ஓம் வித்³யாதா³யிநே நம: ।\n" +
          "ஓம் க³ணாதி⁴பாய நம: ॥ 30॥\n" +
          "\n" +
          "ஓம் ப்ரௌடா⁴பஸ்ம்ருʼதி ஸம்ஹர்த்ரே நம: ।\n" +
          "ஓம் ஶஶி மௌளயே நம: ।\n" +
          "ஓம் மஹாஸ்வநாய நம: ।\n" +
          "ஓம் ஸாமப்ரியாய நம: ।\n" +
          "ஓம் அவ்யயாய நம: ।\n" +
          "ஓம் ஸாத⁴வே நம: ।\n" +
          "ஓம் ஸர்வவேதை³ரலங்க்ருʼதாய நம: ।\n" +
          "ஓம் ஹஸ்தே வஹ்நி த⁴ராய நம: ।\n" +
          "ஓம் ஶ்ரீமதே ம்ருʼக³தா⁴ரிணே நம: ।\n" +
          "ஓம் வஶங்கராய நம: ॥ 40॥\n" +
          "\n" +
          "ஓம் யஜ்ஞநாதா²ய நம: ।\n" +
          "ஓம் க்ரதுத்⁴வம்ஸிநே நம: ।\n" +
          "ஓம் யஜ்ஞபோ⁴க்த்ரே நம: ।\n" +
          "ஓம் யமாந்தகாய நம: ।\n" +
          "ஓம் ப⁴க்தாநுக்³ரஹ மூர்தயே நம: ।\n" +
          "ஓம் ப⁴த ஸேவ்யாய நம: ।\n" +
          "ஓம் வ்ருʼஷத்⁴வஜாய நம: ।\n" +
          "ஓம் ப⁴ஸ்மோத்³தூ⁴ளித ஸர்வாங்கா³ய நம: ।\n" +
          "ஓம் அக்ஷமாலாத⁴ராய நம: ।\n" +
          "ஓம் மஹதே நம: ॥ 50॥\n" +
          "\n" +
          "ஓம் த்ரயீமூர்தயே நம: ।\n" +
          "ஓம் பரப்³ரஹ்மணே நம: ।\n" +
          "ஓம் நாக³ராஜைரலங்க்ருʼதாய நம: ।\n" +
          "ஓம் ஶாந்தரூபாயமஹாஜ்ஞாநிநே நம: ।\n" +
          "ஓம் ஸர்வலோகவிபூ⁴ஷணாய நம: ।\n" +
          "ஓம் அர்த⁴நாரீஶ்வராய நம: ।\n" +
          "ஓம் தே³வாய நம: ।\n" +
          "ஓம் முநிஸேவ்யாய நம: ।\n" +
          "ஓம் ஸுரோத்தமாய நம: ।\n" +
          "ஓம் வ்யாக்²யாநதே³வாய நம: ॥ 60॥\n" +
          "\n" +
          "ஓம் ப⁴க³வதே நம: ।\n" +
          "ஓம் ரவிசந்த்³ராக்³நி லோசநாய நம: ।\n" +
          "ஓம் ஜக³த்³கு³ரவே நம: ।\n" +
          "ஓம் மஹாதே³வாய நம: ।\n" +
          "ஓம் மஹாநந்த³ பராயணாய நம: ।\n" +
          "ஓம் ஜடாதா⁴ரிணே நம: ।\n" +
          "ஓம் மஹாயோகி³நே நம: ।\n" +
          "ஓம் ஜ்ஞாநமாலைரலங்க்ருʼதாய நம: ।\n" +
          "ஓம் வ்யோமக³ங்கா³ஜலஸ்தா²நாய நம: ।\n" +
          "ஓம் விஶுத்³தா⁴ய நம: ॥ 70॥\n" +
          "\n" +
          "ஓம் யதயே நம: ।\n" +
          "ஓம் ஊர்ஜிதாய நம: ।\n" +
          "ஓம் தத்த்வமூர்தயே நம: ।\n" +
          "ஓம் மஹாயோகி³நே நம: ।\n" +
          "ஓம் மஹாஸாரஸ்வதப்ரதா³ய நம: ।\n" +
          "ஓம் வ்யோமமூர்தயே நம: ।\n" +
          "ஓம் ப⁴க்தாநாமிஷ்டாய நம: ।\n" +
          "ஓம் காமப²லப்ரதா³ய நம: ।\n" +
          "ஓம் பரமூர்தயே நம: ।\n" +
          "ஓம் சித்ஸ்வரூபிணே நம: ॥ 80॥\n" +
          "\n" +
          "ஓம் தேஜோமூர்தயே நம: ।\n" +
          "ஓம் அநாமயாய நம: ।\n" +
          "ஓம் வேத³வேதா³ங்க³ தத்த்வஜ்ஞாய நம: ।\n" +
          "ஓம் சது:ஷஷ்டி கலாநித⁴யே நம: ।\n" +
          "ஓம் ப⁴வரோக³ப⁴யத்⁴வம்ஸிநே நம: ।\n" +
          "ஓம் ப⁴க்தநாமப⁴யப்ரதா³ய நம: ।\n" +
          "ஓம் நீலக்³ரீவாய நம: ।\n" +
          "ஓம் லலாடாக்ஷாய நம: ।\n" +
          "ஓம் க³ஜசர்மணே நம: ।\n" +
          "ஓம் க³திப்ரதா³ய நம: ॥ 90॥\n" +
          "\n" +
          "ஓம் அராகி³ணே நம: ।\n" +
          "ஓம் காமதா³ய நம: ।\n" +
          "ஓம் தபஸ்விநே நம: ।\n" +
          "ஓம் விஷ்ணுவல்லபா⁴ய நம: ।\n" +
          "ஓம் ப்³ரஹ்மசாரிணே நம: ।\n" +
          "ஓம் ஸந்யாஸிநே நம: ।\n" +
          "ஓம் க்³ருʼஹஸ்தா²ஶ்ரமகாரணாய நம: ।\n" +
          "ஓம் தா³ந்தாய நம: ।\n" +
          "ஓம் ஶமவதாம் ஶ்ரேஷ்டா²ய நம: ।\n" +
          "ஓம் ஸத்யரூபாய நம: ॥ 100॥\n" +
          "\n" +
          "ஓம் த³யாபராய நம: ।\n" +
          "ஓம் யோக³பட்டாபி⁴ராமாய நம: ।\n" +
          "ஓம் வீணாதா⁴ரிணே நம: ।\n" +
          "ஓம் விசேதநாய நம: ।\n" +
          "ஓம் மதி ப்ரஜ்ஞாஸுதா⁴தா⁴ரிணே நம: ।\n" +
          "ஓம் முத்³ராபுஸ்தகதா⁴ரணாய நம: ।\n" +
          "ஓம் வேதாலாதி³ பிஶாசௌக⁴ ராக்ஷஸௌக⁴ விநாஶநாய நம: ।\n" +
          "ஓம் ரோகா³ணாம் விநிஹந்த்ரே நம: ।\n" +
          "ஓம் ஸுரேஶ்வராய நம: ॥ 108॥\n"),
  'mruthyunjayam': Ashtothram(
      'ஸ்ரீ மிருத்யுஞ்சயர்',
      'mruthyunjayam',
      "ஓம் சாந்தாயை நம:\n" +
          "ஓம் ப்ரகாய நம:\n" +
          "ஓம் கைவல்யஜநகாய நம:\n" +
          "ஓம் புரு÷ஷாத்தமாய நம:\n" +
          "ஓம் ஆத்மரம்யாய நம:\n" +
          "ஓம் நிராலம்பாய நம:\n" +
          "ஓம் பூர்வஜாய நம:\n" +
          "ஓம் சம்பவே நம:\n" +
          "ஓம் நிரவத்யாய நம:\n" +
          "ஓம் தர்மிஷ்டாய நம:\n" +
          "\n" +
          "ஓம் ஆத்யாய நம:\n" +
          "ஓம் காத்யாயநீப்ரியாய நம:\n" +
          "ஓம் த்ரயம்பகாய நம:\n" +
          "ஓம் ஸர்வக்ஞாய நம:\n" +
          "ஓம் வேத்யாய நம:\n" +
          "ஓம் காயத்ரீவல்லபாய நம:\n" +
          "ஓம் ஹிரிகேசாய நம:\n" +
          "ஓம் விபவே நம:\n" +
          "ஓம் தேஜஸே நம:\n" +
          "ஓம் த்ரிநேத்ராய நம:\n" +
          "\n" +
          "ஓம் விதுத்தமாய நம:\n" +
          "ஓம் ஸத்யோஜாதாய நம:\n" +
          "ஓம் ஸுவேஷாட்யாய நம:\n" +
          "ஓம் காலகூட விஷாசநாய நம:\n" +
          "ஓம் அந்தகாஸுரஸம்ஹர்த்ரே நம:\n" +
          "ஓம் காலகாலாய நம:\n" +
          "\n" +
          "ஓம் ம்ருத்யுஞ்ஜயாய நம:\n" +
          "ஓம் பரமஸித்தாய நம:\n" +
          "ஓம் பரமேஸ்வராய நம:\n" +
          "ஓம் ம்ருகண்டுஸுநுநேத்ர நம:\n" +
          "\n" +
          "ஓம் ஜாந்நவீதாரணாய நம:\n" +
          "ஓம் ப்ரபவே நம:\n" +
          "ஓம் அநாதநாதாய நம:\n" +
          "ஓம் தருணாய நம:\n" +
          "ஓம் சிவாய நம:\n" +
          "ஓம் சித்தாய நம:\n" +
          "ஓம் தநுர்தராய நம:\n" +
          "ஓம் அந்த்யகாலாதிபாய நம:\n" +
          "ஓம் ஸெளம்யாய நம:\n" +
          "ஓம் பாவாய நம:\n" +
          "\n" +
          "ஓம் த்ரிவிஷ்டபாய நம:\n" +
          "ஓம் அநாதிநிதநாய நம:\n" +
          "ஓம் நாகஹஸ்தாய நம:\n" +
          "ஓம் கட்வாங்கதாரகாய நம:\n" +
          "ஓம் வரதாபயஹஸ்தாய நம:\n" +
          "ஓம் ஏகாகிநே நம:\n" +
          "ஓம் நிர்மலாய நம:\n" +
          "ஓம் மஹதே நம:\n" +
          "ஓம் சரண்யாய நம:\n" +
          "ஓம் வரேண்யாய நம:\n" +
          "\n" +
          "ஓம் ஸுபாஹவே நம:\n" +
          "ஓம் மஹாபலபராபராக்ரமாய நம:\n" +
          "ஓம் பில்வகேசாய நம:\n" +
          "ஓம் வ்யக்தவேதாய நம:\n" +
          "ஓம் ஸ்தூலரூபிணே நம:\n" +
          "ஓம் வாங்மயாய நம:\n" +
          "ஓம் சுத்தாய நம:\n" +
          "ஓம் சேஷாய நம:\n" +
          "ஓம் லோகைகாத்யக்ஷõய நம:\n" +
          "\n" +
          "ஓம் ஜகத்பதயே நம:\n" +
          "\n" +
          "ஓம் அபபாய நம:\n" +
          "ஓம் அம்ருதேசாய நம:\n" +
          "ஓம் கரவீரப்ரியாய நம:\n" +
          "ஓம் பத்மகர்பாய நம:\n" +
          "ஓம் பரம்ஜ்யோதிஷே நம:\n" +
          "ஓம் நீரபாய நம:\n" +
          "ஓம் புத்திமதே நம:\n" +
          "ஓம் ஆதிதேவதாய நம:\n" +
          "ஓம் பவ்யாய நம:\n" +
          "\n" +
          "ஓம் தக்ஷயக்ஞவிகாதாய நம:\n" +
          "\n" +
          "ஓம் முநிப்ரியாய நம:\n" +
          "ஓம் ஸீஜாய நம:\n" +
          "ஓம் ம்ருத்யுஸரஹாரகாரகாய நம:\n" +
          "ஓம் புதநேசாய நம:\n" +
          "ஓம் யக்ஞகோப்த்ரே நம:\n" +
          "ஓம் விராகவதே நம:\n" +
          "ஓம் ம்ருகஹஸ்தாய நம:\n" +
          "ஓம் ஹராய நம:\n" +
          "ஓம் கூடஸ்தாயை நம:\n" +
          "ஓம் மோக்ஷதாயகாய நம:\n" +
          "\n" +
          "ஓம் ஆநந்தஹரிதாய நம:\n" +
          "ஓம் பீதாய நம:\n" +
          "ஓம் தேவாய நம:\n" +
          "ஓம் ஸத்யப்ரியாய நம:\n" +
          "ஓம் சித்ரமாயிநே நம:\n" +
          "ஓம் நிஷ்களங்காய நம:\n" +
          "ஓம் வர்ணிநே நம:\n" +
          "ஓம் அம்பிகாபதயே நம:\n" +
          "ஓம் காலபாசநிகாதாய நம:\n" +
          "\n" +
          "ஓம் கீர்த்திஸ்தம்பாக்ருதயே நம:\n" +
          "\n" +
          "ஓம் ஜடாதராயை நம:\n" +
          "ஓம் சூலபாணயே நம:\n" +
          "ஓம் ஆகமாய நம:\n" +
          "ஓம் அபயப்ரதாய நம:\n" +
          "ஓம் ம்ருத்யுஸங்காதகாய நம:\n" +
          "ஓம் ஸ்ரீதாய நம:\n" +
          "ஓம் ப்ராணஸம்ரக்ஷணாய நம:\n" +
          "ஓம் கங்காதராய நம:\n" +
          "ஓம் ஸுஸ்ரீதாய நம:\n" +
          "ஓம் பாலநேத்ராய நம:\n" +
          "\n" +
          "ஓம் க்ருபாகராய நம:\n" +
          "ஓம் நீலகண்டாய நம:\n" +
          "ஓம் கௌரீசாய நம:\n" +
          "ஓம் பஸ்மோத்தூளிதவிக்ரஹாய நம:\n" +
          "ஓம் புரந்தராய நம:\n" +
          "ஓம் சிஷ்டகாய நம:\n" +
          "ஓம் வேதாந்தாய நம:\n" +
          "ஓம் ஜும்ஸமூலகாய நம:\n" +
          "ஓம் ம்ருத்யுஜ்ஜயாய நம:\n"),
  'navagraha': Ashtothram(
      'ஸ்ரீ நவக்கிரகம்',
      'navagraha',
      "ஓம் பானவே நம\n" +
          "ஓம் ஹம்ஸாய நம\n" +
          "ஓம் பாஸ்கராய நம\n" +
          "ஓம் ஸூர்யாய நம\n" +
          "ஓம் ஸூராய நம\n" +
          "ஓம் தமோஹராய நம\n" +
          "ஓம் ரதிநே நம\n" +
          "ஓம் விஸ்வத்ருதே நம\n" +
          "ஓம் அவ்யாப்த்ரே நம\n" +
          "ஓம் ஹரயே நம\n" +
          "\n" +
          "ஓம் வேதமயாய நம\n" +
          "ஓம் விபவே நம\n" +
          "ஓம் ஸுத்தாம்ஸவே நம\n" +
          "ஓம் ஸுப்ராம்ஸவே நம\n" +
          "ஓம் சந்த்ராய நம\n" +
          "ஓம் அபஜநேத்ர ஸமுத்பவாய நம\n" +
          "ஓம் தரராதிபாய நம\n" +
          "ஓம் ரோஹிணீயாய நம\n" +
          "ஓம் ஸம்புமூர்த்திக்ருதாலயா நம\n" +
          "ஓம் ஒஷதீட்யாய நம\n" +
          "\n" +
          "ஓம் ஒஷதிபதயே நம\n" +
          "ஓம் ஈஸ்வர தராய நம\n" +
          "ஓம் ஸுதாநிதயே நம\n" +
          "ஓம் ஸகலாஹ்லாதந கராய நம\n" +
          "ஓம் பௌமாய நம\n" +
          "ஓம் பூமிஸுதாய நம\n" +
          "ஓம் பூதமாந்யாய நம\n" +
          "ஓம் ஸமுத்பவாய நம\n" +
          "ஓம் ஆர்யாய நம\n" +
          "ஓம் அக்நிக்ருதே நம\n" +
          "\n" +
          "ஓம் ரோஹிதாங்காய நம\n" +
          "ஓம் ரக்தவஸ்த்ரதராய நம\n" +
          "ஓம் ஸுசயே நம\n" +
          "ஓம் மங்களாய நம\n" +
          "ஓம் அங்காரகாய நம\n" +
          "ஓம் ரக்தமாலிநே நம\n" +
          "ஓம் மாயாவிஸாரதாய நம\n" +
          "ஓம் புதாய நம\n" +
          "ஓம் தாரஸுதாய நம\n" +
          "ஓம் ஸெளம்யாய நம\n" +
          "\n" +
          "ஓம் ரோஹிணீகர்ப்ப ஸம்பூதாய நம\n" +
          "ஓம் சந்த்ராத்மஜாய நம\n" +
          "ஓம் ஸோமவம்ஸகராய நம\n" +
          "ஓம் ஸ்ருதிவிஸாரதாய நம\n" +
          "ஓம் ஸத்யஸந்தாய நம\n" +
          "ஓம் ஸத்யஸிந்தவே நம\n" +
          "ஓம் விதுஸுதாய நம\n" +
          "ஓம் விபுதாய நம\n" +
          "ஓம் விபவே நம\n" +
          "ஓம் வாக் க்ருதே நம\n" +
          "\n" +
          "ஓம் ப்ராஹ்மணாய நம\n" +
          "ஓம் ப்ரஹ்மணே நம\n" +
          "ஓம் திஷணாய நம\n" +
          "ஓம் ஸுபவேஷதராய நம\n" +
          "ஓம் கீஷ்பதயே நம\n" +
          "ஓம் குரவே நம\n" +
          "ஓம் இந்த்ரபுரோஹிதாய நம\n" +
          "ஓம் ஜிவாய நம\n" +
          "ஓம் நிர்ஜரபூஜிதாய நம\n" +
          "ஓம் பீதாம்பராலங்க்ருதாய நம\n" +
          "\n" +
          "ஓம் ப்ருகவே நம\n" +
          "ஓம் பார்க்கவஸம்பூதாய நம\n" +
          "ஓம் நிஸாசரகுரவே நம\n" +
          "ஓம் கவயே நம\n" +
          "ஓம் ப்ருத்யகேதஷராய நம\n" +
          "ஓம் ப்ருகுஸுதாய நம\n" +
          "ஓம் வர்ஷக்ருதே நம\n" +
          "ஓம் தீனராஜ்யதாய நம\n" +
          "ஓம் ஸுக்ராய நம\n" +
          "ஓம் ஸுக்ரஸ்வரூபாய நம\n" +
          "\n" +
          "ஓம் ராஜ்யதாய நம\n" +
          "ஓம் லயக்ருதாய நம\n" +
          "ஓம் கோணாய நம\n" +
          "ஓம் ஸநைஸ்சராய நம\n" +
          "ஓம் சாயாஹ்ருதயநந்தநாய நம\n" +
          "ஓம் பாங்கவே நம\n" +
          "ஓம் பாநுதநூபவாய நம\n" +
          "ஓம் யமாநுஜாய நம\n" +
          "\n" +
          "ஓம் அதிபயக்ருதே நம\n" +
          "ஓம் நீலாய நம\n" +
          "ஓம் ஸூர்யவம்ஸஜாய நம\n" +
          "ஓம் நிர்மாணதேஹோய நம\n" +
          "ஓம் ராஹவே நம\n" +
          "ஓம் ஸ்வர்பாநவே நம\n" +
          "ஓம் ஆதித்யசந்த்ரத்வேஷிணே நம\n" +
          "ஓம் புஜங்கமாய நம\n" +
          "ஓம் ஸிம்ஹிதேஸாய நம\n" +
          "ஓம் குணவதே நம\n" +
          "\n" +
          "ஓம் ராத்ரிபதிபீடிதாய நம\n" +
          "ஓம் அஹிராஜே நம\n" +
          "ஓம் ஸிரோஹீநாய நம\n" +
          "ஓம் விஷதராய நம\n" +
          "ஓம் மஹாகாயாய நம\n" +
          "ஓம் மஹாபூதாய நம\n" +
          "ஓம் ப்ராஹ்மணாய நம\n" +
          "ஓம் ப்ரஹ்மஸம்பூதாய நம\n" +
          "ஓம் ரவிக்ருதே நம\n" +
          "ஓம் ராஹுருபத்ருதே நம\n" +
          "\n" +
          "ஓம் கேதவே நம\n" +
          "ஓம் கேதுஸ்வரூபாய நம\n" +
          "ஓம் கேசராய நம\n" +
          "ஓம் சுக்ருதாலயாய நம\n" +
          "ஓம் ப்ரஹ்மவிதே நம\n" +
          "ஓம் ப்ரஹ்ம புத்ராய நம\n" +
          "ஓம் குமாரகாய நம\n" +
          "ஓம் ப்ராஹ்மணப்ரீதாய நம\n"),
  'surya': Ashtothram(
      'ஸ்ரீ சூரியன்',
      'surya',
      "ஓம் அருணாய நம: ।\n" +
          "ஓம் ஶரண்யாய நம: ।\n" +
          "ஓம் கருணாரஸஸிந்த⁴வே நம: ।\n" +
          "ஓம் அஸமாநப³லாய நம: ।\n" +
          "ஓம் ஆர்தரக்ஷகாய நம: ।\n" +
          "ஓம் ஆதி³த்யாய நம: ।\n" +
          "ஓம் ஆதி³பூ⁴தாய நம: ।\n" +
          "ஓம் அகி²லாக³மவேதி³நே நம: ।\n" +
          "ஓம் அச்யுதாய நம: ।\n" +
          "ஓம் அகி²லஜ்ஞாய நம: ॥ 10 ॥\n" +
          "\n" +
          "ஓம் அநந்தாய நம: ।\n" +
          "ஓம் இநாய நம: ।\n" +
          "ஓம் விஶ்வரூபாய நம: ।\n" +
          "ஓம் இஜ்யாய நம: ।\n" +
          "ஓம் இந்த்³ராய நம: ।\n" +
          "ஓம் பா⁴நவே நம: ।\n" +
          "ஓம் இந்தி³ராமந்தி³ராப்தாய நம: ।\n" +
          "ஓம் வந்த³நீயாய நம: ।\n" +
          "ஓம் ஈஶாய நம: ।\n" +
          "ஓம் ஸுப்ரஸந்நாய நம: ॥ 20 ॥\n" +
          "\n" +
          "ஓம் ஸுஶீலாய நம: ।\n" +
          "ஓம் ஸுவர்சஸே நம: ।\n" +
          "ஓம் வஸுப்ரதா³ய நம: ।\n" +
          "ஓம் வஸவே நம: ।\n" +
          "ஓம் வாஸுதே³வாய நம: ।\n" +
          "ஓம் உஜ்ஜ்வலாய நம: ।\n" +
          "ஓம் உக்³ரரூபாய நம: ।\n" +
          "ஓம் ஊர்த்⁴வகா³ய நம: ।\n" +
          "ஓம் விவஸ்வதே நம: ।\n" +
          "ஓம் உத்³யத்கிரணஜாலாய நம: ॥ 30 ॥\n" +
          "\n" +
          "ஓம் ஹ்ருʼஷீகேஶாய நம: ।\n" +
          "ஓம் ஊர்ஜஸ்வலாய நம: ।\n" +
          "ஓம் வீராய நம: ।\n" +
          "ஓம் நிர்ஜராய நம: ।\n" +
          "ஓம் ஜயாய நம: ।\n" +
          "ஓம் ஊருத்³வயாபா⁴வரூபயுக்தஸாரத²யே நம: ।\n" +
          "ஓம் ருʼஷிவந்த்³யாய நம: ।\n" +
          "ஓம் ருக்³க⁴ந்த்ரே நம: ।\n" +
          "ஓம் ருʼக்ஷசக்ரசராய நம: ।\n" +
          "ஓம் ருʼஜுஸ்வபா⁴வசித்தாய நம: ॥ 40 ॥\n" +
          "\n" +
          "ஓம் நித்யஸ்துத்யாய நம: ।\n" +
          "ஓம் ருʼகாரமாத்ருʼகாவர்ணரூபாய நம: ।\n" +
          "ஓம் உஜ்ஜ்வலதேஜஸே நம: ।\n" +
          "ஓம் ருʼக்ஷாதி⁴நாத²மித்ராய நம: ।\n" +
          "ஓம் புஷ்கராக்ஷாய நம: ।\n" +
          "ஓம் லுப்தத³ந்தாய நம: ।\n" +
          "ஓம் ஶாந்தாய நம: ।\n" +
          "ஓம் காந்திதா³ய நம: ।\n" +
          "ஓம் க⁴நாய நம: ।\n" +
          "ஓம் கநத்கநகபூ⁴ஷாய நம: ॥ 50 ॥\n" +
          "\n" +
          "ஓம் க²த்³யோதாய நம: ।\n" +
          "ஓம் லூநிதாகி²லதை³த்யாய நம: ।\n" +
          "ஓம் ஸத்யாநந்த³ஸ்வரூபிணே நம: ।\n" +
          "ஓம் அபவர்க³ப்ரதா³ய நம: ।\n" +
          "ஓம் ஆர்தஶரண்யாய நம: ।\n" +
          "ஓம் ஏகாகிநே நம: ।\n" +
          "ஓம் ப⁴க³வதே நம: ।\n" +
          "ஓம் ஸ்ருʼஷ்டிஸ்தி²த்யந்தகாரிணே நம: ।\n" +
          "ஓம் கு³ணாத்மநே நம: ।\n" +
          "ஓம் க்⁴ருʼணிப்⁴ருʼதே நம: ॥ 60 ॥\n" +
          "\n" +
          "ஓம் ப்³ருʼஹதே நம: ।\n" +
          "ஓம் ப்³ரஹ்மணே நம: ।\n" +
          "ஓம் ஐஶ்வர்யதா³ய நம: ।\n" +
          "ஓம் ஶர்வாய நம: ।\n" +
          "ஓம் ஹரித³ஶ்வாய நம: ।\n" +
          "ஓம் ஶௌரயே நம: ।\n" +
          "ஓம் த³ஶதி³க்ஸம்ப்ரகாஶாய நம: ।\n" +
          "ஓம் ப⁴க்தவஶ்யாய நம: ।\n" +
          "ஓம் ஓஜஸ்கராய நம: ।\n" +
          "ஓம் ஜயிநே நம: ॥ 70 ॥\n" +
          "\n" +
          "ஓம் ஜக³தா³நந்த³ஹேதவே நம: ।\n" +
          "ஓம் ஜந்மம்ருʼத்யுஜராவ்யாதி⁴வர்ஜிதாய நம: ।\n" +
          "ஓம் உச்சஸ்தா²ந ஸமாரூட⁴ரத²ஸ்தா²ய நம: ।\n" +
          "ஓம் அஸுராரயே நம: ।\n" +
          "ஓம் கமநீயகராய நம: ।\n" +
          "ஓம் அப்³ஜவல்லபா⁴ய நம: ।\n" +
          "ஓம் அந்தர்ப³ஹி: ப்ரகாஶாய நம: ।\n" +
          "ஓம் அசிந்த்யாய நம: ।\n" +
          "ஓம் ஆத்மரூபிணே நம: ।\n" +
          "ஓம் அச்யுதாய நம: ॥ 80 ॥\n" +
          "\n" +
          "ஓம் அமரேஶாய நம: ।\n" +
          "ஓம் பரஸ்மை ஜ்யோதிஷே நம: ।\n" +
          "ஓம் அஹஸ்கராய நம: ।\n" +
          "ஓம் ரவயே நம: ।\n" +
          "ஓம் ஹரயே நம: ।\n" +
          "ஓம் பரமாத்மநே நம: ।\n" +
          "ஓம் தருணாய நம: ।\n" +
          "ஓம் வரேண்யாய நம: ।\n" +
          "ஓம் க்³ரஹாணாம்பதயே நம: ।\n" +
          "ஓம் பா⁴ஸ்கராய நம: ॥ 90 ॥\n" +
          "\n" +
          "ஓம் ஆதி³மத்⁴யாந்தரஹிதாய நம: ।\n" +
          "ஓம் ஸௌக்²யப்ரதா³ய நம: ।\n" +
          "ஓம் ஸகலஜக³தாம்பதயே நம: ।\n" +
          "ஓம் ஸூர்யாய நம: ।\n" +
          "ஓம் கவயே நம: ।\n" +
          "ஓம் நாராயணாய நம: ।\n" +
          "ஓம் பரேஶாய நம: ।\n" +
          "ஓம் தேஜோரூபாய நம: ।\n" +
          "ஓம் ஶ்ரீம் ஹிரண்யக³ர்பா⁴ய நம: ।\n" +
          "ஓம் ஹ்ரீம் ஸம்பத்கராய நம: ॥ 100 ॥\n" +
          "\n" +
          "ஓம் ஐம் இஷ்டார்த²தா³யநம: ।\n" +
          "ஓம் அநுப்ரஸந்நாய நம: ।\n" +
          "ஓம் ஶ்ரீமதே நம: ।\n" +
          "ஓம் ஶ்ரேயஸேநம: ।\n" +
          "ஓம் ப⁴க்தகோடிஸௌக்²யப்ரதா³யிநே நம: ।\n" +
          "ஓம் நிகி²லாக³மவேத்³யாய நம: ।\n" +
          "ஓம் நித்யாநந்தா³ய நம: ।\n" +
          "ஓம் ஸூர்யாய நம: ॥ 108 ॥\n"),
  'chandra': Ashtothram(
      'ஸ்ரீ சந்திரன்',
      'chandra',
      "ஓம் ஶ்ரீமதே நம: ।\n" +
          "ஓம் ஶஶத⁴ராய நம: ।\n" +
          "ஓம் சந்த்³ராய நம: ।\n" +
          "ஓம் தாராதீ⁴ஶாய நம: ।\n" +
          "ஓம் நிஶாகராய நம: ।\n" +
          "ஓம் ஸுக²நித⁴யே நம: ।\n" +
          "ஓம் ஸதா³ராத்⁴யாய நம: ।\n" +
          "ஓம் ஸத்பதயே நம: ।\n" +
          "ஓம் ஸாது⁴பூஜிதாய நம: ।\n" +
          "ஓம் ஜிதேந்த்³ரியாய நம: । 10 ।\n" +
          "\n" +
          "ஓம் ஜயோத்³யோகா³ய நம: ।\n" +
          "ஓம் ஜ்யோதிஶ்சக்ரப்ரவர்தகாய நம: ।\n" +
          "ஓம் விகர்தநாநுஜாய நம: ।\n" +
          "ஓம் வீராய நம: ।\n" +
          "ஓம் விஶ்வேஶாய நம: ।\n" +
          "ஓம் விது³ஷாம் பதயே நம: ।\n" +
          "ஓம் தோ³ஷாகராய நம: ।\n" +
          "ஓம் து³ஷ்டதூ³ராய நம: ।\n" +
          "ஓம் புஷ்டிமதே நம: ।\n" +
          "ஓம் ஶிஷ்டபாலகாய நம: । 20 ।\n" +
          "\n" +
          "ஓம் அஷ்டமூர்திப்ரியாய நம: ।\n" +
          "ஓம் அநந்தாய நம: ।\n" +
          "ஓம் கஷ்டதா³ருகுடா²ரகாய நம: ।\n" +
          "ஓம் ஸ்வப்ரகாஶாய நம: ।\n" +
          "ஓம் ப்ரகாஶாத்மநே நம: ।\n" +
          "ஓம் த்³யுசராய நம: ।\n" +
          "ஓம் தே³வபோ⁴ஜநாய நம: ।\n" +
          "ஓம் கலாத⁴ராய நம: ।\n" +
          "ஓம் காலஹேதவே நம: ।\n" +
          "ஓம் காமக்ருʼதே நம: । 30 ।\n" +
          "\n" +
          "ஓம் காமதா³யகாய நம: ।\n" +
          "ஓம் ம்ருʼத்யுஸம்ஹாரகாய நம: ।\n" +
          "ஓம் அமர்த்யாய நம: ।\n" +
          "ஓம் நித்யாநுஷ்டா²நதா³யகாய நம: ।\n" +
          "ஓம் க்ஷபாகராய நம: ।\n" +
          "ஓம் க்ஷீணபாபாய நம: ।\n" +
          "ஓம் க்ஷயவ்ருʼத்³தி⁴ஸமந்விதாய நம: ।\n" +
          "ஓம் ஜைவாத்ருʼகாய நம: ।\n" +
          "ஓம் ஶுசயே நம: ।\n" +
          "ஓம் ஶுப்⁴ராய நம: । 40 ।\n" +
          "\n" +
          "\n" +
          "ஓம் ஜயிநே நம: ।\n" +
          "ஓம் ஜயப²லப்ரதா³ய நம: ।\n" +
          "ஓம் ஸுதா⁴மயாய நம: ।\n" +
          "ஓம் ஸுரஸ்வாமிநே நம: ।\n" +
          "ஓம் ப⁴க்தாநாமிஷ்டதா³யகாய நம: ।\n" +
          "ஓம் பு⁴க்திதா³ய நம: ।\n" +
          "ஓம் முக்திதா³ய நம: ।\n" +
          "ஓம் ப⁴த்³ராய நம: ।\n" +
          "ஓம் ப⁴க்ததா³ரித்³ர்யப⁴ஞ்ஜகாய நம: ।\n" +
          "var ௐ ப⁴க்ததா³ரித்³ர்யப⁴ஞ்ஜநாய நம: ।\n" +
          "ஓம் ஸாமகா³நப்ரியாய நம: । 50 ।\n" +
          "\n" +
          "ஓம் ஸர்வரக்ஷகாய நம: ।\n" +
          "ஓம் ஸாக³ரோத்³ப⁴வாய நம: ।\n" +
          "ஓம் ப⁴யாந்தக்ருʼதே நம: ।\n" +
          "ஓம் ப⁴க்திக³ம்யாய நம: ।\n" +
          "ஓம் ப⁴வப³ந்த⁴விமோசகாய நம: ।\n" +
          "ஓம் ஜக³த்ப்ரகாஶகிரணாய நம: ।\n" +
          "ஓம் ஜக³தா³நந்த³காரணாய நம: ।\n" +
          "ஓம் நிஸ்ஸபத்நாய நம: ।\n" +
          "ஓம் நிராஹாராய நம: ।\n" +
          "ஓம் நிர்விகாராய நம: । 60 ।\n" +
          "\n" +
          "ஓம் நிராமயாய நம: ।\n" +
          "ஓம் பூ⁴ச்ச²யாঽঽச்சா²தி³தாய நம: ।\n" +
          "ஓம் ப⁴வ்யாய நம: ।\n" +
          "ஓம் பு⁴வநப்ரதிபாலகாய நம: ।\n" +
          "ஓம் ஸகலார்திஹராய நம: ।\n" +
          "ஓம் ஸௌம்யஜநகாய நம: ।\n" +
          "ஓம் ஸாது⁴வந்தி³தாய நம: ।\n" +
          "ஓம் ஸர்வாக³மஜ்ஞாய நம: ।\n" +
          "ஓம் ஸர்வஜ்ஞாய நம: ।\n" +
          "ஓம் ஸநகாதி³முநிஸ்துதாய நம: । 70 ।\n" +
          "\n" +
          "ஓம் ஸிதச்ச²த்ரத்⁴வஜோபேதாய நம: ।\n" +
          "ஓம் ஸிதாங்கா³ய நம: ।\n" +
          "ஓம் ஸிதபூ⁴ஷணாய நம: ।\n" +
          "ஓம் ஶ்வேதமால்யாம்ப³ரத⁴ராய நம: ।\n" +
          "ஓம் ஶ்வேதக³ந்தா⁴நுலேபநாய நம: ।\n" +
          "ஓம் த³ஶாஶ்வரத²ஸம்ரூடா⁴ய நம: ।\n" +
          "ஓம் த³ண்ட³பாணயே நம: ।\n" +
          "ஓம் த⁴நுர்த⁴ராய நம: ।\n" +
          "ஓம் குந்த³புஷ்போஜ்ஜ்வலாகாராய நம: ।\n" +
          "ஓம் நயநாப்³ஜஸமுத்³ப⁴வாய நம: । 80 ।\n" +
          "\n" +
          "ஓம் ஆத்ரேயகோ³த்ரஜாய நம: ।\n" +
          "ஓம் அத்யந்தவிநயாய நம: ।\n" +
          "ஓம் ப்ரியதா³யகாய நம: ।\n" +
          "ஓம் கருணாரஸஸம்பூர்ணாய நம: ।\n" +
          "ஓம் கர்கடப்ரப⁴வே நம: ।\n" +
          "ஓம் அவ்யயாய நம: ।\n" +
          "ஓம் சதுரஶ்ராஸநாரூடா⁴ய நம: ।\n" +
          "ஓம் சதுராய நம: ।\n" +
          "ஓம் தி³வ்யவாஹநாய நம: ।\n" +
          "ஓம் விவஸ்வந்மண்ட³லாக்³நேயவாஸஸே நம: । 90 ।\n" +
          "\n" +
          "ஓம் வஸுஸம்ருʼத்³தி⁴தா³ய நம: ।\n" +
          "ஓம் மஹேஶ்வரப்ரியாய நம: ।\n" +
          "ஓம் தா³ந்தாய நம: ।\n" +
          "ஓம் மேருகோ³த்ரப்ரத³க்ஷிணாய நம: ।\n" +
          "ஓம் க்³ரஹமண்ட³லமத்⁴யஸ்தா²ய நம: ।\n" +
          "ஓம் க்³ரஸிதார்காய நம: ।\n" +
          "ஓம் க்³ரஹாதி⁴பாய நம: ।\n" +
          "ஓம் த்³விஜராஜாய நம: ।\n" +
          "ஓம் த்³யுதிலகாய நம: ।\n" +
          "ஓம் த்³விபு⁴ஜாய நம: । 100 ।\n" +
          "\n" +
          "ஓம் த்³விஜபூஜிதாய நம: ।\n" +
          "ஓம் ஔது³ம்ப³ரநகா³வாஸாய நம: ।\n" +
          "ஓம் உதா³ராய நம: ।\n" +
          "ஓம் ரோஹிணீபதயே நம: ।\n" +
          "ஓம் நித்யோத³யாய நம: ।\n" +
          "ஓம் முநிஸ்துத்யாய நம: ।\n" +
          "ஓம் நித்யாநந்த³ப²லப்ரதா³ய நம: ।\n" +
          "ஓம் ஸகலாஹ்லாத³நகராய நம: । 108 ।\n" +
          "\n" +
          "ஓம் பலாஶேத்⁴மப்ரியாய நம: ।\n" +
          "var ௐ பலாஶஸமித⁴ப்ரியாய நம: ।\n"),
  'sevvai': Ashtothram(
      'ஸ்ரீ செவ்வாய்',
      'sevvai',
      "ஓம் மஹீஸுதாய நம: ॥\n" +
          "ஓம் மஹாபா⁴கா³ய நம: ॥\n" +
          "ஓம் மங்க³ளாய நம: ॥\n" +
          "ஓம் மங்க³ளப்ரதா³ய நம: ॥\n" +
          "ஓம் மஹாவீராய நம: ॥\n" +
          "ஓம் மஹாஶூராய நம: ॥\n" +
          "ஓம் மஹாப³லபராக்ரமாய நம: ॥\n" +
          "ஓம் மஹாரௌத்³ராய நம: ॥\n" +
          "ஓம் மஹாப⁴த்³ராய நம: ॥ 10 ॥\n" +
          "\n" +
          "ஓம் மாநநீயாய நம: ॥\n" +
          "ஓம் த³யாகராய நம: ॥\n" +
          "ஓம் மாநதா³ய நம: ॥\n" +
          "ஓம் அபர்வணாய நம: ॥\n" +
          "ஓம் க்ரூராய நம: ॥\n" +
          "ஓம் தாபத்ரயவிவர்ஜிதாய நம: ॥\n" +
          "ஓம் ஸுப்ரதீபாய நம: ॥\n" +
          "ஓம் ஸுதாம்ராக்ஷாய நம: ॥\n" +
          "ஓம் ஸுப்³ரஹ்மண்யாய நம: ॥\n" +
          "ஓம் ஸுக²ப்ரதா³ய நம: ॥ 20 ॥\n" +
          "\n" +
          "ஓம் வக்ரஸ்தம்பா⁴தி³க³மநாய நம: ॥\n" +
          "ஓம் வரேண்யாய நம: ॥\n" +
          "ஓம் வரதா³ய நம: ॥\n" +
          "ஓம் ஸுகி²நே நம: ॥\n" +
          "ஓம் வீரப⁴த்³ராய நம: ॥\n" +
          "ஓம் விரூபாக்ஷாய நம: ॥\n" +
          "ஓம் விதூ³ரஸ்தா²ய நம: ॥\n" +
          "ஓம் விபா⁴வஸவே நம: ॥\n" +
          "ஓம் நக்ஷத்ரசக்ரஸஞ்சாரிணே நம: ॥\n" +
          "ஓம் க்ஷத்ரபாய நம: ॥ 30 ॥\n" +
          "\n" +
          "ஓம் க்ஷாத்ரவர்ஜிதாய நம: ॥\n" +
          "ஓம் க்ஷயவ்ருʼத்³தி⁴விநிர்முக்தாய நம: ॥\n" +
          "ஓம் க்ஷமாயுக்தாய நம: ॥\n" +
          "ஓம் விசக்ஷணாய நம: ॥\n" +
          "ஓம் அக்ஷீணப²லதா³ய நம: ॥\n" +
          "ஓம் சதுர்வர்க³ப²லப்ரதா³ய நம: ॥\n" +
          "ஓம் வீதராகா³ய நம: ॥\n" +
          "ஓம் வீதப⁴யாய நம: ॥\n" +
          "ஓம் விஜ்வராய நம: ॥\n" +
          "ஓம் விஶ்வகாரணாய நம: ॥ 40 ॥\n" +
          "\n" +
          "ஓம் நக்ஷத்ரராஶிஸஞ்சாராய நம: ॥\n" +
          "ஓம் நாநாப⁴யநிக்ருʼந்தநாய நம: ॥\n" +
          "ஓம் வந்தா³ருஜநமந்தா³ராய நம: ॥\n" +
          "ஓம் வக்ரகுஞ்சிதமூர்த⁴ஜாய நம: ॥\n" +
          "ஓம் கமநீயாய நம: ॥\n" +
          "ஓம் த³யாஸாராய நம: ॥\n" +
          "ஓம் கநத்கநகபூ⁴ஷணாய நம: ॥\n" +
          "ஓம் ப⁴யக்⁴நாய நம: ॥\n" +
          "ஓம் ப⁴வ்யப²லதா³ய நம: ॥\n" +
          "ஓம் ப⁴க்தாப⁴யவரப்ரதா³ய நம: ॥ 50 ॥\n" +
          "\n" +
          "ஓம் ஶத்ருஹந்த்ரே நம: ॥\n" +
          "ஓம் ஶமோபேதாய நம: ॥\n" +
          "ஓம் ஶரணாக³தபோஷநாய நம: ॥\n" +
          "ஓம் ஸாஹஸிநே நம: ॥\n" +
          "ஓம் ஸத்³கு³ணாத்⁴யக்ஷாய நம: ॥\n" +
          "ஓம் ஸாத⁴வே நம: ॥\n" +
          "ஓம் ஸமரது³ர்ஜயாய நம: ॥\n" +
          "ஓம் து³ஷ்டதூ³ராய நம: ॥\n" +
          "ஓம் ஶிஷ்டபூஜ்யாய நம: ॥\n" +
          "ஓம் ஸர்வகஷ்டநிவாரகாய நம: ॥ 60 ॥\n" +
          "\n" +
          "ஓம் து³ஶ்சேஷ்டவாரகாய நம: ॥\n" +
          "ஓம் து:³க²ப⁴ஞ்ஜநாய நம: ॥\n" +
          "ஓம் து³ர்த⁴ராய நம: ॥\n" +
          "ஓம் ஹரயே நம: ॥\n" +
          "ஓம் து:³ஸ்வப்நஹந்த்ரே நம: ॥\n" +
          "ஓம் து³ர்த⁴ர்ஷாய நம: ॥\n" +
          "ஓம் து³ஷ்டக³ர்வவிமோசநாய நம: ॥\n" +
          "ஓம் ப⁴ரத்³வாஜகுலோத்³பூ⁴தாய நம: ॥\n" +
          "ஓம் பூ⁴ஸுதாய நம: ॥\n" +
          "ஓம் ப⁴வ்யபூ⁴ஷணாய நம: ॥ 70 ॥\n" +
          "\n" +
          "ஓம் ரக்தாம்ப³ராய நம: ॥\n" +
          "ஓம் ரக்தவபுஷே நம: ॥\n" +
          "ஓம் ப⁴க்தபாலநதத்பராய நம: ॥\n" +
          "ஓம் சதுர்பு⁴ஜாய நம: ॥\n" +
          "ஓம் க³தா³தா⁴ரிணே நம: ॥\n" +
          "ஓம் மேஷவாஹாய நம: ॥\n" +
          "ஓம் மிதாஶநாய நம: ॥\n" +
          "ஓம் ஶக்திஶூலத⁴ராய நம: ॥\n" +
          "ஓம் ஶாக்தாய நம: ॥\n" +
          "ஓம் ஶஸ்த்ரவித்³யாவிஶாரதா³ய நம: ॥ 80 ॥\n" +
          "\n" +
          "ஓம் தார்கிகாய நம: ॥\n" +
          "ஓம் தாமஸாதா⁴ராய நம: ॥\n" +
          "ஓம் தபஸ்விநே நம: ॥\n" +
          "ஓம் தாம்ரலோசநாய நம: ॥\n" +
          "ஓம் தப்தகாஞ்சநஸங்காஶாய நம: ॥\n" +
          "ஓம் ரக்தகிஞ்ஜல்கஸம்நிபா⁴ய நம: ॥\n" +
          "ஓம் கோ³த்ராதி⁴தே³வாய நம: ॥\n" +
          "ஓம் கோ³மத்⁴யசராய நம: ॥\n" +
          "ஓம் கு³ணவிபூ⁴ஷணாய நம: ॥\n" +
          "ஓம் அஸ்ருʼஜே நம: ॥ 90 ॥\n" +
          "\n" +
          "ஓம் அங்கா³ரகாய நம: ॥\n" +
          "ஓம் அவந்தீதே³ஶாதீ⁴ஶாய நம: ॥\n" +
          "ஓம் ஜநார்த³நாய நம: ॥\n" +
          "ஓம் ஸூர்யயாம்யப்ரதே³ஶஸ்தா²ய நம: ॥\n" +
          "ஓம் கு⁴நே நம: ॥\n" +
          "ஓம் யௌவநாய நம: ॥\n" +
          "ஓம் யாம்யஹரிந்முகா²ய நம: ॥\n" +
          "ஓம் யாம்யதி³ங்முகா²ய நம: ॥\n" +
          "ஓம் த்ரிகோணமண்ட³லக³தாய நம: ॥\n" +
          "ஓம் த்ரித³ஶாதி⁴பஸந்நுதாய நம: ॥ 100 ॥\n" +
          "\n" +
          "ஓம் ஶுசயே நம: ॥\n" +
          "ஓம் ஶுசிகராய நம: ॥\n" +
          "ஓம் ஶூராய நம: ॥\n" +
          "ஓம் ஶுசிவஶ்யாய நம: ॥\n" +
          "ஓம் ஶுபா⁴வஹாய நம: ॥\n" +
          "ஓம் மேஷவ்ருʼஶ்சிகராஶீஶாய நம: ॥\n" +
          "ஓம் மேதா⁴விநே நம: ॥\n" +
          "ஓம் மிதபா⁴ஷணாய நம: ॥\n" +
          "ஓம் ஸுக²ப்ரதா³ய நம: ॥\n" +
          "ஓம் ஸுரூபாக்ஷாய நம: ॥\n" +
          "ஓம் ஸர்வாபீ⁴ஷ்டப²லப்ரதா³ய நம: ॥\n"),
  'buthan': Ashtothram(
      'ஸ்ரீ புதன்',
      'buthan',
      "ஓம் புதாய நம : \n" +
          "ஓம் புதார்சிதாய நம : \n" +
          "ஓம் ஸெம்யாய நம : \n" +
          "ஓம் ஸெளம்சித்தாய நம : \n" +
          "ஓம் ஸுபப்ரதாய நம : \n" +
          "ஓம் த்ருடபலாய நம : \n" +
          "ஓம் ஸ்திரிஜாலப்ரபோதகாய நம : \n" +
          "ஓம் த்ரிதஸாதிபூஜிதாய நம : \n" +
          "ஓம் புத்திமதே நம : \n" +
          "ஓம் பஹுஸாஸ்ரக்ஞாய நம : \n" +
          "ஓம் பவிநே நம : \n" +
          "ஓம் பந்தவிமோசநாய நம : \n" +
          "ஓம் வக்ராதிவக்ரகமநாய நம : \n" +
          "ஓம் வஸவாய நம : \n" +
          "ஓம் வஸுதாதிபாய நம : \n" +
          "ஓம் ஸத்யவாஸாய நம : \n" +
          "ஓம் ஸத்யவசஸே நம : \n" +
          "ஓம் ஸரேயஸாம்பதயே நம : \n" +
          "ஓம் த்ருடௌரதாய நம : \n" +
          "ஓம் ஸோமஜாய நம : \n" +
          "ஓம் ஸுகதாய நம : \n" +
          "ஓம் ஸ்ரீமதே நம : \n" +
          "ஓம் ஸோமவம்ஸப்ரதீபாய நம : \n" +
          "ஓம் வேதவிதே நம : \n" +
          "ஓம் வேதத்வக்ஞாய நம : \n" +
          "ஓம் வராய நம : \n" +
          "ஓம் வித்யாவிசக்ஷனாய நம : \n" +
          "ஓம் விதுஷே நம : \n" +
          "ஓம் வித்வத்ப்ரீதிகராய நம : \n" +
          "ஓம் குஜவே நம : \n" +
          "ஓம் விஸ்வாநுகூலஸம் \n" +
          "ஓம சாரிணே நம : \n" +
          "ஓம் விசேஷவிநயாந்விநாய நம : \n" +
          "ஓம் விவிதாகமஸாரக்ஞாய நம : \n" +
          "ஓம் வீர்யவதே நம : \n" +
          "ஓம் விகதஜ்வராய நம : \n" +
          "ஓம் த்ரிவாகபலதாய நம : \n" +
          "ஓம் அநந்தாய நம : \n" +
          "ஓம் சபலாய நம : \n" +
          "ஓம் ஜிதேந்திரியாய நம : \n" +
          "ஓம் உதங்கமுகாய நம : \n" +
          "ஓம் மகரஸக்தாய நம : \n" +
          "ஓம் மகதாரிபதயே நம : \n" +
          "ஓம் ஹரயே நம : \n" +
          "ஓம் பரஸாதவதநாய நம : \n" +
          "ஓம் வந்த்யாய நம : \n" +
          "ஓம் வாக்விலக்ஷணாய நம : \n" +
          "ஓம் ஸத்யவே நம : \n" +
          "ஓம் அவ்யாய நம : \n" +
          "ஓம் ஸத்யஸங்கல்பாய நம : \n" +
          "ஓம் ஸதாதராய நம : \n" +
          "ஓம் ஸாவரோகப்ரஸமநாய நம : \n" +
          "ஓம் வாணிவஜ்நிபுணாய நம : \n" +
          "ஓம் பஸ்யாய நம : \n" +
          "ஓம் வாதாங்கிநே நம : \n" +
          "ஓம் வாதரோகஹ்ருதே நம : \n" +
          "ஓம் ஸ்தூலாய நம : \n" +
          "ஓம் ஸ்தைர் யகுணாத்யக்ஷhய நம : \n" +
          "ஓம் ஸ்தூலஸுக்ஷ்மாதி : \n" +
          "ஓம் கரணாய நம : \n" +
          "ஓம் அம்ரகாஸாய நம : \n" +
          "ஓம் ப்ரகாஸாத்மநே நம : \n" +
          "ஓம் கநாய நம : \n" +
          "ஓம் கநகபூஷணாய நம : \n" +
          "ஓம் விநிஸ்துத்யாய நம : \n" +
          "ஓம் வித்வஜ்ஜனமனோஹராய நம : \n" +
          "ஓம் ஸவப்ரகாஸாய நம : \n" +
          "ஓம் சாரணாய நம : \n" +
          "ஓம் சாருபூஷணாய நம : \n" +
          "ஓம் வீதராகாய நம : \n" +
          "ஓம் வீதபயாய நம : \n" +
          "ஓம் விஸுத்தகநப்ரதாய நம : \n" +
          "ஓம் பந்து ப்ரியாய நம : \n" +
          "ஓம் ஸெளம்யவத்ஸரஸக்ஞாதாய நம : \n" +
          "ஓம் ஸோமப்ரியக்ராய நம : \n" +
          "ஓம் சுகிநே நம : \n" +
          "ஓம் ஸிம்ஹாதிரூடாய நம : \n" +
          "ஓம் ஸர்வக்ஞாய நம : \n" +
          "ஓம் ஸிகிவர்ணா நம : \n" +
          "ஓம் ஸிவங்கராய நம : \n" +
          "ஓம் பீதாம்பராய நம : \n" +
          "ஓம் பீதவபுஷே நம : \n" +
          "ஓம் பீதச்சத்வாஜஞ்சிதாய நம : \n" +
          "ஓம் கட்கசர்மதராய நம : \n" +
          "ஓம் க்ராயாத்ரே நம : \n" +
          "ஓம் கலுஷஹார்காய நம : \n" +
          "ஓம் ஆத்ரேயகோத்ரஜாய நம : \n" +
          "ஓம் அத்யந்தவிநயாய நம : \n" +
          "ஓம் விஸ்வபாவநாய நம : \n" +
          "ஓம் சாம்பேயபுஷ்பஸங்காஸாக நம : \n" +
          "ஓம் முக்தாய நம : \n" +
          "ஓம் பாணமண்டஸம்ஸரிதாய நம : \n" +
          "ஓம் அர்கோஸநநிவாஸஸ்தாய நம : \n" +
          "ஓம் தர்க்கஸாஸ்த்ரவிசரதாய நம : \n" +
          "ஓம் ப்ரஸாந்தாய நம : \n" +
          "ஓம் ப்ரீதிஸம்யுக்தாய நம : \n" +
          "ஓம் ப்ரியக்ருதே நம : \n" +
          "ஓம் ப்ரிபபாஷணாய நம : \n" +
          "ஓம் மேதாவிநே நம : \n" +
          "ஓம் மாதவாஸக்தாய நம : \n" +
          "ஓம் மிதுநாதிபதயே நம : \n" +
          "ஓம் ஸுதியே நம : \n" +
          "ஓம் கந்யாராஸிப்ரியாய நம : \n" +
          "ஓம் காமப்ரதாய நம : \n" +
          "ஓம் கநபலாஸாயாய நம : \n" +
          "ஓம் புதக்ரஹாய நம :\n"),
  'guru': Ashtothram(
      'ஸ்ரீ குரு',
      'guru',
      "ஓம் குரவே நம\n" +
          "ஓம் குணாகராய நம\n" +
          "ஓம் கோப்த்ரே நம\n" +
          "ஓம் கோசராய நம\n" +
          "ஓம் கோபதிப்ரியாய நம\n" +
          "ஓம் குணிநே நம\n" +
          "ஓம் குணவதாம்ச்ரேஷ்டாய நம\n" +
          "ஓம் குரூணாம் குரவே நம\n" +
          "ஓம் அவ்யயாய நம\n" +
          "ஓம் ஜேத்ரே நம\n" +
          "\n" +
          "ஓம் ஜயந்தாய நம\n" +
          "ஓம் ஜயதாய நம\n" +
          "ஓம் ஜீவாய நம\n" +
          "ஓம் அநந்தாய நம\n" +
          "ஓம் ஜயாஹாய நம\n" +
          "ஓம் ஆங்கிரஸாய நம\n" +
          "ஓம் அத்வராஸக்தாய நம\n" +
          "ஓம் விவிக்தாப நம\n" +
          "ஓம் அத்வரக்ருத்பராய நம\n" +
          "ஒம் வாசஸ்பதயே நம\n" +
          "\n" +
          "ஓம் வசிநே நம\n" +
          "ஓம் வச்யாய நம\n" +
          "ஓம் வரிஷ்டாய நம\n" +
          "ஓம் வர்க்விசக்ஷணாய நம\n" +
          "ஓம் சித்த சுத்திகராய நம\n" +
          "ஓம் ஸ்ரீமதே நம\n" +
          "ஓம் சைத்ராய நம\n" +
          "ஓம் சித்ர சிகண்டிஜாய நம\n" +
          "ஓம் ப்ருஹத்ரதாய நம\n" +
          "ஓம் ப்ருஹத்பாநவே நம\n" +
          "\n" +
          "ஓம் ப்ருஹஸ்பதயே நம\n" +
          "ஓம் அபீஷ்டதாய நம\n" +
          "ஓம் ஸுராசார்யாய நம\n" +
          "ஓம் ஸுராராத்யாய நம\n" +
          "ஓம் ஸுரகார்ய க்ருதோத்யமாய நம\n" +
          "ஓம் கீர்வாண பேக்ஷகாய நம\n" +
          "ஓம் தந்யாய நம\n" +
          "ஓம் கீஷ்பதயே நம\n" +
          "ஓம் கிரிசாய நம\n" +
          "ஓம் அநகாய நம\n" +
          "\n" +
          "ஓம் தீவராய நம\n" +
          "ஓம் திஷணாய நம\n" +
          "ஓம் திவ்ய பூஷணாய நம\n" +
          "ஓம் தேவபூஜிதாய நம\n" +
          "ஓம் தநுர்த்தராய நம\n" +
          "ஓம் தைத்ய ஹந்த்ரே நம\n" +
          "ஓம் தயாஸாராய நம\n" +
          "ஓம் தயாகராய நம\n" +
          "ஓம் தாரித்ர்ய நாசநாய நம\n" +
          "ஓம் தந்யாய நம\n" +
          "\n" +
          "ஓம் தக்ஷிணாய நஸம்பவாய நம\n" +
          "ஓம் தநுர்மீநாதிபாய நம\n" +
          "ஓம் தேவயா நம\n" +
          "ஓம் தநுர்பாண தாரய நம\n" +
          "ஓம் ஹரயே நம\n" +
          "ஓம் அங்கிரோவர்ஷஸவஞ்ஜாதாய நம\n" +
          "ஓம் அங்கிர: குலஸம்பவாய நம\n" +
          "ஓம் ஸிந்துதேசாதிபாய நம\n" +
          "ஓம் தீமதே நம\n" +
          "ஓம் ஸ்வர்ணகாயாய நம\n" +
          "\n" +
          "ஓம் சதுரபுஜாய நம\n" +
          "ஓம் ஹேமாந்ததாய நம\n" +
          "ஓம் ஹேமவபுஸே நம\n" +
          "ஓம் ஹேமபூஷணபூஷிதாய நம\n" +
          "ஓம் புஷ்யநாதாய நம\n" +
          "ஓம் புஷ்யராகமணிமண்டந நம\n" +
          "ஓம் மண்டிதாய நம\n" +
          "ஓம் காசபுஸ்பஸமா நாபாய நம\n" +
          "ஓம் இந்த்ராத்யமர ஸங்கபாய நம\n" +
          "ஓம் அஸமாநபலாய நம\n" +
          "ஓம் ஸத்வ குணஸம்பத்விபா வஸவே நம\n" +
          "\n" +
          "ஓம் பூஸுராபீஷ்டதாய நம\n" +
          "ஓம் பூரியசஸே நம\n" +
          "ஓம் புண்யவிவர்த்தநாய நம\n" +
          "ஓம் தர்மரூபாய நம\n" +
          "ஓம் தநாத்யக்ஷõய நம\n" +
          "ஓம் தநதாய நம\n" +
          "ஓம் தர்மபாலநாய நம\n" +
          "ஓம் ஸர்வவேதார்த்தத்வஜ்ஞாய நம\n" +
          "ஓம் ஸர்வாபதவிநிவாரகாய நம\n" +
          "ஓம் ஸர்வபாப ப்ரசமநாய நம\n" +
          "\n" +
          "ஓம் ஸ்வமாநுகதாமராய நம\n" +
          "ஓம் ரிக்வேத பாரகாய நம\n" +
          "ஓம் ரிக்ஷராசிமாக்கப்ரசாரவதே நம\n" +
          "ஓம் ஸதா நந்தாய நம\n" +
          "ஓம் ஸத்யஸந்தாய நம\n" +
          "ஓம் ஸத்யஸங்கல்பமாநஸாய நம\n" +
          "ஓம் ஸர்வாகமஜ்ஞாய நம\n" +
          "ஓம் ஸர்வஜ்ஞாய நம\n" +
          "ஓம் ஸர்வவேதாந்த விதே நம\n" +
          "ஓம் ப்ரஹ்மபுத்ராய நம\n" +
          "\n" +
          "ஓம் ப்ராஹ்மணேசாய நம\n" +
          "ஓம் ப்ரஹ்மவித்யா விசாரதாய நம\n" +
          "ஓம் ஸமாநாதிகநிர்முக்தாய நம\n" +
          "ஓம் ஸர்வலோக வம்சவதாய நம\n" +
          "ஓம் ஸஸுராஸுரகந்தர்வ வந்திதாய நம\n" +
          "ஓம் ஸத்யாபாஷணாய நம\n" +
          "ஓம் ப்ருஹஸ் பதயே நம\n" +
          "ஓம் ஸுராசார்யாய நம\n" +
          "ஓம் தயாவதே நம\n" +
          "ஓம் சுபலக்ஷணாய நம\n" +
          "\n" +
          "ஓம் லோகத்ரயகுரவே நம\n" +
          "ஓம் ஸ்ரீமதே நம\n" +
          "ஓம் ஸர்வகாய நம\n" +
          "ஓம் ஸர்வதோவிபவே நம\n" +
          "ஓம் ஸர்வேச்வராய நம\n" +
          "ஓம் ஸர்வதாய நம\n" +
          "ஓம் ஸர்வதா துஷ்டாய நம\n" +
          "ஓம் ஸர்வபூஜிதாய நம\n"),
  'sukra': Ashtothram(
      'ஸ்ரீ சுக்ரன்',
      'sukra',
      "ஓம் சுக்ராய நம\n" +
          "ஓம் சுசயே நம\n" +
          "ஓம் சுபகுணாய நம\n" +
          "ஓம் சுபதாய நம\n" +
          "ஓம் ஸூபலக்ஷணாய நம\n" +
          "ஓம் சோபநாக்ஷõய நம\n" +
          "ஓம் சுப்ரவாஹாய நம\n" +
          "ஓம் சுத்தஸ்படிக பாஸ்வராய நம\n" +
          "ஓம் தீனார்த்தி ஹாரகாய நம\n" +
          "ஓம் தைத்ய குரவே நம\n" +
          "\n" +
          "ஓம் தேவாபி வந்திதாய நம\n" +
          "ஓம் காவ்யாஸக்தாய நம\n" +
          "ஓம் காமபாலாய நம\n" +
          "ஓம் கவயே நம\n" +
          "ஓம் கல்யாண தாயகாய நம\n" +
          "ஓம் பத்ரமூர்த்தயே நம\n" +
          "ஓம் பத்ரருணாய நம\n" +
          "ஓம் பார்க்கவாய நம\n" +
          "ஓம் பக்த பாலநாய நம\n" +
          "ஓம் போகதாய நம\n" +
          "\n" +
          "ஓம் புவநாத்யக்ஷõய நம\n" +
          "ஓம் புக்திமுக்தி பலப்ரதாய நம\n" +
          "ஓம் சாரு சீலாய நம\n" +
          "ஓம் சாரு ரூபாய நம\n" +
          "ஓம் சாருசந்த்ர நிபாநநாய நம\n" +
          "ஓம் நிதயே நம\n" +
          "ஓம் நிகில சாஸ்த்ரஜ்ஞாய நம\n" +
          "ஓம் நீதி வித்யாதுரந் தராய நம\n" +
          "ஓம் ஸர்வ லக்ஷண ஸம்பந்தநாய நம\n" +
          "ஓம் ஸர்வாவகுண வர்ஜிதாய நம\n" +
          "\n" +
          "ஓம் ஸமாநாதிக நிர்முக்தாய நம\n" +
          "ஓம் ஸகலாகம பாரகாய நம\n" +
          "ஓம் ப்ருகவே நம\n" +
          "ஓம் போக கராய நம\n" +
          "ஓம் பூமிஸுர பாலநதத்பராய நம\n" +
          "ஓம் மநஸவிநே நம\n" +
          "ஓம் மாநதாய நம\n" +
          "ஓம் மாந்யாய நம\n" +
          "ஓம் மாயாதீதாய நம\n" +
          "ஓம் மஹாயசஸே நம\n" +
          "\n" +
          "ஓம் பலிப்ரஸந்நாய நம\n" +
          "ஓம் அபயதாய நம\n" +
          "ஓம் பலிநே நம\n" +
          "ஓம் ஸத்ய பராக்ரமாய நம\n" +
          "ஓம் பவபாச பரித்யாகாய நம\n" +
          "ஓம் பலிபந்த விமோசகாய நம\n" +
          "ஓம் கநாசாயா நம\n" +
          "ஓம் கநாத் சக்ஷõய நம\n" +
          "ஓம் கம்புக்ரீவாய நம\n" +
          "ஓம் கலாதராய நம\n" +
          "\n" +
          "ஓம் காருண்யரஸ ஸம்பூர்ணாய நம\n" +
          "ஓம் கல்யாண குணவர்த்தநாய நம\n" +
          "ஓம் ச்வேதாம்பராய நம\n" +
          "ஓம் ச்வேதாம்பராய நம\n" +
          "ஓம் ச்வேதவபுஷே நம\n" +
          "ஓம் சதுர்புஜ ஸமந்விதாய நம\n" +
          "ஓம் அக்ஷமாலாதராய நம\n" +
          "ஓம் அசிந்த்யாய நம\n" +
          "ஓம் அக்ஷீண குணபாஸுராய நம\n" +
          "ஓம் நக்ஷத்ர கணஸஞ்சாராய நம\n" +
          "ஓம் நயதாய நம\n" +
          "\n" +
          "ஓம் நீதிமார்கதாய நம\n" +
          "ஓம் வர்ஷப்ரதாய நம\n" +
          "ஓம் ஹ்ருஷீகேசாயா நம\n" +
          "ஓம் க்லேச நாசகராய நம\n" +
          "ஒம் கவயே நம\n" +
          "ஓம் சிந்தி தார்த்த ப்ரதாய நம\n" +
          "ஓம் சாந்தமதயே நம\n" +
          "ஓம் சித்த ஸமாதிக்ருதே நம\n" +
          "ஓம் ஆதிவ்யாதி ஹாரய நம\n" +
          "ஓம் பூரி விக்ரமாய நம\n" +
          "\n" +
          "ஓம் புண்யதாயகாய நம\n" +
          "ஓம் புருõண புருஸாய நம\n" +
          "ஓம் பூஜ்யாய நம\n" +
          "ஓம் புருஹூதாதி ஸந்நுதாய நம\n" +
          "ஓம் அஜேயாய நம\n" +
          "ஓம் விஜிதாராதயே நம\n" +
          "ஓம் விவித பரணோஜ்வலாய நம\n" +
          "ஓம் குந்த்புஷ்ப ப்ரதீகாசாய நம\n" +
          "ஓம் மந்த ஹாஸாய நம\n" +
          "ஓம் மஹாமதயே நம\n" +
          "\n" +
          "ஓம் முக்தா பல ஸமாநாபாய நம\n" +
          "ஓம் முக்திதாய நம\n" +
          "ஓம் முநிஸந்துதாய நம\n" +
          "ஓம் ரத்ந ஸிம்ஹாஸநா ரூடாய நம\n" +
          "ஓம் ரதஸ்த்தாய நம\n" +
          "ஓம் ரஜதப்ரபாய நம\n" +
          "ஓம் ஸூர்யப்ராக்தேசஸஞ்சராய நம\n" +
          "ஓம் ஸுர சத்ருஸுஹ்ருதே நம\n" +
          "ஓம் கவயே நம\n" +
          "ஓம் துலாவ்ருஷ பராசீசாய நம\n" +
          "\n" +
          "ஓம் துர்த்தராய நம\n" +
          "ஓம் தர்மபாலகாய நம\n" +
          "ஓம் பாக்யதாய நம\n" +
          "ஓம் பவ்ய பாசவிமோசகாய நம\n" +
          "ஓம் கௌடதே சேச்வராய நம\n" +
          "ஓம் கோப்த்ரே நம\n" +
          "ஓம் குணிநே நம\n" +
          "ஓம் குணவிபூஷணாய நம\n" +
          "ஓம் ஜ்யேஷ்டா நக்ஷத்ர நம\n" +
          "ஓம் ஸம்பூதாய நம\n" +
          "\n" +
          "ஓம் ஜ்யோஷ்டாய நம\n" +
          "ஓம் ச்ரேஷ்டாய நம\n" +
          "ஓம் சுசிஸ்மிதாய நம\n" +
          "ஓம் அபவர்கப்ராதய நம\n" +
          "ஓம் அநந்தாய நம\n" +
          "ஓம் ஸந்தா ந பலதாயகாய நம\n" +
          "ஓம் ஸர்வைச்வர்ய ப்ரதாய நம\n" +
          "ஓம் ஸர்வ கீர்வாணகண நம\n" +
          "ஓம் ஸந்நுதாய நம\n"),
  'sani': Ashtothram(
      'ஸ்ரீ சனி',
      'sani',
      "ஓம் ஶநைஶ்சராய நம: ॥\n" +
          "ஓம் ஶாந்தாய நம: ॥\n" +
          "ஓம் ஸர்வாபீ⁴ஷ்டப்ரதா³யிநே நம: ॥\n" +
          "ஓம் ஶரண்யாய நம: ॥\n" +
          "ஓம் வரேண்யாய நம: ॥\n" +
          "ஓம் ஸர்வேஶாய நம: ॥\n" +
          "ஓம் ஸௌம்யாய நம: ॥\n" +
          "ஓம் ஸுரவந்த்³யாய நம: ॥\n" +
          "ஓம் ஸுரலோகவிஹாரிணே நம: ॥\n" +
          "ஓம் ஸுகா²ஸநோபவிஷ்டாய நம: ॥ 10 ॥\n" +
          "ஓம் ஸுந்த³ராய நம: ॥\n" +
          "ஓம் க⁴நாய நம: ॥\n" +
          "ஓம் க⁴நரூபாய நம: ॥\n" +
          "ஓம் க⁴நாப⁴ரணதா⁴ரிணே நம: ॥\n" +
          "ஓம் க⁴நஸாரவிலேபாய நம: ॥\n" +
          "ஓம் க²த்³யோதாய நம: ॥\n" +
          "ஓம் மந்தா³ய நம: ॥\n" +
          "ஓம் மந்த³சேஷ்டாய நம: ॥\n" +
          "ஓம் மஹநீயகு³ணாத்மநே நம: ॥\n" +
          "ஓம் மர்த்யபாவநபதா³ய நம: ॥ 20 ॥\n" +
          "ஓம் மஹேஶாய நம: ॥\n" +
          "ஓம் சா²யாபுத்ராய நம: ॥\n" +
          "ஓம் ஶர்வாய நம: ॥\n" +
          "ஓம் ஶததூணீரதா⁴ரிணே நம: ॥\n" +
          "ஓம் சரஸ்தி²ரஸ்வபா⁴வாய நம: ॥\n" +
          "ஓம் அசஞ்சலாய நம: ॥\n" +
          "ஓம் நீலவர்ணாய நம: ॥\n" +
          "ஓம் நித்யாய நம: ॥\n" +
          "ஓம் நீலாஞ்ஜநநிபா⁴ய நம: ॥\n" +
          "ஓம் நீலாம்ப³ரவிபூ⁴ஶணாய நம: ॥ 30 ॥\n" +
          "ஓம் நிஶ்சலாய நம: ॥\n" +
          "ஓம் வேத்³யாய நம: ॥\n" +
          "ஓம் விதி⁴ரூபாய நம: ॥\n" +
          "ஓம் விரோதா⁴தா⁴ரபூ⁴மயே நம: ॥\n" +
          "ஓம் பே⁴தா³ஸ்பத³ஸ்வபா⁴வாய நம: ॥\n" +
          "ஓம் வஜ்ரதே³ஹாய நம: ॥\n" +
          "ஓம் வைராக்³யதா³ய நம: ॥\n" +
          "ஓம் வீராய நம: ॥\n" +
          "ஓம் வீதரோக³ப⁴யாய நம: ॥\n" +
          "ஓம் விபத்பரம்பரேஶாய நம: ॥ 40 ॥\n" +
          "ஓம் விஶ்வவந்த்³யாய நம: ॥\n" +
          "ஓம் க்³ருʼத்⁴நவாஹாய நம: ॥\n" +
          "ஓம் கூ³டா⁴ய நம: ॥\n" +
          "ஓம் கூர்மாங்கா³ய நம: ॥\n" +
          "ஓம் குரூபிணே நம: ॥\n" +
          "ஓம் குத்ஸிதாய நம: ॥\n" +
          "ஓம் கு³ணாட்⁴யாய நம: ॥\n" +
          "ஓம் கோ³சராய நம: ॥\n" +
          "ஓம் அவித்³யாமூலநாஶாய நம: ॥\n" +
          "ஓம் வித்³யாவித்³யாஸ்வரூபிணே நம: ॥ 50 ॥\n" +
          "ஓம் ஆயுஷ்யகாரணாய நம: ॥\n" +
          "ஓம் ஆபது³த்³த⁴ர்த்ரே நம: ॥\n" +
          "ஓம் விஷ்ணுப⁴க்தாய நம: ॥\n" +
          "ஓம் வஶிநே நம: ॥\n" +
          "ஓம் விவிதா⁴க³மவேதி³நே நம: ॥\n" +
          "ஓம் விதி⁴ஸ்துத்யாய நம: ॥\n" +
          "ஓம் வந்த்³யாய நம: ॥\n" +
          "ஓம் விரூபாக்ஷாய நம: ॥\n" +
          "ஓம் வரிஷ்டா²ய நம: ॥\n" +
          "ஓம் க³ரிஷ்டா²ய நம: ॥ 60 ॥\n" +
          "ஓம் வஜ்ராங்குஶத⁴ராய நம: ॥\n" +
          "ஓம் வரதா³ப⁴யஹஸ்தாய நம: ॥\n" +
          "ஓம் வாமநாய நம: ॥\n" +
          "ஓம் ஜ்யேஷ்டா²பத்நீஸமேதாய நம: ॥\n" +
          "ஓம் ஶ்ரேஷ்டா²ய நம: ॥\n" +
          "ஓம் மிதபா⁴ஷிணே நம: ॥\n" +
          "ஓம் கஷ்டௌக⁴நாஶகர்த்ரே நம: ॥\n" +
          "ஓம் புஷ்டிதா³ய நம: ॥\n" +
          "ஓம் ஸ்துத்யாய நம: ॥\n" +
          "ஓம் ஸ்தோத்ரக³ம்யாய நம: ॥ 70 ॥\n" +
          "ஓம் ப⁴க்திவஶ்யாய நம: ॥\n" +
          "ஓம் பா⁴நவே நம: ॥\n" +
          "ஓம் பா⁴நுபுத்ராய நம: ॥\n" +
          "ஓம் ப⁴வ்யாய நம: ॥\n" +
          "ஓம் பாவநாய நம: ॥\n" +
          "ஓம் த⁴நுர்மண்ட³லஸம்ஸ்தா²ய நம: ॥\n" +
          "ஓம் த⁴நதா³ய நம: ॥\n" +
          "ஓம் த⁴நுஷ்மதே நம: ॥\n" +
          "ஓம் தநுப்ரகாஶதே³ஹாய நம: ॥\n" +
          "ஓம் தாமஸாய நம: ॥ 80 ॥\n" +
          "ஓம் அஶேஷஜநவந்த்³யாய நம: ॥\n" +
          "ஓம் விஶேஶப²லதா³யிநே நம: ॥\n" +
          "ஓம் வஶீக்ருʼதஜநேஶாய நம: ॥\n" +
          "ஓம் பஶூநாம் பதயே நம: ॥\n" +
          "ஓம் கே²சராய நம: ॥\n" +
          "ஓம் க²கே³ஶாய நம: ॥\n" +
          "ஓம் க⁴நநீலாம்ப³ராய நம: ॥\n" +
          "ஓம் காடி²ந்யமாநஸாய நம: ॥\n" +
          "ஓம் ஆர்யக³ணஸ்துத்யாய நம: ॥\n" +
          "ஓம் நீலச்ச²த்ராய நம: ॥ 90 ॥\n" +
          "ஓம் நித்யாய நம: ॥\n" +
          "ஓம் நிர்கு³ணாய நம: ॥\n" +
          "ஓம் கு³ணாத்மநே நம: ॥\n" +
          "ஓம் நிராமயாய நம: ॥\n" +
          "ஓம் நிந்த்³யாய நம: ॥\n" +
          "ஓம் வந்த³நீயாய நம: ॥\n" +
          "ஓம் தீ⁴ராய நம: ॥\n" +
          "ஓம் தி³வ்யதே³ஹாய நம: ॥\n" +
          "ஓம் தீ³நார்திஹரணாய நம: ॥\n" +
          "ஓம் தை³ந்யநாஶகராய நம: ॥ 100 ॥\n" +
          "ஓம் ஆர்யஜநக³ண்யாய நம: ॥\n" +
          "ஓம் க்ரூராய நம: ॥\n" +
          "ஓம் க்ரூரசேஷ்டாய நம: ॥\n" +
          "ஓம் காமக்ரோத⁴கராய நம: ॥\n" +
          "ஓம் கலத்ரபுத்ரஶத்ருத்வகாரணாய நம: ॥\n" +
          "ஓம் பரிபோஷிதப⁴க்தாய நம: ॥\n" +
          "ஓம் பரபீ⁴திஹராய நம: ॥\n" +
          "ஓம் ப⁴க்தஸங்க⁴மநோঽபீ⁴ஷ்டப²லதா³ய நம: ॥\n"),
  'rahu': Ashtothram(
      'ஸ்ரீ இராகு',
      'rahu',
      "ஓம் ராஹவே நம\n" +
          "ஓம் ஸைம்ஹி கேயாய நம\n" +
          "ஓம் விதுந்துதாய நம\n" +
          "ஓம் ஸுசரத்ரவே நம\n" +
          "ஓம் தமஸே நம\n" +
          "ஓம் பணிநே நம\n" +
          "ஓம் கார்க்யாயநாய நம\n" +
          "ஓம் ஸுராரயே நம\n" +
          "ஓம் நீலஜீமுதஸங்காசாய நம\n" +
          "ஓம் சதுர்ப்புஜாய நம\n" +
          "\n" +
          "ஓம் கட்க கேடகதாரிணே நம\n" +
          "ஓம் வரதாயக ஹஸ்தாய நம\n" +
          "ஓம் சூலாயுதாய நம\n" +
          "ஓம் மேக வர்ணாய நம\n" +
          "ஓம் க்ருஷ்ணத்வஜபதாகவதே நம\n" +
          "ஓம் தக்ஷிணாசாமுகரதாய நம\n" +
          "ஓம் தீக்ஷ்ணதம்ஷ்டராகராளகாய நம\n" +
          "ஓம் சூர்ப்பாகாராஸநஸ்த்தாய நம\n" +
          "ஓம் கோமேதாபரண ப்ரியாய நம\n" +
          "ஓம் மாஷப்ரியாய நம\n" +
          "\n" +
          "ஓம் காச்யபர்ஷி நந்தநாய நம\n" +
          "ஓம் புஜகேச்வராய நம\n" +
          "ஓம் உல்கா பாதயித்ரே நம\n" +
          "ஓம் சூலிநே நம\n" +
          "ஓம் நிதிபாய நம\n" +
          "ஓம் க்ருஷ்ண ஸர்பராஜே நம\n" +
          "ஓம் விஷஜ்வாலா வ்ருதாஸ்யாய நம\n" +
          "ஓம் அர்த்தசரீராய நம\n" +
          "ஓம் சாத்ரவ ப்ரதாய நம\n" +
          "ஓம் ரவீந்து பீகராய நம\n" +
          "\n" +
          "ஓம் சாயாஸ்வரூபிணே நம\n" +
          "ஓம் கடிநாங்க காய நம\n" +
          "ஓம் த்விஷச்சக்ரச் சேதகாய நம\n" +
          "ஓம் கராளாஸ்யாய நம\n" +
          "ஓம் பயங்கராய நம\n" +
          "ஓம் க்ரூரகர்மணே நம\n" +
          "ஓம் தமோ ரூபாய நம\n" +
          "ஓம் ச்யா மாத்மநே நம\n" +
          "ஓம் நீலலோஹிதாய நம\n" +
          "ஓம் கிரீடிநே நம\n" +
          "\n" +
          "ஓம் நீலவஸநாய நம\n" +
          "ஓம் சநிஸாமந்த்தவர்த்மகாய நம\n" +
          "ஓம் சண்டால வர்ணாய நம\n" +
          "ஓம் அச்வய்ருக்ஷபவாய நம\n" +
          "ஓம் மேக்ஷ பவாய நம\n" +
          "ஓம் சநிவத்பலதாய நம\n" +
          "ஓம் சூராய நம\n" +
          "ஓம் அபஸவ்ய கதயே நம\n" +
          "ஓம் உபாரககராய நம\n" +
          "ஓம் ஸோமஸூர்யச்ச விமர்தகாய நம\n" +
          "\n" +
          "ஓம் நீலபுஷ்ப விஹாராய நம\n" +
          "ஓம் க்ரஹ ச்ரேஷ்டாய நம\n" +
          "ஓம் அஷ்டமக்ராஹாய நம\n" +
          "ஓம் கபந்த மாத்ர தேஹாய நம\n" +
          "ஓம் யாதுதாநகுலோத்பவயே நம\n" +
          "ஓம் கோவிந்த வரபாத்ராய நம\n" +
          "ஓம் தேவஜாதிப்ரவிஷ் டகாய நம\n" +
          "ஓம் க்ரூராய நம\n" +
          "ஓம் கோராய நம\n" +
          "ஓம் சநேர் மித்ராய நம\n" +
          "\n" +
          "ஓம் சுக்ரமித்ராய நம\n" +
          "ஓம் அகோசராய நம\n" +
          "ஓம் மாநே கங்கா ஸ்நாந தாத்ரே நம\n" +
          "ஓம் ஸ்வக்ருஹே ப்ரபலாட்யதாய நம\n" +
          "ஓம் ஸத்க்ருஹேந்ய பலத்ருதே நம\n" +
          "ஓம் சதுர்த்தே மாத்ருநாச காய நம\n" +
          "ஓம் சந்த்ரயுக்தே சண்டால ஜாதி நம\n" +
          "ஓம் ஸூசகாய நம\n" +
          "ஓம் ஸிம்ஹஜந்மநே நம\n" +
          "ஓம் ராஜ்யதாத்ரே நம\n" +
          "\n" +
          "ஓம் மஹாகாயாய நம\n" +
          "ஓம் ஜந்மகர்த்ரே நம\n" +
          "ஓம் விதுரிபவே நம\n" +
          "ஓம் மாதகாஜ்ஞாநதாய நம\n" +
          "ஓம் ஜந்மகந்யாரஜ்யதத்ரே நம\n" +
          "ஓம் ஜந்மஹாநிதாய நம\n" +
          "ஓம் நவமே பித்ரு ஹந்த்ரே நம\n" +
          "ஓம் பஞ்சமேசோகதாயகாய நம\n" +
          "ஓம் த்யூநே களத்ர ஹந்த்ரே நம\n" +
          "ஓம் ஸப்த மேகலஹப்ரதாய நம\n" +
          "ஓம் ஷஷ்டே வித்த தாத்ரே நம\n" +
          "\n" +
          "ஓம் சதுரத்தேவைர தாயகாய நம\n" +
          "ஓம் நவமே பாபதாத்ரே நம\n" +
          "ஒம் தசமே சோகதாயகாய நம\n" +
          "ஓம் ஆதௌ யச: ப்ரதாத்ரே நம\n" +
          "ஓம் அந்தே வைப்ரதாயகாய நம\n" +
          "ஓம் காலாத்மநே நம\n" +
          "ஓம் கோசரசராய நம\n" +
          "ஓம் தநே ககுத்ப்ரதாய நம\n" +
          "ஓம் பஞ்சமேதிஷணை ச்ருங்கதாய நம\n" +
          "ஓம் ஸர்வபாநவே நம\n" +
          "\n" +
          "ஓம் பலிநே நம\n" +
          "ஓம் மஹாஸெளக்யப்ரதாயிநே நம\n" +
          "ஓம் சந்த்ர வைரிணே நம\n" +
          "ஓம் சாச்வதாய நம\n" +
          "ஓம் ஸுர சத்ரவே நம\n" +
          "ஓம் பாபக்ரஹாய நம\n" +
          "ஓம் சாம்பவாய நம\n" +
          "ஓம் பூஜ்யகாய நம\n" +
          "ஓம் பாடீரபூரணாய நம\n" +
          "ஓம் பைடீநஸகுலோத்பவாய நம\n" +
          "\n" +
          "ஓம் பக்தரக்ஷõய நம\n" +
          "ஓம் ராஹு மூர்த்தயே நம\n" +
          "ஓம் ஸர்வாபீஷ்ட பலப்ரதாய\n" +
          "ஓம் தீர்க்காய நம\n" +
          "ஓம் க்ருஷ்ணாய நம\n" +
          "ஓம் அதநவே நம\n" +
          "ஓம் விஷ்ணு நேத்ராரயே நம\n" +
          "ஓம் தேவாய நம\n" +
          "ஓம் தாநவாய நம\n"),
  'kethu': Ashtothram(
      'ஸ்ரீ கேது',
      'kethu',
      "ஓம் கேதவே நம꞉ |\n" +
          "ஓம் ஸ்தூ²லஶிரஸே நம꞉ |\n" +
          "ஓம் ஶிரோமாத்ராய நம꞉ |\n" +
          "ஓம் த்⁴வஜாக்ருதயே நம꞉ |\n" +
          "ஓம் நவக்³ரஹயுதாய நம꞉ |\n" +
          "ஓம் ஸிம்ஹிகாஸுரீக³ர்ப⁴ஸம்ப⁴வாய நம꞉ |\n" +
          "ஓம் மஹாபீ⁴திகராய நம꞉ |\n" +
          "ஓம் சித்ரவர்ணாய நம꞉ |\n" +
          "ஓம் பிங்க³ளாக்ஷகாய நம꞉ | 9\n" +
          "\n" +
          "ஓம் ப²லோதூ⁴ம்ரஸங்காஶாய நம꞉ |\n" +
          "ஓம் தீக்ஷ்ணத³ம்ஷ்ட்ராய நம꞉ |\n" +
          "ஓம் மஹோரகா³ய நம꞉ |\n" +
          "ஓம் ரக்தனேத்ராய நம꞉ |\n" +
          "ஓம் சித்ரகாரிணே நம꞉ |\n" +
          "ஓம் தீவ்ரகோபாய நம꞉ |\n" +
          "ஓம் மஹாஸுராய நம꞉ |\n" +
          "ஓம் க்ரூரகண்டா²ய நம꞉ |\n" +
          "ஓம் க்ரோத⁴னித⁴யே நம꞉ | 18\n" +
          "\n" +
          "ஓம் சா²யாக்³ரஹவிஶேஷகாய நம꞉ |\n" +
          "ஓம் அந்த்யக்³ரஹாய நம꞉ |\n" +
          "ஓம் மஹாஶீர்ஷாய நம꞉ |\n" +
          "ஓம் ஸூர்யாரயே நம꞉ |\n" +
          "ஓம் புஷ்பவத்³க்³ரஹிணே நம꞉ |\n" +
          "ஓம் வரத³ஹஸ்தாய நம꞉ |\n" +
          "ஓம் க³தா³பாணயே நம꞉ |\n" +
          "ஓம் சித்ரவஸ்த்ரத⁴ராய நம꞉ |\n" +
          "ஓம் சித்ரத்⁴வஜபதாகாய நம꞉ | 27\n" +
          "\n" +
          "ஓம் கோ⁴ராய நம꞉ |\n" +
          "ஓம் சித்ரரதா²ய நம꞉ |\n" +
          "ஓம் ஶிகி²னே நம꞉ |\n" +
          "ஓம் குளுத்த²ப⁴க்ஷகாய நம꞉ |\n" +
          "ஓம் வைடூ³ர்யாப⁴ரணாய நம꞉ |\n" +
          "ஓம் உத்பாதஜனகாய நம꞉ |\n" +
          "ஓம் ஶுக்ரமித்ராய நம꞉ |\n" +
          "ஓம் மந்த³ஸகா²ய நம꞉ |\n" +
          "ஓம் க³தா³த⁴ராய நம꞉ | 36\n" +
          "\n" +
          "ஓம் நாகபதயே நம꞉ |\n" +
          "ஓம் அந்தர்வேதீ³ஶ்வராய நம꞉ |\n" +
          "ஓம் ஜைமினிகோ³த்ரஜாய நம꞉ |\n" +
          "ஓம் சித்ரகு³ப்தாத்மனே நம꞉ |\n" +
          "ஓம் த³க்ஷிணாமுகா²ய நம꞉ |\n" +
          "ஓம் முகுந்த³வரபாத்ராய நம꞉ |\n" +
          "ஓம் மஹாஸுரகுலோத்³ப⁴வாய நம꞉ |\n" +
          "ஓம் க⁴னவர்ணாய நம꞉ |\n" +
          "ஓம் லம்ப³தே³ஹாய நம꞉ | 45\n" +
          "\n" +
          "ஓம் ம்ருத்யுபுத்ராய நம꞉ |\n" +
          "ஓம் உத்பாதரூபதா⁴ரிணே நம꞉ |\n" +
          "ஓம் அத்³ருஶ்யாய நம꞉ |\n" +
          "ஓம் காலாக்³னிஸன்னிபா⁴ய நம꞉ |\n" +
          "ஓம் ந்ருபீடா³ய நம꞉ |\n" +
          "ஓம் க்³ரஹகாரிணே நம꞉ |\n" +
          "ஓம் ஸர்வோபத்³ரவகாரகாய நம꞉ |\n" +
          "ஓம் சித்ரப்ரஸூதாய நம꞉ |\n" +
          "ஓம் அனலாய நம꞉ | 54\n" +
          "\n" +
          "ஓம் ஸர்வவ்யாதி⁴வினாஶகாய நம꞉ |\n" +
          "ஓம் அபஸவ்யப்ரசாரிணே நம꞉ |\n" +
          "ஓம் நவமே பாபதா³யகாய நம꞉ |\n" +
          "ஓம் பஞ்சமே ஶோகதா³ய நம꞉ |\n" +
          "ஓம் உபராக³கே²சராய நம꞉ |\n" +
          "ஓம் அதிபுருஷகர்மணே நம꞉ |\n" +
          "ஓம் துரீயே ஸுக²ப்ரதா³ய நம꞉ |\n" +
          "ஓம் த்ருதீயே வைரதா³ய நம꞉ |\n" +
          "ஓம் பாபக்³ரஹாய நம꞉ | 63\n" +
          "\n" +
          "ஓம் ஸ்போ²டககாரகாய நம꞉ |\n" +
          "ஓம் ப்ராணனாதா²ய நம꞉ |\n" +
          "ஓம் பஞ்சமே ஶ்ரமகாரகாய நம꞉ |\n" +
          "ஓம் த்³விதீயே(அ)ஸ்பு²டவக்³தா³த்ரே நம꞉ |\n" +
          "ஓம் விஷாகுலிதவக்த்ரகாய நம꞉ |\n" +
          "ஓம் காமரூபிணே நம꞉ |\n" +
          "ஓம் ஸிம்ஹத³ந்தாய நம꞉ |\n" +
          "ஓம் ஸத்யே அன்ருதவதே நம꞉ |\n" +
          "ஓம் சதுர்தே² மாத்ருனாஶாய நம꞉ | 72\n" +
          "\n" +
          "ஓம் நவமே பித்ருனாஶகாய நம꞉ |\n" +
          "ஓம் அந்த்யே வைரப்ரதா³ய நம꞉ |\n" +
          "ஓம் ஸுதானந்த³னப³ந்த⁴காய நம꞉ |\n" +
          "ஓம் ஸர்பாக்ஷிஜாதாய நம꞉ |\n" +
          "ஓம் அனங்கா³ய நம꞉ |\n" +
          "ஓம் கர்மராஶ்யுத்³ப⁴வாய நம꞉ |\n" +
          "ஓம் உபாந்தே கீர்திதா³ய நம꞉ |\n" +
          "ஓம் ஸப்தமே கலஹப்ரதா³ய நம꞉ |\n" +
          "ஓம் அஷ்டமே வ்யாதி⁴கர்த்ரே நம꞉ | 81\n" +
          "\n" +
          "ஓம் த⁴னே ப³ஹுஸுக²ப்ரதா³ய நம꞉ |\n" +
          "ஓம் ஜனநே ரோக³தா³ய நம꞉ |\n" +
          "ஓம் ஊர்த்⁴வமூர்த⁴ஜாய நம꞉ |\n" +
          "ஓம் க்³ரஹனாயகாய நம꞉ |\n" +
          "ஓம் பாபத்³ருஷ்டயே நம꞉ |\n" +
          "ஓம் கே²சராய நம꞉ |\n" +
          "ஓம் ஶாம்ப⁴வாய நம꞉ |\n" +
          "ஓம் அஶேஷபூஜிதாய நம꞉ |\n" +
          "ஓம் ஶாஶ்வதாய நம꞉ | 90\n" +
          "\n" +
          "ஓம் நடாய நம꞉ |\n" +
          "ஓம் ஶுபா⁴(அ)ஶுப⁴ப²லப்ரதா³ய நம꞉ |\n" +
          "ஓம் தூ⁴ம்ராய நம꞉ |\n" +
          "ஓம் ஸுதா⁴பாயினே நம꞉ |\n" +
          "ஓம் அஜிதாய நம꞉ |\n" +
          "ஓம் ப⁴க்தவத்ஸலாய நம꞉ |\n" +
          "ஓம் ஸிம்ஹாஸனாய நம꞉ |\n" +
          "ஓம் கேதுமூர்தயே நம꞉ |\n" +
          "ஓம் ரவீந்து³த்³யுதினாஶகாய நம꞉ | 99\n" +
          "\n" +
          "ஓம் அமராய நம꞉ |\n" +
          "ஓம் பீட³காய நம꞉ |\n" +
          "ஓம் அமர்த்யாய நம꞉ |\n" +
          "ஓம் விஷ்ணுத்³ருஷ்டாய நம꞉ |\n" +
          "ஓம் அஸுரேஶ்வராய நம꞉ |\n" +
          "ஓம் ப⁴க்தரக்ஷாய நம꞉ |\n" +
          "ஓம் வைசித்ர்யகபடஸ்யந்த³னாய நம꞉ |\n"),
};

List<Map> vishnu = [
  {'id': '108'},
  {'id': 'venkateshwarar'},
  {'id': 'vishnu'},
  {'id': 'lakshmi'},
  {'id': 'sudharshanam'},
  {'id': 'narasimha'},
  {'id': 'ramar'},
  {'id': 'seetha'},
  {'id': 'krishna'},
  {'id': 'aandal'},
  {'id': 'ramanujar'},
];

List<Map> vishnuparivar = [
  {'id': 'vishvakshenar'},
  {'id': 'aanjaneyan'},
  {'id': 'garuda'},
  {'id': 'hayagreeva'},
  {'id': 'varaha'},
  {'id': 'dhanvanthri'},
  {'id': 'sathyaNarayanan'},
  {'id': 'kuberar'},
];

List<Map> bramma = [
  {'id': 'bhramha'},
  {'id': 'sarashwathi'},
  {'id': 'gayathri'},
];

List<Map> siva = [
  {'id': 'sivan'},
  {'id': 'gowri'},
  {'id': 'vigneshwarar'},
  {'id': 'subramaniyan'},
  {'id': 'dhakshina'},
  {'id': 'mruthyunjayam'},
];

List<Map> navagraham = [
  {'id': 'navagraha'},
  {'id': 'surya'},
  {'id': 'chandra'},
  {'id': 'sevvai'},
  {'id': 'buthan'},
  {'id': 'guru'},
  {'id': 'sukra'},
  {'id': 'sani'},
  {'id': 'rahu'},
  {'id': 'kethu'},
];

List<Map> otherAshtothrams = [
  {'id': 'dhurga'},
  {'id': 'indrakshi'},
  {'id': 'varahi'},
  {'id': 'nagarajan'},
  {'id': 'prathyangara'},
  {'id': 'yamadharmarajan'},
  {'id': 'chithragupthan'},
  {'id': 'aiyappan'},
  {'id': 'bhairavar'},
  {'id': 'karuppar'},
  {'id': 'thulasi'},
  {'id': 'indiran'},
  {'id': 'varunan'},
];
