import 'package:ashtothram/datas/ashtothrams.dart';

List<Map> panchasuktam = [
  {'id': 'purushasuktam'},
  {'id': 'narayanasuktam'},
  {'id': 'vishnusuktam'},
  {'id': 'srisuktam'},
  {'id': 'boosuktam'},
  {'id': 'neelasuktam'},
];

List<Map> othersuktams = [
  {'id': 'shanthipanchakam'},
  {'id': 'bhagyasuktam'},
  {'id': 'medhasuktam'},
  {'id': 'bhrammasuktam'},
  // {'id': 'rudhrasuktam'},
  {'id': 'dhurgasuktam'},
  {'id': 'pavamanasuktam'},
  {'id': 'nakshatrasuktam'},
  {'id': 'gosuktam'},
  {'id': 'agnisuktam'},
  {'id': 'aayushyasuktam'},
  {'id': 'manthrapushpam'},
  {'id': 'manyusuktam'},
  {'id': 'navagrahasuktam'},
  {'id': 'sarpasuktam'},
  {'id': 'pithrusuktam'},
];

Map<String, Ashtothram> parayanams = {
  'shanthipanchakam': Ashtothram(
      'ஶாந்தி பஞ்சகம்',
      'shanthipanchakam',
      "ஶந் நோ மித்ர: ஶம் வருண: ஶந் நோ பவத்வர்யமா ஶந் ந\n" +
          "இந்த்ரோ ப்ருஹஸ்பதி: ஶந் நோ விஷ்ணுருருக்ரம: நமோ\n" +
          "ப்ரஹ்மணே நமஸ்தே வாயோ த்வமேவ ப்ரத்யக்ஷம் ப்ரஹ்மாஸி\n" +
          "த்வமேவ ப்ரத்யக்ஷம் ப்ரஹ்ம வதிஷ்யாமி ருதம் வதிஷ்யாமி\n" +
          "ஸத்யம் வதிஷ்யாமி தன்மாமவது தத்வக்தாரமவது அவது மாம்\n" +
          "அவது வக்தாரம்\n" +
          "\n" +
          "ஓம் ஶாந்தி: ஶாந்தி: ஶாந்தி:\n" +
          "\n" +
          "ஶந் நோ மித்ர: ஶம் வருண: ஶந் நோ பவத்வர்யமா ஶந் ந\n" +
          "இந்த்ரோ ப்ருஹஸ்பதி: ஶந் நோ விஷ்ணுருருக்ரம: நமோ\n" +
          "ப்ரஹ்மணே நமஸ்தே வாயோ த்வமேவ ப்ரத்யக்ஷம் ப்ரஹ்மாஸி\n" +
          "த்வாமேவ ப்ரத்யக்ஷம் ப்ரஹ்மா வாதிஷம் ருதம வாதிஷம் ஸத்யம\n" +
          "வாதிஷம் தன்மாமாவீத் தத்வக்தாரமாவீத் ஆவீன் மாம் ஆவீத்\n" +
          "வக்தாரம்\n" +
          "\n" +
          "ஓம் ஶாந்தி: ஶாந்தி: ஶாந்தி:\n" +
          "\n" +
          "ஸஹ நா வவது  ஸஹ நௌ புனக்து ஸஹ வீர்யம் கரவாவஹை\n" +
          "தேஜஸ்வி நாவதீதமஸ்து மா வித்விஷாவஹை\n" +
          "\n" +
          "ஓம் ஶாந்தி: ஶாந்தி: ஶாந்தி:\n" +
          "\n" +
          "நமோ வாசே யா சோதிதா யா சானுதிதா தஸ்யை வாசே நமோ நமோ\n" +
          "வாசே நமோ வாசஸ்பதயே நம ருஷிப்யோ மந்த்ரக்ருத்ப்யோ\n" +
          "மந்த்ரபதிப்யோ மா மாம்ருஷயோ மந்த்ரக்ருதோ மந்த்ரபதய: பராதுர்\n" +
          "மாஹம் ருஷீன்மந்த்ர-க்ருதோ மந்த்ரபதீன் பராதாம் வைஶ்வதேவீம்\n" +
          "வாசமுத்யாஸ ஶிவாமதஸ்தாஞ் ஜுஷ்டாம் தேவேப்ய: ஶர்ம மே\n" +
          "த்யௌ: ஶர்ம ப்ருதிவீ ஶர்ம விஸ்வமிதம் ஜகத்  ஶர்ம சந்த்ரஶ்ச\n" +
          "ஸூர்யஶ்ச ஶர்ம ப்ரஹ்ம ப்ரஜாபதீ பூதம் வதிஷ்யே புவனம்\n" +
          "வதிஷ்யே தேஜோ வதிஷ்யே தஸ்மா அஹமித- முபஸ்தரண\n" +
          "முபஸ்த்ருண உபஸ்தரணம் மே ப்ரஜாயை பஶூனாம் பூயா\n" +
          "துபஸ்தரண-மஹம் ப்ரஜாயை பஶூனாம் பூயாஸம் ப்ராணாபானௌ\n" +
          "ம்ருத்யோர்-மாபாதம் ப்ராணாபானௌ மா மாஹாஸிஷ்டம் மது மனிஷ்யே\n" +
          "மது ஜனிஷ்யே மது வக்ஷ்யாமி மது வதிஷ்யாமி மதுமதீம்\n" +
          "தேவேப்யோவாசமுத்யாஸ ஶுஶ்ரூஷேண்யாம் மனுஷ்யேப்யஸ்தம்\n" +
          "மா தேவா அவந்து ஶோபாயை பிதரோனுமதந்து\n" +
          "\n" +
          "ஓம் ஶாந்தி: ஶாந்தி: ஶாந்தி:\n" +
          "\n" +
          "தச்சம் யோராவ்ருணீமஹே காதும் யஜ்ஞாய காதும்\n" +
          "யஜ்ஞபதயே தைவீ: ஸ்வஸ்தி-ரஸ்து ந: ஸ்வஸ்திர்-மானுஷேப்ய:\n" +
          "ஊர்த்வம் ஜிகாது பேஷஜம் ஶந் நோ அஸ்து த்விபதே ஶம்\n" +
          "சதுஷ்பதே\n" +
          "\n" +
          "ஓம் ஶாந்தி: ஶாந்தி: ஶாந்தி:"),
  'purushasuktam': Ashtothram(
      'புருஷ ஸூக்தம்',
      'purushasuktam',
      "ஓம் ஸ॒ஹஸ்ர॑ஶீர்ஷா॒ புரு॑ஷ: । ஸ॒ஹ॒ஸ்ரா॒க்ஷ: ஸ॒ஹஸ்ர॑பாத் ।\n" +
          "ஸ பூ⁴மிம்॑ வி॒ஶ்வதோ॑ வ்ரு॒த்வா । அத்ய॑திஷ்ட²த்³த³ஶாங்கு³॒லம் ।\n" +
          "புரு॑ஷ ஏ॒வேத³க்³ம் ஸர்வம்᳚ । யத்³பூ⁴॒தம் யச்ச॒ ப⁴வ்யம்᳚ ।\n" +
          "உ॒தாம்ரு॑த॒த்வஸ்யேஶா॑ந: । ய॒த³ந்நே॑நாதி॒ரோஹ॑தி ।\n" +
          "ஏ॒தாவா॑நஸ்ய மஹி॒மா ।\n" +
          "அதோ॒ ஜ்யாயாக்³॑ஶ்ச॒ பூரு॑ஷ: ॥ 1 ॥\n" +
          "\n" +
          "பாதோ³᳚(அ)ஸ்ய॒ விஶ்வா॑ பூ⁴॒தாநி॑ । த்ரி॒பாத³॑ஸ்யா॒ம்ருதம்॑ தி³॒வி ।\n" +
          "த்ரி॒பாதூ³॒ர்த்⁴வ உதை³॒த்புரு॑ஷ: ।\n" +
          "பாதோ³᳚(அ)ஸ்யே॒ஹா(ஆ)ப⁴॑வா॒த்புந॑: ।\n" +
          "ததோ॒ விஷ்வ॒ங்வ்ய॑க்ராமத் ।\n" +
          "ஸா॒ஶ॒நா॒ந॒ஶ॒நே அ॒பி⁴ । தஸ்மா᳚த்³வி॒ராட³॑ஜாயத ।\n" +
          "வி॒ராஜோ॒ அதி⁴॒ பூரு॑ஷ: । ஸ ஜா॒தோ அத்ய॑ரிச்யத ।\n" +
          "ப॒ஶ்சாத்³பூ⁴மி॒மதோ²॑ பு॒ர: ॥ 2 ॥\n" +
          "\n" +
          "யத்புரு॑ஷேண ஹ॒விஷா᳚ । தே³॒வா ய॒ஜ்ஞமத॑ந்வத ।\n" +
          "வ॒ஸ॒ந்தோ அ॑ஸ்யாஸீ॒தா³ஜ்யம்᳚ । க்³ரீ॒ஷ்ம இ॒த்⁴மஶ்ஶ॒ரத்³த⁴॒வி: ।\n" +
          "ஸ॒ப்தாஸ்யா॑ஸந்பரி॒த⁴ய॑: । த்ரி: ஸ॒ப்த ஸ॒மித⁴॑: க்ரு॒தா: ।\n" +
          "தே³॒வா யத்³ய॒ஜ்ஞம் த॑ந்வா॒நா: ।\n" +
          "அப³॑த்⁴ந॒ந்புரு॑ஷம் ப॒ஶும் ।\n" +
          "தம் ய॒ஜ்ஞம் ப³॒ர்ஹிஷி॒ ப்ரௌக்ஷந்॑ ।\n" +
          "புரு॑ஷம் ஜா॒தம॑க்³ர॒த: ॥ 3 ॥\n" +
          "\n" +
          "தேந॑ தே³॒வா அய॑ஜந்த । ஸா॒த்⁴யா ருஷ॑யஶ்ச॒ யே ।\n" +
          "தஸ்மா᳚த்³ய॒ஜ்ஞாத்ஸ॑ர்வ॒ஹுத॑: । ஸம்ப்⁴ரு॑தம் ப்ருஷதா³॒ஜ்யம் ।\n" +
          "ப॒ஶூக்³ஸ்தாக்³ஶ்ச॑க்ரே வாய॒வ்யாந்॑ । ஆ॒ர॒ண்யாந்க்³ரா॒ம்யாஶ்ச॒ யே ।\n" +
          "தஸ்மா᳚த்³ய॒ஜ்ஞாத்ஸ॑ர்வ॒ஹுத॑: । ருச॒: ஸாமா॑நி ஜஜ்ஞிரே ।\n" +
          "ச²ந்தா³க்³ம்॑ஸி ஜஜ்ஞிரே॒ தஸ்மா᳚த் । யஜு॒ஸ்தஸ்மா॑த³ஜாயத ॥ 4 ॥\n" +
          "\n" +
          "தஸ்மா॒த³ஶ்வா॑ அஜாயந்த । யே கே சோ॑ப⁴॒யாத³॑த: ।\n" +
          "கா³வோ॑ ஹ ஜஜ்ஞிரே॒ தஸ்மா᳚த் । தஸ்மா᳚ஜ்ஜா॒தா அ॑ஜா॒வய॑: ।\n" +
          "யத்புரு॑ஷம்॒ வ்ய॑த³து⁴: । க॒தி॒தா⁴ வ்ய॑கல்பயந் ।\n" +
          "முக²ம்॒ கிம॑ஸ்ய॒ கௌ பா³॒ஹூ । காவூ॒ரூ பாதா³॑வுச்யேதே ।\n" +
          "ப்³ரா॒ஹ்ம॒ணோ᳚(அ)ஸ்ய॒ முக²॑மாஸீத் । பா³॒ஹூ ரா॑ஜ॒ந்ய॑: க்ரு॒த: ॥ 5 ॥\n" +
          "\n" +
          "ஊ॒ரூ தத³॑ஸ்ய॒ யத்³வைஶ்ய॑: । ப॒த்³ப்⁴யாக்³ம் ஶூ॒த்³ரோ அ॑ஜாயத ।\n" +
          "ச॒ந்த்³ரமா॒ மந॑ஸோ ஜா॒த: । சக்ஷோ॒: ஸூர்யோ॑ அஜாயத ।\n" +
          "முகா²॒தி³ந்த்³ர॑ஶ்சா॒க்³நிஶ்ச॑ । ப்ரா॒ணாத்³வா॒யுர॑ஜாயத ।\n" +
          "நாப்⁴யா॑ ஆஸீத³॒ந்தரி॑க்ஷம் । ஶீ॒ர்ஷ்ணோ த்³யௌ: ஸம॑வர்தத ।\n" +
          "ப॒த்³ப்⁴யாம் பூ⁴மி॒ர்தி³ஶ॒: ஶ்ரோத்ரா᳚த் ।\n" +
          "ததா²॑ லோ॒காக்³ம் அ॑கல்பயந் ॥ 6 ॥\n" +
          "\n" +
          "வேதா³॒ஹமே॒தம் புரு॑ஷம் ம॒ஹாந்தம்᳚ ।\n" +
          "ஆ॒தி³॒த்யவ॑ர்ணம்॒ தம॑ஸ॒ஸ்து பா॒ரே ।\n" +
          "ஸர்வா॑ணி ரூ॒பாணி॑ வி॒சித்ய॒ தீ⁴ர॑: ।\n" +
          "நாமா॑நி க்ரு॒த்வா(அ)பி⁴॒வத³॒ந்॒ யதா³ஸ்தே᳚ ।\n" +
          "தா⁴॒தா பு॒ரஸ்தா॒த்³யமு॑தா³ஜ॒ஹார॑ ।\n" +
          "ஶ॒க்ர: ப்ரவி॒த்³வாந்ப்ர॒தி³ஶ॒ஶ்சத॑ஸ்ர: ।\n" +
          "தமே॒வம் வி॒த்³வாந॒ம்ருத॑ இ॒ஹ ப⁴॑வதி ।\n" +
          "நாந்ய: பந்தா²॒ அய॑நாய வித்³யதே ।\n" +
          "ய॒ஜ்ஞேந॑ ய॒ஜ்ஞம॑யஜந்த தே³॒வா: ।\n" +
          "தாநி॒ த⁴ர்மா॑ணி ப்ரத²॒மாந்யா॑ஸந் ।\n" +
          "தே ஹ॒ நாகம்॑ மஹி॒மாந॑: ஸசந்தே ।\n" +
          "யத்ர॒ பூர்வே॑ ஸா॒த்⁴யா: ஸந்தி॑ தே³॒வா: ॥ 7 ॥\n" +
          "\n" +
          "அ॒த்³ப்⁴ய: ஸம்பூ⁴॑த: ப்ருதி²॒வ்யை ரஸா᳚ச்ச ।\n" +
          "வி॒ஶ்வக॑ர்மண॒: ஸம॑வர்த॒தாதி⁴॑ ।\n" +
          "தஸ்ய॒ த்வஷ்டா॑ வி॒த³த⁴॑த்³ரூ॒பமே॑தி ।\n" +
          "தத்புரு॑ஷஸ்ய॒ விஶ்வ॒மாஜா॑ந॒மக்³ரே᳚ ।\n" +
          "வேதா³॒ஹமே॒தம் புரு॑ஷம் ம॒ஹாந்தம்᳚ ।\n" +
          "ஆ॒தி³॒த்யவ॑ர்ணம்॒ தம॑ஸ॒: பர॑ஸ்தாத் ।\n" +
          "தமே॒வம் வி॒த்³வாந॒ம்ருத॑ இ॒ஹ ப⁴॑வதி ।\n" +
          "நாந்ய: பந்தா²॑ வித்³ய॒தேய॑(அ)நாய ।\n" +
          "ப்ர॒ஜாப॑திஶ்சரதி॒ க³ர்பே⁴॑ அ॒ந்த: ।\n" +
          "அ॒ஜாய॑மாநோ ப³ஹு॒தா⁴ விஜா॑யதே ॥ 8 ॥\n" +
          "\n" +
          "தஸ்ய॒ தீ⁴ரா॒: பரி॑ஜாநந்தி॒ யோநிம்᳚ ।\n" +
          "மரீ॑சீநாம் ப॒த³மி॑ச்ச²ந்தி வே॒த⁴ஸ॑: ।\n" +
          "யோ தே³॒வேப்⁴ய॒ ஆத॑பதி ।\n" +
          "யோ தே³॒வாநாம்᳚ பு॒ரோஹி॑த: ।\n" +
          "பூர்வோ॒ யோ தே³॒வேப்⁴யோ॑ ஜா॒த: ।\n" +
          "நமோ॑ ரு॒சாய॒ ப்³ராஹ்ம॑யே ।\n" +
          "ருசம்॑ ப்³ரா॒ஹ்மம் ஜ॒நய॑ந்த: ।\n" +
          "தே³॒வா அக்³ரே॒ தத³॑ப்³ருவந் ।\n" +
          "யஸ்த்வை॒வம் ப்³ரா᳚ஹ்ம॒ணோ வி॒த்³யாத் ।\n" +
          "தஸ்ய॑ தே³॒வா அஸ॒ந் வஶே᳚ ॥ 9 ॥\n" +
          "\n" +
          "ஹ்ரீஶ்ச॑ தே ல॒க்ஷ்மீஶ்ச॒ பத்ந்யௌ᳚ ।\n" +
          "அ॒ஹோ॒ரா॒த்ரே பா॒ர்ஶ்வே । நக்ஷ॑த்ராணி ரூ॒பம் ।\n" +
          "அ॒ஶ்விநௌ॒ வ்யாத்தம்᳚ । இ॒ஷ்டம் ம॑நிஷாண ।\n" +
          "அ॒மும் ம॑நிஷாண । ஸர்வம்॑ மநிஷாண ॥ 10 ॥\n"),
  'srisuktam': Ashtothram(
      'ஶ்ரீ ஸூக்தம்',
      'srisuktam',
      "ஹிர॑ண்யவர்ணாம்॒ ஹரி॑ணீம் ஸு॒வர்ண॑ரஜ॒தஸ்ர॑ஜாம் ।\n" +
          "ச॒ந்த்³ராம் ஹி॒ரண்ம॑யீம் ல॒க்ஷ்மீம் ஜாத॑வேதோ³ ம॒ ஆவ॑ஹ ॥ 1 ॥\n" +
          "\n" +
          "தாம் ம॒ ஆவ॑ஹ॒ ஜாத॑வேதோ³ ல॒க்ஷ்மீமந॑பகா³॒மிநீ᳚ம் ।\n" +
          "யஸ்யாம்॒ ஹிர॑ண்யம் வி॒ந்தே³யம்॒ கா³மஶ்வம்॒ புரு॑ஷாந॒ஹம் ॥ 2 ॥\n" +
          "\n" +
          "அ॒ஶ்வ॒பூ॒ர்வாம் ர॑த²ம॒த்⁴யாம் ஹ॒ஸ்திநா॑த³ப்ர॒போ³தி⁴॑நீம் ।\n" +
          "ஶ்ரியம்॑ தே³॒வீமுப॑ஹ்வயே॒ ஶ்ரீர்மா॑தே³॒வீர்ஜு॑ஷதாம் ॥ 3 ॥\n" +
          "\n" +
          "காம்॒ ஸோ᳚ஸ்மி॒தாம் ஹிர॑ண்யப்ரா॒காரா॑மா॒ர்த்³ராம் ஜ்வல॑ந்தீம் த்ரு॒ப்தாம் த॒ர்பய॑ந்தீம் ।\n" +
          "ப॒த்³மே॒ ஸ்தி²॒தாம் ப॒த்³மவ॑ர்ணாம்॒ தாமி॒ஹோப॑ஹ்வயே॒ ஶ்ரியம் ॥ 4 ॥\n" +
          "\n" +
          "ச॒ந்த்³ராம் ப்ர॑பா⁴॒ஸாம் ய॒ஶஸா॒ ஜ்வல॑ந்தீம்॒ ஶ்ரியம்॑ லோ॒கே தே³॒வஜு॑ஷ்டாமுதா³॒ராம் ।\n" +
          "தாம் ப॒த்³மிநீ॑மீம்॒ ஶர॑ணம॒ஹம் ப்ரப॑த்³யே(அ)ல॒க்ஷ்மீர்மே॑ நஶ்யதாம்॒ த்வாம் வ்ரு॑ணே ॥ 5 ॥\n" +
          "\n" +
          "ஆ॒தி³॒த்யவ॑ர்ணே॒ தப॒ஸோ(அ)தி⁴॑ஜா॒தோ வந॒ஸ்பதி॒ஸ்தவ॑ வ்ரு॒க்ஷோ(அ)த² பி³॒ல்வ: ।\n" +
          "தஸ்ய॒ ப²லா॑நி॒ தப॒ஸா நு॑த³ந்து மா॒யாந்த॑ரா॒யாஶ்ச॑ பா³॒ஹ்யா அ॑ல॒க்ஷ்மீ: ॥ 6 ॥\n" +
          "\n" +
          "உபை॑து॒ மாம் தே³॑வஸ॒க²: கீ॒ர்திஶ்ச॒ மணி॑நா ஸ॒ஹ ।\n" +
          "ப்ரா॒து³॒ர்பூ⁴॒தோ(அ)ஸ்மி॑ ராஷ்ட்ரே॒(அ)ஸ்மிந் கீ॒ர்திம்ரு॑த்³தி⁴ம் த³॒தா³து॑ மே ॥ 7 ॥\n" +
          "\n" +
          "க்ஷுத்பி॑பா॒ஸாம॑லாம் ஜ்யே॒ஷ்டா²ம॑ல॒க்ஷ்மீம் நா॑ஶயா॒ம்யஹம் ।\n" +
          "அபூ⁴॑தி॒மஸ॑ம்ருத்³தி⁴ம்॒ ச ஸர்வாம்॒ நிர்ணு॑த³ மே॒ க்³ருஹா॑த் ॥ 8 ॥\n" +
          "\n" +
          "க³॒ந்த⁴॒த்³வா॒ராம் து³॑ராத⁴॒ர்ஷாம்॒ நி॒த்யபு॑ஷ்டாம் கரீ॒ஷிணீ᳚ம் ।\n" +
          "ஈ॒ஶ்வரீ॑க்³ம் ஸர்வ॑பூ⁴தா॒நாம்॒ தாமி॒ஹோப॑ஹ்வயே॒ ஶ்ரியம் ॥ 9 ॥\n" +
          "\n" +
          "மந॑ஸ॒: காம॒மாகூ॑திம் வா॒ச: ஸ॒த்யம॑ஶீமஹி ।\n" +
          "ப॒ஶூ॒நாம் ரூ॒பமந்ந॑ஸ்ய॒ மயி॒ ஶ்ரீ: ஶ்ர॑யதாம்॒ யஶ॑: ॥ 10 ॥\n" +
          "\n" +
          "க॒ர்த³மே॑ந ப்ர॑ஜாபூ⁴॒தா॒ ம॒யி॒ ஸம்ப⁴॑வ க॒ர்த³ம ।\n" +
          "ஶ்ரியம்॑ வா॒ஸய॑ மே கு॒லே மா॒தரம்॑ பத்³ம॒மாலி॑நீம் ॥ 11 ॥\n" +
          "\n" +
          "ஆப॑: ஸ்ரு॒ஜந்து॑ ஸ்நி॒க்³தா⁴॒நி॒ சி॒க்லீ॒த வ॑ஸ மே॒ க்³ருஹே ।\n" +
          "நி ச॑ தே³॒வீம் மா॒தரம்॒ ஶ்ரியம்॑ வா॒ஸய॑ மே கு॒லே ॥ 12 ॥\n" +
          "\n" +
          "ஆ॒ர்த்³ராம் பு॒ஷ்கரி॑ணீம் பு॒ஷ்டிம்॒ பி॒ங்க³॒லாம் ப॑த்³மமா॒லிநீம்।\n" +
          "ச॒ந்த்³ராம் ஹி॒ரண்ம॑யீம் ல॒க்ஷ்மீம் ஜாத॑வேதோ³ ம॒ ஆவ॑ஹ ॥ 13 ॥\n" +
          "\n" +
          "ஆ॒ர்த்³ராம் ய॒: கரி॑ணீம் ய॒ஷ்டிம்॒ ஸு॒வ॒ர்ணாம் ஹே॑மமா॒லிநீம் ।\n" +
          "ஸூ॒ர்யாம் ஹி॒ரண்ம॑யீம் ல॒க்ஷ்மீம்॒ ஜாத॑வேதோ³ ம॒ ஆவஹ ॥ 14 ॥\n" +
          "\n" +
          "தாம் ம॒ ஆவ॑ஹ॒ ஜாத॑வேதோ³ ல॒க்ஷ்மீமந॑பகா³॒மிநீ᳚ம் ।\n" +
          "யஸ்யாம்॒ ஹி॑ரண்யம்॒ ப்ரபூ⁴॑தம்॒ கா³வோ॑ தா³॒ஸ்யோ(அ)ஶ்வா᳚ந்வி॒ந்தே³யம்॒ புரு॑ஷாந॒ஹம் ॥ 15 ॥\n" +
          "\n" +
          "—-\n" +
          "\n" +
          "ய: ஶுசி॒: ப்ரய॑தோ பூ⁴॒த்வா ஜு॒ஹுயா॑தா³ஜ்ய॒ மந்வ॑ஹம் ।\n" +
          "ஶ்ரிய॑: ப॒ஞ்சத³॑ஶர்சம்॒ ச ஶ்ரீ॒காம॑: ஸத॒தம் ஜ॑பேத் ॥\n" +
          "\n" +
          "ஆந॑ந்த³॒: கர்த³॑மஶ்சைவ சி॒க்லீத॑ இதி॒ விஶ்ரு॑தா: ।\n" +
          "ருஷ॑ய॒: தே த்ரய: புத்ரா: ஸ்வயம் ஶ்ரீதே³வி தே³வதா ॥\n" +
          "\n" +
          "ப॒த்³மா॒ஸ॒நே ப॑த்³ம ஊ॒ரூ॒ ப॒த்³மாக்ஷீ॑ பத்³ம॒ஸம்ப⁴॑வே ।\n" +
          "த்வம் மாம்᳚ ப⁴॒ஜஸ்வ॑ ப॒த்³மா॒க்ஷீ॒ யே॒ந ஸௌ॑க்²யம் ல॒பா⁴ம்ய॑ஹம் ॥\n" +
          "\n" +
          "அஶ்வ॑தா³॒யீ கோ³॑தா³॒யீ॒ த⁴॒நதா³॑யீ ம॒ஹாத⁴॑நே ।\n" +
          "த⁴நம் மே॒ ஜுஷ॑தாம் தே³॒வி॒ ஸ॒ர்வகா॑மார்த² ஸித்³த⁴யே ॥\n" +
          "\n" +
          "புத்ரபௌ॒த்ர த⁴॑நம் தா⁴॒ந்யம் ஹ॒ஸ்த்யஶ்வா॑தி³க³॒வே ர॑த²ம் ।\n" +
          "ப்ர॒ஜா॒நாம் ப⁴॑வஸி மா॒தா ஆ॒யுஷ்ம॑ந்தம் க॒ரோது॑ மாம் ॥\n" +
          "\n" +
          "ச॒ந்த்³ராபா⁴ம் லக்ஷ்மீமீ॑ஶா॒நாம் ஸு॒ர்யாபா⁴ம்᳚ ஶ்ரியமீஶ்வரீம் ।\n" +
          "சந்த்³ர ஸூ॒ர்யாக்³நி ஸர்வாபா⁴ம் ஶ்ரீமஹாலக்ஷ்மீ॑முபாஸ்மஹே ॥\n" +
          "\n" +
          "த⁴ந॑ம॒க்³நிர்த⁴॑நம் வா॒யுர்த⁴॑நம்॒ ஸூர்யோ॑ த⁴நம்॒ வஸு॑: ।\n" +
          "த⁴ந॒மிந்த்³ரோ॒ ப்³ருஹ॒ஸ்பதி॒ர்வரு॑ணம்॒ த⁴ந॒மஶ்நு॑ தே ॥\n" +
          "\n" +
          "வைந॑தேய॒ ஸோமம்॑ பிப³॒ ஸோமம்॑ பிப³து வ்ருத்ர॒ஹா ।\n" +
          "ஸோமம்॒ த⁴ந॑ஸ்ய ஸோ॒மிநோ॒ மஹ்யம்॒ த³தா³॑து ஸோ॒மிந॑: ॥\n" +
          "\n" +
          "ந க்ரோதோ⁴ ந ச॑ மாத்ஸ॒ர்யம் ந॒ லோபோ⁴॑ நாஶு॒பா⁴ ம॑தி: ।\n" +
          "ப⁴வ॑ந்தி॒ க்ருத॑புண்யா॒நாம் ப⁴॒க்தாநாம் ஶ்ரீஸூ᳚க்தம் ஜ॒பேத்ஸ॑தா³ ॥\n" +
          "\n" +
          "வர்ஷந்᳚து॒ தே வி॑பா⁴வ॒ரி॒ தி³॒வோ அ॑ப்⁴ரஸ்ய॒ வித்³யு॑த: ।\n" +
          "ரோஹந்᳚து॒ ஸர்வ॑பீ³॒ஜா॒ந்ய॒வ ப்³ர॑ஹ்ம த்³வி॒ஷோ᳚ ஜ॑ஹி ॥\n" +
          "\n" +
          "பத்³ம॑ப்ரியே பத்³மிநி பத்³ம॒ஹஸ்தே பத்³மா॑லயே பத்³மத³ளாய॑தாக்ஷி ।\n" +
          "விஶ்வ॑ப்ரியே॒ விஷ்ணு மநோ॑(அ)நுகூ॒லே த்வத்பா॑த³ப॒த்³மம் மயி॒ ஸந்நி॑த⁴த்ஸ்வ ॥\n" +
          "\n" +
          "யா ஸா பத்³மா॑ஸந॒ஸ்தா² விபுலகடிதடீ பத்³ம॒பத்ரா॑யதா॒க்ஷீ ।\n" +
          "க³ம்பீ⁴ரா வ॑ர்தநா॒பி⁴: ஸ்தநப⁴ர நமிதா ஶுப்⁴ர வஸ்த்ரோ॑த்தரீ॒யா ।\n" +
          "லக்ஷ்மீர்தி³॒வ்யைர்க³ஜேந்த்³ரைர்ம॒ணிக³ண க²சிதைஸ்ஸ்நாபிதா ஹே॑மகு॒ம்பை⁴: ।\n" +
          "நி॒த்யம் ஸா ப॑த்³மஹ॒ஸ்தா மம வஸ॑து க்³ரு॒ஹே ஸர்வ॒மாங்க³ல்ய॑யுக்தா ॥\n" +
          "\n" +
          "ல॒க்ஷ்மீம் க்ஷீரஸமுத்³ரராஜதநயாம் ஶ்ரீ॒ரங்க³தா⁴மே॑ஶ்வரீம் ।\n" +
          "தா³॒ஸீபூ⁴தஸமஸ்த தே³வ வ॒நிதாம் லோ॒கைக॒ தீ³பா॑ங்குராம் ।\n" +
          "ஶ்ரீமந்மந்த³கடாக்ஷலப்³த⁴ விப⁴வ ப்³ர॒ஹ்மேந்த்³ரக³ங்கா³॑த⁴ராம் ।\n" +
          "த்வாம் த்ரை॒லோக்ய॒ குடு॑ம்பி³நீம் ஸ॒ரஸிஜாம் வ॒ந்தே³ முகு॑ந்த³ப்ரியாம் ॥\n" +
          "\n" +
          "ஸி॒த்³த⁴॒ல॒க்ஷ்மீர்மோ॑க்ஷல॒க்ஷ்மீ॒ர்ஜ॒யல॑க்ஷ்மீஸ்ஸ॒ரஸ்வ॑தீ ।\n" +
          "ஶ்ரீலக்ஷ்மீர்வ॑ரள॒க்ஷ்மீ॒ஶ்ச॒ ப்ர॒ஸந்நா॒ ம॑ம ஸ॒ர்வதா³ ॥\n" +
          "\n" +
          "வராங்குஶௌ பாஶமபீ⁴॑திமு॒த்³ராம்॒ க॒ரை॑ர்வஹந்தீம் க॑மலா॒ஸநஸ்தா²ம் ।\n" +
          "பா³லார்க கோடி ப்ரதி॑பா⁴ம் த்ரி॒ணே॒த்ராம்॒ ப⁴॒ஜேஹமாத்³யாம் ஜ॑க³தீ³॒ஶ்வரீம் தாம் ॥\n" +
          "\n" +
          "ஸ॒ர்வ॒ம॒ங்க³॒லமா॒ங்க³ல்யே॑ ஶி॒வே ஸ॒ர்வார்த²॑ ஸாதி⁴கே ।\n" +
          "ஶர॑ண்யே த்ர்யம்ப³॑கே தே³॒வி॒ நா॒ராய॑ணி ந॒மோ(அ)ஸ்து॑ தே ॥\n" +
          "\n" +
          "ஓம் ம॒ஹா॒தே³॒வ்யை ச॑ வி॒த்³மஹே॑ விஷ்ணுப॒த்நீ ச॑ தீ⁴மஹி ।\n" +
          "தந்நோ॑ லக்ஷ்மீ: ப்ரசோ॒த³யா᳚த் ॥\n" +
          "\n" +
          "ஓம் ஶாந்தி॒: ஶாந்தி॒: ஶாந்தி॑: ॥\n"),
  'narayanasuktam': Ashtothram(
      'நாராயண ஸூக்தம்',
      'narayanasuktam',
      "ஸ॒ஹ॒ஸ்ர॒ஶீர்॑ஷம் தே³॒வம்॒ வி॒ஶ்வாக்ஷம்॑ வி॒ஶ்வஶ॑ம்பு⁴வம் ।\n" +
          "விஶ்வம்॑ நா॒ராய॑ணம் தே³॒வ॒ம॒க்ஷரம்॑ பர॒மம் ப॒த³ம் ।\n" +
          "\n" +
          "வி॒ஶ்வத॒: பர॑மாந்நி॒த்யம்॒ வி॒ஶ்வம் நா॑ராய॒ணக்³ம் ஹ॑ரிம் ।\n" +
          "விஶ்வ॑மே॒வேத³ம் புரு॑ஷ॒ஸ்தத்³விஶ்வ॒முப॑ஜீவதி ।\n" +
          "\n" +
          "பதிம்॒ விஶ்வ॑ஸ்யா॒த்மேஶ்வ॑ர॒க்³ம்॒ ஶாஶ்வ॑தக்³ம் ஶி॒வம॑ச்யுதம் ।\n" +
          "நா॒ராய॒ணம் ம॑ஹாஜ்ஞே॒யம்॒ வி॒ஶ்வாத்மா॑நம் ப॒ராய॑ணம் ।\n" +
          "\n" +
          "நா॒ராய॒ண ப॑ரோ ஜ்யோ॒தி॒ரா॒த்மா நா॑ராய॒ண: ப॑ர: ।\n" +
          "நா॒ராய॒ண ப॑ரம் ப்³ர॒ஹ்ம॒ த॒த்த்வம் நா॑ராய॒ண: ப॑ர: ।\n" +
          "\n" +
          "நா॒ராய॒ண ப॑ரோ த்⁴யா॒தா॒ த்⁴யா॒நம் நா॑ராய॒ண: ப॑ர: ।\n" +
          "யச்ச॑ கி॒ஞ்சிஜ்ஜ॑க³த்ஸ॒ர்வம்॒ த்³ரு॒ஶ்யதே᳚ ஶ்ரூய॒தே(அ)பி॑ வா ॥\n" +
          "\n" +
          "அந்த॑ர்ப³॒ஹிஶ்ச॑ தத்ஸ॒ர்வம்॒ வ்யா॒ப்ய நா॑ராய॒ண: ஸ்தி²॑த: ।\n" +
          "அந॑ந்த॒மவ்ய॑யம் க॒விக்³ம் ஸ॑மு॒த்³ரே(அ)ந்தம்॑ வி॒ஶ்வஶ॑ம்பு⁴வம் ।\n" +
          "\n" +
          "ப॒த்³ம॒கோ॒ஶ ப்ர॑தீகா॒ஶ॒க்³ம்॒ ஹ்ரு॒த³யம்॑ சாப்ய॒தோ⁴மு॑க²ம் ।\n" +
          "அதோ⁴॑ நி॒ஷ்ட்யா வி॑தஸ்த்யா॒ந்தே॒ நா॒ப்⁴யாமு॑பரி॒ திஷ்ட²॑தி ।\n" +
          "\n" +
          "ஜ்வா॒ல॒மா॒லாகு॑லம் பா⁴॒தீ॒ வி॒ஶ்வஸ்யா॑யத॒நம் ம॑ஹத் ।\n" +
          "ஸந்த॑தக்³ம் ஶி॒லாபி⁴॑ஸ்து॒ லம்ப³॑த்யாகோஶ॒ஸந்நி॑ப⁴ம் ।\n" +
          "\n" +
          "தஸ்யாந்தே॑ ஸுஷி॒ரக்³ம் ஸூ॒க்ஷ்மம் தஸ்மிந்᳚ ஸ॒ர்வம் ப்ரதி॑ஷ்டி²தம் ।\n" +
          "தஸ்ய॒ மத்⁴யே॑ ம॒ஹாந॑க்³நிர்வி॒ஶ்வார்சி॑ர்வி॒ஶ்வதோ॑முக²: ।\n" +
          "\n" +
          "ஸோ(அ)க்³ர॑பு⁴॒க்³விப⁴॑ஜந்தி॒ஷ்ட²॒ந்நாஹா॑ரமஜ॒ர: க॒வி: ।\n" +
          "தி॒ர்ய॒கூ³॒ர்த்⁴வம॑த⁴ஶ்ஶா॒யீ॒ ர॒ஶ்மய॑ஸ்தஸ்ய॒ ஸந்த॑தா ।\n" +
          "\n" +
          "ஸ॒ந்தா॒பய॑தி ஸ்வம் தே³॒ஹமாபா॑த³தல॒மஸ்த॑க: ।\n" +
          "தஸ்ய॒ மத்⁴யே॒ வஹ்நி॑ஶிகா² அ॒ணீயோ᳚ர்த்⁴வா வ்ய॒வஸ்தி²॑த: ।\n" +
          "\n" +
          "நீ॒லதோ॑யத³॑மத்⁴ய॒ஸ்தா²॒த்³வி॒த்³யுல்லே॑கே²வ॒ பா⁴ஸ்வ॑ரா ।\n" +
          "நீ॒வார॒ஶூக॑வத்த॒ந்வீ॒ பீ॒தா பா⁴᳚ஸ்வத்ய॒ணூப॑மா ।\n" +
          "\n" +
          "தஸ்யா᳚: ஶிகா²॒யா ம॑த்⁴யே ப॒ரமா᳚த்மா வ்ய॒வஸ்தி²॑த: ।\n" +
          "ஸ ப்³ரஹ்ம॒ ஸ ஶிவ॒: ஸ ஹரி॒: ஸேந்த்³ர॒: ஸோ(அ)க்ஷ॑ர: பர॒ம: ஸ்வ॒ராட் ॥\n" +
          "\n" +
          "ரு॒தக்³ம் ஸ॒த்யம் ப॑ரம் ப்³ர॒ஹ்ம॒ பு॒ருஷம்॑ க்ருஷ்ண॒பிங்க³॑லம் ।\n" +
          "ஊ॒ர்த்⁴வரே॑தம் வி॑ரூபா॒க்ஷம்॒ வி॒ஶ்வரூ॑பாய॒ வை நமோ॒ நம॑: ।\n" +
          "\n" +
          "ஓம் நா॒ரா॒ய॒ணாய॑ வி॒த்³மஹே॑ வாஸுதே³॒வாய॑ தீ⁴மஹி ।\n" +
          "தந்நோ॑ விஷ்ணு: ப்ரசோ॒த³யா᳚த் ॥\n" +
          "\n" +
          "ஓம் ஶாந்தி॒: ஶாந்தி॒: ஶாந்தி॑: ॥\n"),
  'vishnusuktam': Ashtothram(
      'விஷ்ணு ஸூக்தம்',
      'vishnusuktam',
      "ஓம் விஷ்ணோ॒ர்நுகம்॑ வீ॒ர்யா॑ணி॒ ப்ரவோ॑சம்॒ ய: பார்தி²॑வாநி விம॒மே\n" +
          "ரஜாக்³ம்॑ஸி॒ யோ அஸ்க॑பா⁴ய॒து³த்த॑ரக்³ம் ஸ॒த⁴ஸ்த²ம்॑\n" +
          "விசக்ரமா॒ணஸ்த்ரே॒தோ⁴ரு॑கா³॒யோ விஷ்ணோ॑ர॒ராட॑மஸி॒ விஷ்ணோ᳚:\n" +
          "ப்ரு॒ஷ்ட²ம॑ஸி॒ விஷ்ணோ॒: ஶ்நப்த்ரே᳚ஸ்தோ²॒ விஷ்ணோ॒ஸ்ஸ்யூர॑ஸி॒\n" +
          "விஷ்ணோ᳚ர்த்⁴ரு॒வம॑ஸி வைஷ்ண॒வம॑ஸி॒ விஷ்ண॑வே த்வா ॥\n" +
          "\n" +
          "தத³॑ஸ்ய ப்ரி॒யம॒பி⁴பாதோ²॑ அஶ்யாம் ।\n" +
          "நரோ॒ யத்ர॑ தே³வ॒யவோ॒ மத³॑ந்தி ।\n" +
          "உ॒ரு॒க்ர॒மஸ்ய॒ ஸ ஹி ப³ந்து⁴॑ரி॒த்தா² ।\n" +
          "விஷ்ணோ᳚: ப॒தே³ ப॑ர॒மே மத்⁴வ॒ உத்²ஸ॑: ।\n" +
          "ப்ரதத்³விஷ்ணு॑ஸ்ஸ்தவதே வீ॒ர்யா॑ய ।\n" +
          "ம்ரு॒கோ³ ந பீ⁴॒ம: கு॑ச॒ரோ கி³॑ரி॒ஷ்டா²: ।\n" +
          "யஸ்யோ॒ருஷு॑ த்ரி॒ஷு வி॒க்ரம॑ணேஷு ।\n" +
          "அதி⁴॑க்ஷி॒யந்தி॒ பு⁴வ॑நாநி॒ விஶ்வா᳚ ।\n" +
          "ப॒ரோ மாத்ர॑யா த॒நுவா॑ வ்ருதா⁴ந ।\n" +
          "ந தே॑ மஹி॒த்வமந்வ॑ஶ்நுவந்தி ॥\n" +
          "\n" +
          "உ॒பே⁴ தே॑ வித்³ம॒ ரஜ॑ஸீ ப்ருதி²॒வ்யா விஷ்ணோ॑ தே³வ॒த்வம் ।\n" +
          "ப॒ர॒மஸ்ய॑ வித்²ஸே । விச॑க்ரமே ப்ருதி²॒வீமே॒ஷ ஏ॒தாம் ।\n" +
          "க்ஷேத்ரா॑ய॒ விஷ்ணு॒ர்மநு॑ஷே த³ஶ॒ஸ்யந் ।\n" +
          "த்⁴ரு॒வாஸோ॑ அஸ்ய கீ॒ரயோ॒ ஜநா॑ஸ: ।\n" +
          "ஊ॒ரு॒க்ஷி॒திக்³ம் ஸு॒ஜநி॑மாசகார ।\n" +
          "த்ரிர்தே³॒வ: ப்ரு॑தி²॒வீமே॒ஷ ஏ॒தாம் ।\n" +
          "விச॑க்ரமே ஶ॒தர்ச॑ஸம் மஹி॒த்வா ।\n" +
          "ப்ரவிஷ்ணு॑ரஸ்து த॒வஸ॒ஸ்தவீ॑யாந் ।\n" +
          "த்வே॒ஷக்³க்³ஹ்ய॑ஸ்ய॒ ஸ்த²வி॑ரஸ்ய॒ நாம॑ ॥\n" +
          "\n" +
          "அதோ᳚ தே³॒வா அ॑வந்துநோ॒ யதோ॒ விஷ்ணுர்᳚விசக்ர॒மே ।\n" +
          "ப்ரு॒தி²॒வ்யாஸ்ஸ॒ப்த தா⁴ம॑பி⁴: ।\n" +
          "இ॒த³ம் விஷ்ணு॒ர்விச॑க்ரமே த்ரே॒தா⁴ நித³॑தே⁴ ப॒த³ம் ।\n" +
          "ஸமூ॑ட⁴மஸ்ய பாக்³ம்ஸு॒ரே ।\n" +
          "த்ரீணி॑ ப॒தா³ விச॑க்ரமே॒ விஷ்ணு॑ர்கோ³॒பா அதா³᳚ப்⁴ய: ।\n" +
          "ததோ॒ த⁴ர்மா॑ணி தா⁴॒ரயந்॑ ।\n" +
          "விஷ்ணோ॒: கர்மா॑ணி பஶ்யத॒ யதோ᳚ வ்ர॒தாநி॑ பஸ்ப॒ஶே ।\n" +
          "இந்த்³ர॑ஸ்ய॒ யுஜ்ய॒ஸ்ஸகா²᳚ ॥\n" +
          "\n" +
          "தத்³விஷ்ணோ᳚: பர॒மம் ப॒த³க்³ம் ஸதா³॑ பஶ்யந்தி ஸூ॒ரய॑: ।\n" +
          "தி³॒வீவ॒ சக்ஷு॒ராத॑தம் ।\n" +
          "தத்³விப்ரா॑ஸோ விப॒ந்யவோ॑ ஜாக்³ரு॒வாம் ஸ॒ஸ்ஸமி॑ந்த⁴தே ।\n" +
          "விஷ்ணோ॒ர்யத்ப॑ர॒மம் ப॒த³ம் ।\n" +
          "பர்யா᳚ப்த்யா॒ அந॑ந்தராயாய॒ ஸர்வ॑ஸ்தோமோ(அ)தி\n" +
          "ரா॒த்ர உ॑த்த॒ம மஹ॑ர்ப⁴வதி॒ ஸர்வ॒ஸ்யாப்த்யை॒\n" +
          "ஸர்வ॑ஸ்ய॒ ஜித்த்யை॒ ஸர்வ॑மே॒வ தேநா᳚ப்நோதி॒ ஸர்வம்॑ ஜயதி ॥\n" +
          "\n" +
          "ஓம் ஶாந்தி॒: ஶாந்தி॒: ஶாந்தி॑: ॥\n"),
  'boosuktam': Ashtothram(
      'பூ⁴ ஸூக்தம்',
      'boosuktam',
      "ஓம் பூ⁴மி॑ர்பூ⁴॒ம்நா த்³யௌர்வ॑ரி॒ணா(அ)ந்தரி॑க்ஷம் மஹி॒த்வா ।\n" +
          "உ॒பஸ்தே²॑ தே தே³வ்யதி³தே॒(அ)க்³நிம॑ந்நா॒த³-ம॒ந்நாத்³யா॒யாத³॑தே⁴ ॥\n" +
          "\n" +
          "ஆ(அ)யங்கௌ³: ப்ருஶ்நி॑ரக்ரமீ॒ த³ஸ॑நந்மா॒தரம்॒ புந॑: ।\n" +
          "பி॒தரம்॑ ச ப்ர॒யந்த்ஸுவ॑: ॥\n" +
          "\n" +
          "த்ரி॒க்³ம்॒ஶத்³தா⁴ம॒ விரா॑ஜதி॒ வாக்ப॑த॒ங்கா³ய॑ ஶிஶ்ரியே ।\n" +
          "ப்ரத்ய॑ஸ்ய வஹ॒ த்³யுபி⁴॑: ॥\n" +
          "\n" +
          "அ॒ஸ்ய ப்ரா॒ணாத³॑பாந॒த்ய॑ந்தஶ்ச॑ரதி ரோச॒நா ।\n" +
          "வ்ய॑க்²யந் மஹி॒ஷ: ஸுவ॑: ॥\n" +
          "\n" +
          "யத்த்வா᳚ க்ரு॒த்³த⁴: ப॑ரோ॒வப॑ம॒ந்யுநா॒ யத³வ॑ர்த்யா ।\n" +
          "ஸு॒கல்ப॑மக்³நே॒ தத்தவ॒ புந॒ஸ்த்வோத்³தீ³॑பயாமஸி ॥\n" +
          "\n" +
          "யத்தே॑ ம॒ந்யுப॑ரோப்தஸ்ய ப்ருதி²॒வீமநு॑த³த்⁴வ॒ஸே ।\n" +
          "ஆ॒தி³॒த்யா விஶ்வே॒ தத்³தே³॒வா வஸ॑வஶ்ச ஸ॒மாப⁴॑ரந் ॥\n" +
          "\n" +
          "மே॒தி³நீ॑ தே³॒வீ வ॒ஸுந்த⁴॑ரா ஸ்யா॒த்³வஸு॑தா⁴ தே³॒வீ வா॒ஸவீ᳚ ।\n" +
          "ப்³ர॒ஹ்ம॒வ॒ர்ச॒ஸ: பி॑த்ரு॒ணாக்³ ஶ்ரோத்ரம்॒ சக்ஷு॒ர்மந॑: ॥\n" +
          "\n" +
          "தே³॒வீ ஹிர॑ண்யக³ர்பி⁴ணீ தே³॒வீ ப்ர॒ஸூவ॑ரீ ।\n" +
          "ஸத³॑நே ஸ॒த்யாய॑நே ஸீத³ ।\n" +
          "\n" +
          "ஸ॒மு॒த்³ரவ॑தீ ஸாவி॒த்ரீஹ॒ நோ தே³॒வீ ம॒ஹ்யங்கீ³᳚ ।\n" +
          "ம॒ஹீத⁴ர॑ணீ ம॒ஹோவ்யதி²॑ஷ்டா²-ஶ்ஶ்ரு॒ங்கே³ ஶ்ரு॑ங்கே³ ய॒ஜ்ஞே ய॑ஜ்ஞே விபீ⁴॒ஷிணீ᳚ ॥\n" +
          "\n" +
          "இந்த்³ர॑பத்நீ வ்யா॒பிநீ॑ ஸு॒ரஸ॑ரிதி³॒ஹ ।\n" +
          "வா॒யு॒மதீ॑ ஜல॒ஶய॑நீ ஶ்ரி॒யந்தா⁴॒ராஜா॑ ஸ॒த்யந்தோ⁴॒பரி॑மேதி³நீ ।\n" +
          "ஶ்வோ॒பரி॑த⁴த்தம்॒ பரி॑கா³ய ।\n" +
          "வி॒ஷ்ணு॒ப॒த்நீம் ம॑ஹீம் தே³॒வீம்॒ மா॒த⁴॒வீம் மா॑த⁴வ॒ப்ரியாம் ।\n" +
          "லக்ஷ்மீம்᳚ ப்ரி॒யஸ॑கீ²ம் தே³॒வீம்॒ ந॒மா॒ம்யச்யு॑தவ॒ல்லபா⁴ம் ॥\n" +
          "\n" +
          "ஓம் த⁴॒நு॒ர்த⁴॒ராயை॑ வி॒த்³மஹே॑ ஸர்வஸி॒த்³த்⁴யை ச॑ தீ⁴மஹி ।\n" +
          "தந்நோ॑ த⁴ரா ப்ரசோ॒த³யா᳚த் ।\n" +
          "\n" +
          "ம॒ஹீம் தே³॒வீம் விஷ்ணு॑பத்நீ-மஜூ॒ர்யாம் । ப்ர॒தீசீ॑ மேநாக்³ம் ஹ॒விஷா॑ யஜாம: ।\n" +
          "த்ரே॒தா⁴ விஷ்ணு॑ருருகா³॒யோ விச॑க்ரமே । ம॒ஹீம் தி³வம்॑ ப்ருதி²॒வீம॒ந்தரி॑க்ஷம் ।\n" +
          "\n" +
          "தச்ச்²ரோ॒ணைதி॒ஶ்ரவ॑-இ॒ச்ச²மா॑நா । புண்ய॒க்³க்³॒ ஶ்லோகம்॒ யஜ॑மாநாய க்ருண்வ॒தீ ॥\n" +
          "\n" +
          "ஓம் ஶாந்தி॒: ஶாந்தி॒: ஶாந்தி॑: ॥\n"),
  'neelasuktam': Ashtothram(
      'நீலா ஸூக்தம்',
      'neelasuktam',
      "ஓம் க்³ரு॒ணா॒ஹி॒ ।\n" +
          "க்⁴ரு॒தவ॑தீ ஸவித॒ராதி⁴॑பத்யை॒: பய॑ஸ்வதீ॒ரந்தி॒ராஶா॑நோ அஸ்து ।\n" +
          "த்⁴ரு॒வா தி³॒ஶாம் விஷ்ணு॑ப॒த்ந்யகோ⁴॑ரா॒(அ)ஸ்யேஶா॑நா॒ஸஹ॑ஸோ॒யா ம॒நோதா᳚ ।\n" +
          "\n" +
          "ப்³ருஹ॒ஸ்பதி॑-ர்மாத॒ரிஶ்வோ॒த வா॒யுஸ்ஸ॑ந்து⁴வா॒நாவாதா॑ அ॒பி⁴ நோ॑ க்³ருணந்து ।\n" +
          "வி॒ஷ்ட॒ம்போ⁴ தி³॒வோத⁴॒ருண॑: ப்ருதி²॒வ்யா அ॒ஸ்யேஶ்யா॑நா॒ ஜக³॑தோ॒ விஷ்ணு॑பத்நீ ॥\n" +
          "\n" +
          "ஓம் ஶாந்தி॒: ஶாந்தி॒: ஶாந்தி॑: ॥\n"),
  'bhagyasuktam': Ashtothram(
      'பா⁴க்³ய ஸூக்தம்',
      'bhagyasuktam',
      "ஓம் ப்ரா॒தர॒க்³நிம் ப்ரா॒தரிந்த்³ரக்³ம்॑ ஹவாமஹே ப்ரா॒தர்மி॒த்ரா வரு॑ணா ப்ரா॒தர॒ஶ்விநா᳚ ।\n" +
          "ப்ரா॒தர்ப⁴க³ம்॑ பூ॒ஷணம்॒ ப்³ரஹ்ம॑ண॒ஸ்பதிம்॑ ப்ரா॒த꞉ ஸோம॑மு॒த ரு॒த்³ரக்³ம் ஹு॑வேம ॥ 1 ॥\n" +
          "\n" +
          "ப்ரா॒த॒ர்ஜிதம்॒ ப⁴॑க³மு॒க்³ரக்³ம் ஹு॑வேம வ॒யம் பு॒த்ர-மதி³॑தே॒ர்யோ வி॑த⁴॒ர்தா ।\n" +
          "ஆ॒த்³த்⁴ரஶ்சி॒த்³யம் மந்ய॑மாநஸ்து॒ரஶ்சி॒த்³ராஜா॑ சி॒த்³யம் ப⁴க³ம்॑ ப⁴॒க்ஷீத்யாஹ॑ ॥ 2 ॥\n" +
          "\n" +
          "ப⁴க³॒ ப்ரணே॑த॒-ர்ப⁴க³॒ ஸத்ய॑ராதோ⁴॒ ப⁴கே³॒மாம் தி⁴ய॒முத³॑வ॒த³த³॑ந்ந꞉ ।\n" +
          "ப⁴க³॒ப்ரணோ॑ ஜநய॒ கோ³பி⁴॒-ரஶ்வை॒ர்ப⁴க³॒ப்ரந்ருபி⁴॑-ர்ந்ரு॒வந்த॑ஸ்ஸ்யாம ॥ 3 ॥\n" +
          "\n" +
          "உ॒தேதா³நீம்॒ ப⁴க³॑வந்தஸ்ஸ்யாமோ॒த ப்ரபி॒த்வ உ॒த மத்⁴யே॒ அஹ்நா᳚ம் ।\n" +
          "உ॒தோதி³॑தா மக⁴வ॒ந்த்²ஸூர்ய॑ஸ்ய வ॒யம் தே³॒வாநாக்³ம்॑ ஸும॒தௌ ஸ்யா॑ம ॥ 4 ॥\n" +
          "\n" +
          "ப⁴க³॑ ஏ॒வ ப⁴க³॑வாக்³ம் அஸ்து தே³வா॒ஸ்தேந॑ வ॒யம் ப⁴க³॑வந்தஸ்ஸ்யாம ।\n" +
          "தம் த்வா॑ ப⁴க³॒ ஸர்வ॒ இஜ்ஜோ॑ஹவீமி॒ ஸநோ॑ ப⁴க³ புர ஏ॒தா ப⁴॑வேஹ ॥ 5 ॥\n" +
          "\n" +
          "ஸம॑த்⁴வ॒ராயோ॒ஷஸோ॑(அ)நமந்த த³தி⁴॒க்ராவே॑வ॒ ஶுசயே॑ ப॒தா³ய॑ ।\n" +
          "அ॒ர்வா॒சீ॒நம் வ॑ஸு॒வித³ம்॒ ப⁴க³॑ந்நோ॒ ரத²॑மி॒வா(அ)ஶ்வா॑வா॒ஜிந॒ ஆவ॑ஹந்து ॥ 6 ॥\n" +
          "\n" +
          "அஶ்வா॑வதீ॒-ர்கோ³ம॑தீ-ர்ந உ॒ஷாஸோ॑ வீ॒ரவ॑தீ॒ஸ்ஸத³॑-முச்ச²ந்து ப⁴॒த்³ரா꞉ ।\n" +
          "க்⁴ரு॒தம் து³ஹா॑நா வி॒ஶ்வத॒: ப்ரபீ॑நா யூ॒யம் பா॑த ஸ்வ॒ஸ்திபி⁴॒ஸ்ஸதா³॑ ந꞉ ॥ 7 ॥\n" +
          "\n" +
          "யோ மா᳚(அ)க்³நே பா⁴॒கி³நக்³ம்॑ ஸ॒ந்தமதா²॑பா⁴॒க³ம் சிகீ॑ருஷதி ।\n" +
          "அபா⁴॒க³ம॑க்³நே॒ தம் கு॑ரு॒ மாம॑க்³நே பா⁴॒கி³நம்॑ குரு ॥ 8 ॥\n" +
          "\n" +
          "ஓம் ஶாந்தி॒: ஶாந்தி॒: ஶாந்தி॑: ॥\n"),
  'medhasuktam': Ashtothram(
      'மேதா⁴ ஸூக்தம்',
      'medhasuktam',
      "ஓம் மே॒தா⁴தே³॒வீ ஜு॒ஷமா॑ணா ந॒ ஆகா³᳚த்³வி॒ஶ்வாசீ॑ ப⁴॒த்³ரா ஸு॑மந॒ஸ்யமா॑நா ।\n" +
          "த்வயா॒ ஜுஷ்டா॑ நு॒த³மா॑நா து³॒ருக்தா᳚ந் ப்³ரு॒ஹத்³வ॑தே³ம வி॒த³தே²॑ ஸு॒வீரா᳚: । (ய।வே।10।41।1)\n" +
          "\n" +
          "த்வயா॒ ஜுஷ்ட॑ ரு॒ஷிர்ப⁴॑வதி தே³வி॒ த்வயா॒ ப்³ரஹ்மா॑(ஆ)க³॒தஶ்ரீ॑ரு॒த த்வயா᳚ ।\n" +
          "த்வயா॒ ஜுஷ்ட॑ஶ்சி॒த்ரம் வி॑ந்த³தே வஸு॒ ஸாநோ॑ ஜுஷஸ்வ॒ த்³ரவி॑ணோ ந மேதே⁴ ॥\n" +
          "\n" +
          "மே॒தா⁴ம் ம॒ இந்த்³ரோ॑ த³தா³து மே॒தா⁴ம் தே³॒வீ ஸர॑ஸ்வதீ ।\n" +
          "மே॒தா⁴ம் மே॑ அ॒ஶ்விநா॑வு॒பா⁴வாத⁴॑த்தாம்॒ புஷ்க॑ரஸ்ரஜா ।\n" +
          "\n" +
          "அ॒ப்ஸ॒ராஸு॑ ச॒ யா மே॒தா⁴ க³॑ந்த⁴॒ர்வேஷு॑ ச॒ யந்மந॑: ।\n" +
          "தை³வீ᳚ மே॒தா⁴ ஸர॑ஸ்வதீ॒ ஸா மாம்᳚ மே॒தா⁴ ஸு॒ரபி⁴॑ர்ஜுஷதா॒க்³॒ ஸ்வாஹா᳚ ।\n" +
          "\n" +
          "ஆ மாம்᳚ மே॒தா⁴ ஸு॒ரபி⁴॑ர்வி॒ஶ்வரூ॑பா॒ ஹிர॑ண்யவர்ணா॒ ஜக³॑தீ ஜக³॒ம்யா ।\n" +
          "ஊர்ஜ॑ஸ்வதீ॒ பய॑ஸா॒ பிந்வ॑மாநா॒ ஸா மாம்᳚ மே॒தா⁴ ஸு॒ப்ரதீ॑கா ஜுஷந்தாம் ॥\n" +
          "\n" +
          "மயி॑ மே॒தா⁴ம் மயி॑ ப்ர॒ஜாம் மய்ய॒க்³நிஸ்தேஜோ॑ த³தா⁴து॒\n" +
          "மயி॑ மே॒தா⁴ம் மயி॑ ப்ர॒ஜாம் மயீந்த்³ர॑ இந்த்³ரி॒யம் த³॑தா⁴து॒\n" +
          "மயி॑ மே॒தா⁴ம் மயி॑ ப்ர॒ஜாம் மயி॒ ஸூர்யோ॒ ப்⁴ராஜோ॑ த³தா⁴து ॥\n" +
          "\n" +
          "ஓம் ஹம்॒ஸ॒ ஹம்॒ஸாய॑ வி॒த்³மஹே॑ பரமஹம்॒ஸாய॑ தீ⁴மஹி । தந்நோ॑ ஹம்ஸ꞉ ப்ரசோ॒த³யா᳚த் ॥\n" +
          "\n" +
          "ஓம் ஶாந்தி॒: ஶாந்தி॒: ஶாந்தி॑: ॥\n"),
  'bhrammasuktam': Ashtothram(
      'ப்³ரஹ்ம ஸூக்தம்',
      'bhrammasuktam',
      "ஓம் ப்³ரஹ்ம॑ஜஜ்ஞா॒நம் ப்ர॑த²॒மம் பு॒ரஸ்தா᳚த் ।\n" +
          "வி ஸீ॑ம॒த꞉ ஸு॒ருசோ॑ வே॒ந ஆ॑வ꞉ ।\n" +
          "ஸ பு³॒த்⁴நியா॑ உப॒மா அ॑ஸ்ய வி॒ஷ்டா²꞉ ।\n" +
          "ஸ॒தஶ்ச॒ யோநி॒-மஸ॑தஶ்ச॒ விவ॑: ।\n" +
          "\n" +
          "பி॒தா வி॒ராஜா॑ம்ருஷ॒போ⁴ ர॑யீ॒ணாம் ।\n" +
          "அ॒ந்தரி॑க்ஷம் வி॒ஶ்வரூ॑ப॒ ஆவி॑வேஶ ।\n" +
          "தம॒ர்கைர்-அ॒ப்⁴ய॑ர்சந்தி வ॒த்²ஸம் ।\n" +
          "ப்³ரஹ்ம॒ ஸந்தம்॒ ப்³ரஹ்ம॑ணா வ॒ர்த⁴ய॑ந்த꞉ ॥\n" +
          "\n" +
          "ப்³ரஹ்ம॑ தே³॒வாந॑ஜநயத் ।\n" +
          "ப்³ரஹ்ம॒ விஶ்வ॑மி॒த³ம் ஜக³॑த் ।\n" +
          "ப்³ரஹ்ம॑ண꞉ க்ஷ॒த்ரம் நிர்மி॑தம் ।\n" +
          "ப்³ரஹ்ம॑ ப்³ராஹ்ம॒ண ஆ॒த்மநா᳚ ॥\n" +
          "\n" +
          "அ॒ந்தர॑ஸ்மிந்நி॒மே லோ॒கா꞉ ।\n" +
          "அ॒ந்தர்விஶ்வ॑மி॒த³ம் ஜக³॑த் ।\n" +
          "ப்³ரஹ்மை॒வ பூ⁴॒தாநாம்॒ ஜ்யேஷ்ட²ம்᳚ ।\n" +
          "தேந॒ கோ॑(அ)ர்ஹதி॒ ஸ்பர்தி⁴॑தும் ॥\n" +
          "\n" +
          "ப்³ரஹ்ம॑ந் தே³॒வாஸ்த்ரய॑ஸ்த்ரிக்³ம்ஶத் ।\n" +
          "ப்³ரஹ்ம॑ந்நிந்த்³ர ப்ரஜாப॒தி ।\n" +
          "ப்³ரஹ்ம॑ந் ஹ॒ விஶ்வா॑ பூ⁴॒தாநி॑ ।\n" +
          "நா॒வீவா॒ந்த꞉ ஸ॒மாஹி॑தா ॥\n" +
          "\n" +
          "சத॑ஸ்ர॒ ஆஶா॒: ப்ரச॑ரந்-த்வ॒க்³நய॑: ।\n" +
          "இ॒மம் நோ॑ ய॒ஜ்ஞம் ந॑யது ப்ரஜா॒நந்ந் ।\n" +
          "க்⁴ரு॒தம் பிந்வ॑ந்ந॒ஜரக்³ம்॑ ஸு॒வீரம்᳚ ।\n" +
          "ப்³ரஹ்ம॑ ஸ॒மித்³-ப⁴॑வ॒த்யாஹு॑தீநாம் ॥\n"),
  // 'rudhrasuktam': Ashtothram('title', 'rudhrasuktam', 'manthram'),
  'dhurgasuktam': Ashtothram(
      'து³ர்கா³ ஸூக்தம்',
      'dhurgasuktam',
      "ஓம் ஜா॒தவே॑த³ஸே ஸுநவாம॒ ஸோம॑ மராதீய॒தோ நித³॑ஹாதி॒ வேத³॑: ।\n" +
          "ஸ ந॑: பர்ஷ॒த³தி॑ து³॒ர்கா³ணி॒ விஶ்வா॑ நா॒வேவ॒ ஸிந்து⁴ம்॑ து³ரி॒தா(அ)த்ய॒க்³நி꞉ ॥ 1\n" +
          "\n" +
          "தாம॒க்³நிவ॑ர்ணாம்॒ தப॑ஸா ஜ்வல॒ந்தீம் வை॑ரோச॒நீம் க॑ர்மப²॒லேஷு॒ ஜுஷ்டா᳚ம் ।\n" +
          "து³॒ர்கா³ம் தே³॒வீக்³ம் ஶர॑ணம॒ஹம் ப்ரப॑த்³யே ஸு॒தர॑ஸி தரஸே॒ நம॑: ॥ 2\n" +
          "\n" +
          "அக்³நே॒ த்வம்॑ பா॑ரயா॒ நவ்யோ॑ அ॒ஸ்மாந் ஸ்வ॒ஸ்திபி⁴॒ரதி॑ து³॒ர்கா³ணி॒ விஶ்வா᳚ ।\n" +
          "பூஶ்ச॑ ப்ரு॒த்²வீ ப³॑ஹு॒லா ந॑ உ॒ர்வீ ப⁴வா॑ தோ॒காய॒ தந॑யாய॒ ஶம்யோ꞉ ॥ 3\n" +
          "\n" +
          "விஶ்வா॑நி நோ து³॒ர்க³ஹா॑ ஜாதவேத³॒: ஸிந்து⁴ம்॒ ந நா॒வா து³ரி॒தா(அ)தி॑பர்ஷி ।\n" +
          "அக்³நே॑ அத்ரி॒வந்மந॑ஸா க்³ருணா॒நோ᳚(அ)ஸ்மாகம்॑ போ³த்⁴யவி॒தா த॒நூநா᳚ம் ॥ 4\n" +
          "\n" +
          "ப்ரு॒த॒நா॒ஜித॒க்³ம் ஸஹ॑மாநமு॒க்³ரம॒க்³நிக்³ம் ஹு॑வேம பர॒மாத்²ஸ॒த⁴ஸ்தா²᳚த் ।\n" +
          "ஸ ந॑: பர்ஷ॒த³தி॑ து³॒ர்கா³ணி॒ விஶ்வா॒ க்ஷாம॑த்³தே³வோ॒ அதி॑ து³ரி॒தா(அ)த்ய॒க்³நி꞉ ॥ 5\n" +
          "\n" +
          "ப்ர॒த்நோஷி॑ க॒மீட்³யோ॑ அத்⁴வ॒ரேஷு॑ ஸநாச்ச॒ ஹோதா॒ நவ்ய॑ஶ்ச॒ ஸத்ஸி॑ ।\n" +
          "ஸ்வாம் சா᳚(அ)க்³நே த॒நுவம்॑ பி॒ப்ரய॑ஸ்வா॒ஸ்மப்⁴யம்॑ ச॒ ஸௌப⁴॑க³॒மாய॑ஜஸ்வ ॥ 6\n" +
          "\n" +
          "கோ³பி⁴॒ர்ஜுஷ்ட॑ம॒யுஜோ॒ நிஷி॑க்தம்॒ தவே᳚ந்த்³ர விஷ்ணோ॒ரநு॒ஸஞ்ச॑ரேம ।\n" +
          "நாக॑ஸ்ய ப்ரு॒ஷ்ட²மபி⁴ ஸம்॒வஸா॑நோ॒ வைஷ்ண॑வீம் லோ॒க இ॒ஹ மா॑த³யந்தாம் ॥ 7\n" +
          "\n" +
          "ஓம் கா॒த்யா॒ய॒நாய॑ வி॒த்³மஹே॑ கந்யகு॒மாரி॑ தீ⁴மஹி । தந்நோ॑ து³ர்கி³꞉ ப்ரசோ॒த³யா᳚த் ॥\n" +
          "\n" +
          "ஓம் ஶாந்தி॒: ஶாந்தி॒: ஶாந்தி॑: ॥\n"),
  'pavamanasuktam': Ashtothram(
      'பவமான ஸூக்தம்',
      'pavamanasuktam',
      "ஓம் ॥ ஹிர॑ண்யவர்ணா॒: ஶுச॑ய꞉ பாவ॒கா\n" +
          "யாஸு॑ ஜா॒த꞉ க॒ஶ்யபோ॒ யாஸ்விந்த்³ர॑: ।\n" +
          "அ॒க்³நிம் யா க³ர்ப⁴ம்॑ த³தி⁴॒ரே விரூ॑பா॒ஸ்தா\n" +
          "ந॒ ஆப॒ஶ்ஶக்³க்³ ஸ்யோ॒நா ப⁴॑வந்து ॥\n" +
          "\n" +
          "யாஸா॒க்³ம்॒ ராஜா॒ வரு॑ணோ॒ யாதி॒ மத்⁴யே॑\n" +
          "ஸத்யாந்ரு॒தே அ॑வ॒பஶ்யம்॒ ஜநா॑நாம் ।\n" +
          "ம॒து⁴॒ஶ்சுத॒ஶ்ஶுச॑யோ॒ யா꞉ பா॑வ॒காஸ்தா\n" +
          "ந॒ ஆப॒ஶ்ஶக்³க்³ ஸ்யோ॒நா ப⁴॑வந்து ॥\n" +
          "\n" +
          "யாஸாம்᳚ தே³॒வா தி³॒வி க்ரு॒ண்வந்தி॑ ப⁴॒க்ஷம்\n" +
          "யா அ॒ந்தரி॑க்ஷே ப³ஹு॒தா⁴ ப⁴வ॑ந்தி ।\n" +
          "யா꞉ ப்ரு॑தி²॒வீம் பய॑ஸோ॒ந்த³ந்தி ஶு॒க்ராஸ்தா\n" +
          "ந॒ ஆப॒ஶ்ஶக்³க்³ ஸ்யோ॒நா ப⁴॑வந்து ॥\n" +
          "\n" +
          "ஶி॒வேந॑ மா॒ சக்ஷு॑ஷா பஶ்யதாபஶ்ஶி॒வயா॑\n" +
          "த॒நுவோப॑ ஸ்ப்ருஶத॒ த்வசம்॑ மே ।\n" +
          "ஸர்வாக்³ம்॑ அ॒க்³நீக்³ம் ர॑ப்ஸு॒ஷதோ³॑ ஹுவே வோ॒ மயி॒\n" +
          "வர்சோ॒ ப³ல॒மோஜோ॒ நித⁴॑த்த ॥\n" +
          "\n" +
          "பவ॑மாந॒ஸ்ஸுவ॒ர்ஜந॑: । ப॒வித்ரே॑ண॒ விச॑ர்ஷணி꞉ ।\n" +
          "ய꞉ போதா॒ ஸ பு॑நாது மா । பு॒நந்து॑ மா தே³வஜ॒நா꞉ ।\n" +
          "பு॒நந்து॒ மந॑வோ தி⁴॒யா । பு॒நந்து॒ விஶ்வ॑ ஆ॒யவ॑: ।\n" +
          "ஜாத॑வேத³꞉ ப॒வித்ர॑வத் । ப॒வித்ரே॑ண புநாஹி மா ।\n" +
          "ஶு॒க்ரேண॑ தே³வ॒தீ³த்³ய॑த் । அக்³நே॒ க்ரத்வா॒ க்ரதூ॒க்³ம்॒ ரநு॑ ।\n" +
          "யத்தே॑ ப॒வித்ர॑ம॒ர்சிஷி॑ । அக்³நே॒ வித॑தமந்த॒ரா ।\n" +
          "ப்³ரஹ்ம॒ தேந॑ புநீமஹே । உ॒பா⁴ப்⁴யாம்᳚ தே³வஸவித꞉ ।\n" +
          "ப॒வித்ரே॑ண ஸ॒வேந॑ ச । இ॒த³ம் ப்³ரஹ்ம॑ புநீமஹே ।\n" +
          "வை॒ஶ்வ॒தே³॒வீ பு॑ந॒தீ தே³॒வ்யாகா³᳚த் ।\n" +
          "யஸ்யை॑ ப³॒ஹ்வீஸ்த॒நுவோ॑ வீ॒தப்ரு॑ஷ்டா²꞉ ।\n" +
          "தயா॒ மத³॑ந்த꞉ ஸத⁴॒மாத்³யே॑ஷு ।\n" +
          "வ॒யக்³க்³ ஸ்யா॑ம॒ பத॑யோ ரயீ॒ணாம் ।\n" +
          "வை॒ஶ்வா॒ந॒ரோ ர॒ஶ்மிபி⁴॑ர்மா புநாது ।\n" +
          "வாத॑: ப்ரா॒ணேநே॑ஷி॒ரோ ம॑யோ॒ பூ⁴꞉ ।\n" +
          "த்³யாவா॑ப்ருதி²॒வீ பய॑ஸா॒ பயோ॑பி⁴꞉ ।\n" +
          "ரு॒தாவ॑ரீ ய॒ஜ்ஞியே॑ மா புநீதாம் ॥\n" +
          "\n" +
          "ப்³ரு॒ஹத்³பி⁴॑: ஸவித॒ஸ்த்ருபி⁴॑: । வர்ஷி॑ஷ்டை²ர்தே³வ॒மந்ம॑பி⁴꞉ । அக்³நே॒ த³க்ஷை᳚: புநாஹி மா । யேந॑ தே³॒வா அபு॑நத । யேநாபோ॑ தி³॒வ்யங்கஶ॑: । தேந॑ தி³॒வ்யேந॒ ப்³ரஹ்ம॑ணா । இ॒த³ம் ப்³ரஹ்ம॑ புநீமஹே । ய꞉ பா॑வமா॒நீர॒த்³த்⁴யேதி॑ । ருஷி॑பி⁴॒ஸ்ஸம்ப்⁴ரு॑த॒க்³ம்॒ ரஸம்᳚ । ஸர்வ॒க்³ம்॒ ஸ பூ॒தம॑ஶ்நாதி । ஸ்வ॒தி³॒தம் மா॑த॒ரிஶ்வ॑நா । பா॒வ॒மா॒நீர்யோ அ॒த்⁴யேதி॑ । ருஷி॑பி⁴॒ஸ்ஸம்ப்⁴ரு॑த॒க்³ம்॒ ரஸம்᳚ । தஸ்மை॒ ஸர॑ஸ்வதீ து³ஹே । க்ஷீ॒ரக்³ம் ஸ॒ர்பிர்மதூ⁴॑த³॒கம் ॥\n" +
          "\n" +
          "பா॒வ॒மா॒நீஸ்ஸ்வ॒ஸ்த்யய॑நீ꞉ । ஸு॒து³கா⁴॒ஹி பய॑ஸ்வதீ꞉ । ருஷி॑பி⁴॒ஸ்ஸம்ப்⁴ரு॑தோ॒ ரஸ॑: । ப்³ரா॒ஹ்ம॒ணேஷ்வ॒ம்ருதக்³ம்॑ ஹி॒தம் । பா॒வ॒மா॒நீர்தி³॑ஶந்து ந꞉ । இ॒மம் லோ॒கமதோ²॑ அ॒மும் । காமா॒ந்த்²ஸம॑ர்த⁴யந்து ந꞉ । தே³॒வீர்தே³॒வை꞉ ஸ॒மாப்⁴ரு॑தா꞉ । பா॒வ॒மா॒நீஸ்ஸ்வ॒ஸ்த்யய॑நீ꞉ । ஸு॒து³கா⁴॒ஹி க்⁴ரு॑த॒ஶ்சுத॑: । ருஷி॑பி⁴॒: ஸம்ப்⁴ரு॑தோ॒ ரஸ॑: । ப்³ரா॒ஹ்ம॒ணேஷ்வ॒ம்ருதக்³ம்॑ ஹி॒தம் । யேந॑ தே³॒வா꞉ ப॒வித்ரே॑ண । ஆ॒த்மாநம்॑ பு॒நதே॒ ஸதா³᳚ । தேந॑ ஸ॒ஹஸ்ர॑தா⁴ரேண । பா॒வ॒மா॒ந்ய꞉ பு॑நந்து மா । ப்ரா॒ஜா॒ப॒த்யம் ப॒வித்ரம்᳚ । ஶ॒தோத்³யா॑மக்³ம் ஹிர॒ண்மயம்᳚ । தேந॑ ப்³ரஹ்ம॒ விதோ³॑ வ॒யம் । பூ॒தம் ப்³ரஹ்ம॑ புநீமஹே । இந்த்³ர॑ஸ்ஸுநீ॒தீ ஸ॒ஹமா॑ புநாது । ஸோம॑ஸ்ஸ்வ॒ஸ்த்யா வ॑ருணஸ்ஸ॒மீச்யா᳚ । ய॒மோ ராஜா᳚ ப்ரம்ரு॒ணாபி⁴॑: புநாது மா । ஜா॒தவே॑தா³ மோ॒ர்ஜய॑ந்த்யா புநாது । பூ⁴ர்பு⁴வ॒ஸ்ஸுவ॑: ॥\n" +
          "\n" +
          "ஓம் தச்ச²ம்॒ யோராவ்ரு॑ணீமஹே । கா³॒தும் ய॒ஜ்ஞாய॑ ।\n" +
          "கா³॒தும் ய॒ஜ்ஞப॑தயே । தை³வீ᳚ஸ்ஸ்வ॒ஸ்திர॑ஸ்து ந꞉ । ஸ்வ॒ஸ்திர்மாநு॑ஷேப்⁴ய꞉ । ஊ॒ர்த்⁴வம் ஜி॑கா³து பே⁴ஷ॒ஜம் ।\n" +
          "ஶம் நோ॑ அஸ்து த்³வி॒பதே³᳚ । ஶம் சது॑ஷ்பதே³ ॥\n" +
          "\n" +
          "ஓம் ஶாந்தி॒: ஶாந்தி॒: ஶாந்தி॑: ॥\n"),
  'nakshatrasuktam': Ashtothram(
      'நக்ஷத்ர ஸூக்தம்',
      'nakshatrasuktam',
      "க்ருத்திக –\n" +
          "அ॒க்³நிர்ந॑: பாது॒ க்ருத்தி॑கா꞉ ।\n" +
          "நக்ஷ॑த்ரம் தே³॒வமி॑ந்த்³ரி॒யம் ।\n" +
          "இ॒த³மா॑ஸாம் விசக்ஷ॒ணம் ।\n" +
          "ஹ॒விரா॒ஸம் ஜு॑ஹோதந ।\n" +
          "யஸ்ய॒ பா⁴ந்தி॑ ர॒ஶ்மயோ॒ யஸ்ய॑ கே॒தவ॑: ।\n" +
          "யஸ்யே॒மா விஶ்வா॒ பு⁴வ॑நாநி॒ ஸர்வா᳚ ।\n" +
          "ஸ க்ருத்தி॑காபி⁴ர॒பி⁴ஸம்॒வஸா॑ந꞉ ।\n" +
          "அ॒க்³நிர்நோ॑ தே³॒வஸ்ஸு॑வி॒தே த³॑தா⁴து ॥ 1 ॥\n" +
          "\n" +
          "ரோஹிணி –\n" +
          "ப்ர॒ஜாப॑தே ரோஹி॒ணீவே॑து॒ பத்நீ᳚ ।\n" +
          "வி॒ஶ்வரூ॑பா ப்³ருஹ॒தீ சி॒த்ரபா⁴॑நு꞉ ।\n" +
          "ஸா நோ॑ ய॒ஜ்ஞஸ்ய॑ ஸுவி॒தே த³॑தா⁴து ।\n" +
          "யதா²॒ ஜீவே॑ம ஶ॒ரத³॒ஸ்ஸவீரா॑: ।\n" +
          "ரோ॒ஹி॒ணீ தே³॒வ்யுத³॑கா³த்பு॒ரஸ்தா᳚த் ।\n" +
          "விஶ்வா॑ ரூ॒பணி॑ ப்ரதி॒மோத³॑மாநா ।\n" +
          "ப்ர॒ஜாப॑திக்³ம் ஹ॒விஷா॑ வ॒ர்த⁴ய॑ந்தீ ।\n" +
          "ப்ரி॒யா தே³॒வாநா॒முப॑யாது ய॒ஜ்ஞம் ॥ 2 ॥\n" +
          "\n" +
          "ம்ருக³ஶிர –\n" +
          "ஸோமோ॒ ராஜா॑ ம்ருக³ஶீ॒ர்॒ஷேண॒ ஆக³ந்ந்॑ ।\n" +
          "ஶி॒வம் நக்ஷ॑த்ரம் ப்ரி॒யம॑ஸ்ய॒ தா⁴ம॑ ।\n" +
          "ஆ॒ப்யாய॑மாநோ ப³ஹு॒தா⁴ ஜநே॑ஷு ।\n" +
          "ரேத॑: ப்ர॒ஜாம் யஜ॑மாநே த³தா⁴து ।\n" +
          "யத்தே॒ நக்ஷ॑த்ரம் ம்ருக³ஶீ॒ர்॒ஷமஸ்தி॑ ।\n" +
          "ப்ரி॒யக்³ம் ரா॑ஜந் ப்ரி॒யத॑மம் ப்ரி॒யாணா᳚ம் ।\n" +
          "தஸ்மை॑ தே ஸோம ஹ॒விஷா॑ விதே⁴ம ।\n" +
          "ஶந்ந॑ ஏதி⁴ த்³வி॒பதே³॒ ஶம் சது॑ஷ்பதே³ ॥ 3 ॥\n" +
          "\n" +
          "ஆர்த்³ர –\n" +
          "ஆ॒ர்த்³ரயா॑ ரு॒த்³ர꞉ ப்ரத²॑மா ந ஏதி ।\n" +
          "ஶ்ரேஷ்டோ²॑ தே³॒வாநாம்॒ பதி॑ரக்⁴நி॒யாநா᳚ம் ।\n" +
          "நக்ஷ॑த்ரமஸ்ய ஹ॒விஷா॑ விதே⁴ம ।\n" +
          "மா ந॑: ப்ர॒ஜாக்³ம் ரீ॑ரிஷ॒ந்மோத வீ॒ராந் ।\n" +
          "ஹே॒தீ ரு॒த்³ரஸ்ய॒ பரி॑ணோ வ்ருணக்து ।\n" +
          "ஆ॒ர்த்³ரா நக்ஷ॑த்ரம் ஜுஷதாக்³ம் ஹ॒விர்ந॑: ।\n" +
          "ப்ர॒மு॒ஞ்சமா॑நௌ து³ரி॒தாநி॒ விஶ்வா᳚ ।\n" +
          "அபா॒க⁴ஶக்³ம்ஸந்நுத³தா॒மரா॑திம் ॥ 4 ॥\n" +
          "\n" +
          "புநர்வஸு –\n" +
          "புந॑ர்நோ தே³॒வ்யதி³॑திஸ்ப்ருணோது ।\n" +
          "புந॑ர்வஸூந॒: புந॒ரேதாம்᳚ ய॒ஜ்ஞம் ।\n" +
          "புந॑ர்நோ தே³॒வா அ॒பி⁴ய॑ந்து॒ ஸர்வே᳚ ।\n" +
          "புந॑: புநர்வோ ஹ॒விஷா॑ யஜாம꞉ ।\n" +
          "ஏ॒வா ந தே³॒வ்யதி³॑திரந॒ர்வா ।\n" +
          "விஶ்வ॑ஸ்ய ப⁴॒ர்த்ரீ ஜக³॑த꞉ ப்ரதி॒ஷ்டா² ।\n" +
          "புந॑ர்வஸூ ஹ॒விஷா॑ வ॒ர்த⁴ய॑ந்தீ ।\n" +
          "ப்ரி॒யந்தே³॒வாநா॒மப்யே॑து॒ பாத²॑: ॥ 5 ॥\n" +
          "\n" +
          "புஷ்யமி –\n" +
          "ப்³ருஹ॒ஸ்பதி॑: ப்ரத²॒மம் ஜாய॑மாந꞉ ।\n" +
          "தி॒ஷ்யம்॑ நக்ஷ॑த்ரம॒பி⁴ ஸம்ப³॑பூ⁴வ ।\n" +
          "ஶ்ரேஷ்டோ²॑ தே³॒வாநாம்॒ ப்ருத॑நாஸு ஜி॒ஷ்ணு꞉ ।\n" +
          "தி³॒ஶோ(அ)நு॒ ஸர்வா॒ அப⁴॑யந்நோ அஸ்து ।\n" +
          "தி॒ஷ்ய॑: பு॒ரஸ்தா॑து³॒த ம॑த்⁴ய॒தோ ந॑: ।\n" +
          "ப்³ருஹ॒ஸ்பதி॑ர்ந॒: பரி॑பாது ப॒ஶ்சாத் ।\n" +
          "பா³தே⁴॑தா॒ந்த்³வேஷோ॒ அப⁴॑யம் க்ருணுதாம் ।\n" +
          "ஸு॒வீர்ய॑ஸ்ய॒ பத॑யஸ்யாம ॥ 6 ॥\n" +
          "\n" +
          "ஆஶ்ரேஷா –\n" +
          "இ॒த³க்³ம் ஸ॒ர்பேப்⁴யோ॑ ஹ॒விர॑ஸ்து॒ ஜுஷ்டம்᳚ ।\n" +
          "ஆ॒ஶ்ரே॒ஷா யேஷா॑மநு॒யந்தி॒ சேத॑: ।\n" +
          "யே அ॒ந்தரி॑க்ஷம் ப்ருதி²॒வீம் க்ஷி॒யந்தி॑ ।\n" +
          "தே ந॑ஸ்ஸ॒ர்பாஸோ॒ ஹவ॒மாக³॑மிஷ்டா²꞉ ।\n" +
          "யே ரோ॑ச॒நே ஸூர்ய॒ஸ்யாபி॑ ஸ॒ர்பா꞉ ।\n" +
          "யே தி³வம்॑ தே³॒வீமநு॑ஸ॒ஞ்சர॑ந்தி ।\n" +
          "யேஷா॑மாஶ்ரே॒ஷா அ॑நு॒யந்தி॒ காமம்᳚ ।\n" +
          "தேப்⁴ய॑ஸ்ஸ॒ர்பேப்⁴யோ॒ மது⁴॑மஜ்ஜுஹோமி ॥ 7 ॥\n" +
          "\n" +
          "மகா⁴ –\n" +
          "உப॑ஹூதா꞉ பி॒தரோ॒ யே ம॒கா⁴ஸு॑ ।\n" +
          "மநோ॑ஜவஸஸ்ஸு॒க்ருத॑ஸ்ஸுக்ரு॒த்யா꞉ ।\n" +
          "தே நோ॒ நக்ஷ॑த்ரே॒ ஹவ॒மாக³॑மிஷ்டா²꞉ ।\n" +
          "ஸ்வ॒தா⁴பி⁴॑ர்ய॒ஜ்ஞம் ப்ரய॑தம் ஜுஷந்தாம் ।\n" +
          "யே அ॑க்³நித³॒க்³தா⁴ யே(அ)ந॑க்³நித³க்³தா⁴꞉ ।\n" +
          "யே॑(அ)மும் லோ॒கம் பி॒தர॑: க்ஷி॒யந்தி॑ ।\n" +
          "யாக்³ம்ஶ்ச॑ வி॒த்³மயாக்³ம் உ॑ ச॒ ந ப்ர॑வி॒த்³ம ।\n" +
          "ம॒கா⁴ஸு॑ ய॒ஜ்ஞக்³ம் ஸுக்ரு॑தம் ஜுஷந்தாம் ॥ 8 ॥\n" +
          "\n" +
          "பூர்வப²ல்கு³நீ –\n" +
          "க³வாம்॒ பதி॒: ப²ல்கு³॑நீநாமஸி॒ த்வம் ।\n" +
          "தத³॑ர்யமந்வருணமித்ர॒ சாரு॑ ।\n" +
          "தம் த்வா॑ வ॒யக்³ம் ஸ॑நி॒தாரக்³ம்॑ ஸநீ॒நாம் ।\n" +
          "ஜீ॒வா ஜீவ॑ந்த॒முப॒ ஸம்வி॑ஶேம ।\n" +
          "யேநே॒மா விஶ்வா॒ பு⁴வ॑நாநி॒ ஸஞ்ஜி॑தா ।\n" +
          "யஸ்ய॑ தே³॒வா அ॑நுஸ॒ம்யந்தி॒ சேத॑: ।\n" +
          "அ॒ர்ய॒மா ராஜா॒(அ)ஜர॒ஸ்து வி॑ஷ்மாந் ।\n" +
          "ப²ல்கு³॑நீநாம்ருஷ॒போ⁴ ரோ॑ரவீதி ॥ 9 ॥\n" +
          "\n" +
          "உத்தரப²ல்கு³நீ –\n" +
          "ஶ்ரேஷ்டோ²॑ தே³॒வாநாம்᳚ ப⁴க³வோ ப⁴கா³ஸி ।\n" +
          "தத்த்வா॑ விது³॒: ப²ல்கு³॑நீ॒ஸ்தஸ்ய॑ வித்தாத் ।\n" +
          "அ॒ஸ்மப்⁴யம்॑ க்ஷ॒த்ரம॒ஜரக்³ம்॑ ஸு॒வீர்யம்᳚ ।\n" +
          "கோ³ம॒த³ஶ்வ॑வ॒து³ப॒ஸந்நு॑தே³॒ஹ ।\n" +
          "ப⁴கோ³॑ஹ தா³॒தா ப⁴க³ இத்ப்ர॑தா³॒தா ।\n" +
          "ப⁴கோ³॑ தே³॒வீ꞉ ப²ல்கு³॑நீ॒ராவி॑வேஶ ।\n" +
          "ப⁴க³॒ஸ்யேத்தம் ப்ர॑ஸ॒வங்க³॑மேம ।\n" +
          "யத்ர॑ தே³॒வைஸ்ஸ॑த⁴॒மாத³ம்॑ மதே³ம ॥ 10 ॥\n" +
          "\n" +
          "ஹஸ்தா –\n" +
          "ஆயா॒து தே³॒வஸ்ஸ॑வி॒தோப॑யாது ।\n" +
          "ஹி॒ர॒ண்யயே॑ந ஸு॒வ்ருதா॒ ரதே²॑ந ।\n" +
          "வஹ॒ந்॒ ஹஸ்தக்³ம்॑ ஸுப⁴க³ம்॑ வித்³ம॒நாப॑ஸம் ।\n" +
          "ப்ரயச்ச²॑ந்தம்॒ பபு॑ரிம்॒ புண்ய॒மச்ச²॑ ।\n" +
          "ஹஸ்த॒: ப்ரய॑ச்ச² த்வ॒ம்ருதம்॒ வஸீ॑ய꞉ ।\n" +
          "த³க்ஷி॑ணேந॒ ப்ரதி॑க்³ருப்⁴ணீம ஏநத் ।\n" +
          "தா³॒தார॑ம॒த்³ய ஸ॑வி॒தா வி॑தே³ய ।\n" +
          "யோ நோ॒ ஹஸ்தா॑ய ப்ரஸு॒வாதி॑ ய॒ஜ்ஞம் ॥ 11 ॥\n" +
          "\n" +
          "சித்ரா –\n" +
          "த்வஷ்டா॒ நக்ஷ॑த்ரம॒ப்⁴யே॑தி சி॒த்ராம் ।\n" +
          "ஶு॒ப⁴க்³ம் ஸ॑ஸம்யுவ॒திக்³ம் ரோச॑மாநாம் ।\n" +
          "நி॒வே॒ஶய॑ந்ந॒ம்ருதா॒ந்மர்த்யாக்³॑ஶ்ச ।\n" +
          "ரூ॒பாணி॑ பி॒க்³ம்॒ஶந்பு⁴வ॑நாநி॒ விஶ்வா᳚ ।\n" +
          "தந்ந॒ஸ்த்வஷ்டா॒ தது³॑ சி॒த்ரா விச॑ஷ்டாம் ।\n" +
          "தந்நக்ஷ॑த்ரம் பூ⁴ரி॒தா³ அ॑ஸ்து॒ மஹ்யம்᳚ ।\n" +
          "தந்ந॑: ப்ர॒ஜாம் வீ॒ரவ॑தீக்³ம் ஸநோது ।\n" +
          "கோ³பி⁴॑ர்நோ॒ அஶ்வை॒ஸ்ஸம॑நக்து யஜ்ஞம் ॥ 12 ॥\n" +
          "\n" +
          "ஸ்வாதீ –\n" +
          "வா॒யுர்நக்ஷ॑த்ரம॒ப்⁴யே॑தி॒ நிஷ்ட்யா᳚ம் ।\n" +
          "தி॒க்³மஶ்ரு॑ங்கோ³ வ்ருஷ॒போ⁴ ரோரு॑வாண꞉ ।\n" +
          "ஸ॒மீ॒ரய॒ந்பு⁴வ॑நா மாத॒ரிஶ்வா᳚ ।\n" +
          "அப॒ த்³வேஷாக்³ம்॑ஸி நுத³தா॒மரா॑தீ꞉ ।\n" +
          "தந்நோ॑ வா॒யஸ்தது³॒ நிஷ்ட்யா॑ ஶ்ருணோது ।\n" +
          "தந்நக்ஷ॑த்ரம் பூ⁴ரி॒தா³ அ॑ஸ்து॒ மஹ்யம்᳚ ।\n" +
          "தந்நோ॑ தே³॒வாஸோ॒ அநு॑ஜாநந்து॒ காமம்᳚ ।\n" +
          "யதா²॒ தரே॑ம து³ரி॒தாநி॒ விஶ்வா᳚ ॥ 13 ॥\n" +
          "\n" +
          "விஶாகா² –\n" +
          "தூ³॒ரம॒ஸ்மச்ச²த்ர॑வோ யந்து பீ⁴॒தா꞉ ।\n" +
          "ததி³॑ந்த்³ரா॒க்³நீ க்ரு॑ணுதாம்॒ தத்³விஶா॑கே² ।\n" +
          "தந்நோ॑ தே³॒வா அநு॑மத³ந்து ய॒ஜ்ஞம் ।\n" +
          "ப॒ஶ்சாத் பு॒ரஸ்தா॒த³ப⁴॑யந்நோ அஸ்து ।\n" +
          "நக்ஷ॑த்ராணா॒மதி⁴॑பத்நீ॒ விஶா॑கே² ।\n" +
          "ஶ்ரேஷ்டா²॑விந்த்³ரா॒க்³நீ பு⁴வ॑நஸ்ய கோ³॒பௌ ।\n" +
          "விஷூ॑ச॒ஶ்ஶத்ரூ॑நப॒பா³த⁴॑மாநௌ ।\n" +
          "அப॒க்ஷுத⁴॑ந்நுத³தா॒மரா॑திம் ॥ 14 ॥\n" +
          "\n" +
          "பூர்ணிமா –\n" +
          "பூ॒ர்ணா ப॒ஶ்சாது³॒த பூ॒ர்ணா பு॒ரஸ்தா᳚த் ।\n" +
          "உந்ம॑த்⁴ய॒த꞉ பௌ᳚ர்ணமா॒ஸீ ஜி॑கா³ய ।\n" +
          "தஸ்யாம்᳚ தே³॒வா அதி⁴॑ஸம்॒வஸ॑ந்த꞉ ।\n" +
          "உ॒த்த॒மே நாக॑ இ॒ஹ மா॑த³யந்தாம் ।\n" +
          "ப்ரு॒த்²வீ ஸு॒வர்சா॑ யுவ॒திஸ்ஸ॒ஜோஷா᳚: ।\n" +
          "பௌ॒ர்ண॒மா॒ஸ்யுத³॑கா³॒ச்சோ²ப⁴॑மாநா ।\n" +
          "ஆ॒ப்யா॒யய॑ந்தீ து³ரி॒தாநி॒ விஶ்வா᳚ ।\n" +
          "உ॒ரும் து³ஹாம்॒ யஜ॑மாநாய ய॒ஜ்ஞம் ॥ 15 ॥\n" +
          "\n" +
          "அநுராதா⁴ –\n" +
          "ரு॒த்³த்⁴யாஸ்ம॑ ஹ॒வ்யைர்நம॑ஸோ॒பஸத்³ய॑ ।\n" +
          "மி॒த்ரம் தே³॒வம் மி॑த்ர॒தே⁴ய॑ந்நோ அஸ்து ।\n" +
          "அ॒நூ॒ரா॒தா⁴ந் ஹ॒விஷா॑ வ॒ர்த⁴ய॑ந்த꞉ ।\n" +
          "ஶ॒தம் ஜீ॑வேம॒ ஶ॒ரத³॒ஸ்ஸவீ॑ரா꞉ ।\n" +
          "சி॒த்ரம் நக்ஷ॑த்ர॒முத³॑கா³த்பு॒ரஸ்தா᳚த் ।\n" +
          "அ॒நூ॒ரா॒தா⁴ ஸ॒ இதி॒ யத்³வத³॑ந்தி ।\n" +
          "தந்மி॒த்ர ஏ॑தி ப॒தி²பி⁴॑ர்தே³வ॒யாநை᳚: ।\n" +
          "ஹி॒ர॒ண்யயை॒ர்வித॑தைர॒ந்தரி॑க்ஷே ॥ 16 ॥\n" +
          "\n" +
          "ஜ்யேஷ்டா² –\n" +
          "இந்த்³ரோ᳚ ஜ்யே॒ஷ்டா²மநு॒ நக்ஷ॑த்ரமேதி ।\n" +
          "யஸ்மி॑ந் வ்ரு॒த்ரம் வ்ரு॑த்ர॒ தூர்யோ॑ த॒தார॑ ।\n" +
          "தஸ்மி॑ந்வ॒யம॒ம்ருதம்॒ து³ஹா॑நா꞉ ।\n" +
          "க்ஷுத⁴॑ந்தரேம॒ து³ரி॑திம்॒ து³ரி॑ஷ்டிம் ।\n" +
          "பு॒ர॒ந்த³॒ராய॑ வ்ருஷ॒பா⁴ய॑ த்⁴ரு॒ஷ்ணவே᳚ ।\n" +
          "அஷா॑டா⁴ய॒ ஸஹ॑மாநாய மீ॒டு⁴ஷே᳚ ।\n" +
          "இந்த்³ரா॑ய ஜ்யே॒ஷ்டா² மது⁴॑ம॒த்³து³ஹா॑நா ।\n" +
          "உ॒ரும் க்ரு॑ணோது॒ யஜ॑மாநாய லோ॒கம் ॥ 17 ॥\n" +
          "\n" +
          "மூலா –\n" +
          "மூலம்॑ ப்ர॒ஜாம் வீ॒ரவ॑தீம் விதே³ய ।\n" +
          "பரா᳚ச்யேது॒ நிர்ரு॑தி꞉ பரா॒சா ।\n" +
          "கோ³பி⁴॒ர்நக்ஷ॑த்ரம் ப॒ஶுபி⁴॒ஸ்ஸம॑க்தம் ।\n" +
          "அஹ॑ர்பூ⁴யா॒த்³யஜ॑மாநாய॒ மஹ்யம்᳚ ।\n" +
          "அஹ॑ர்நோ அ॒த்³ய ஸு॑வி॒தே த³॑தா³து ।\n" +
          "மூலம்॒ நக்ஷ॑த்ர॒மிதி॒ யத்³வத³॑ந்தி ।\n" +
          "பரா॑சீம் வா॒சா நிர்ரு॑திம் நுதா³மி ।\n" +
          "ஶி॒வம் ப்ர॒ஜயை॑ ஶி॒வம॑ஸ்து॒ மஹ்யம்᳚ ॥ 18 ॥\n" +
          "\n" +
          "பூர்வாஷாடா⁴ –\n" +
          "யா தி³॒வ்யா ஆப॒: பய॑ஸா ஸம்ப³பூ⁴॒வு꞉ ।\n" +
          "யா அ॒ந்தரி॑க்ஷ உ॒த பார்தி²॑வீ॒ர்யா꞉ ।\n" +
          "யாஸா॑மஷா॒டா⁴ அ॑நு॒யந்தி॒ காமம்᳚ ।\n" +
          "தா ந॒ ஆப॒ஶ்ஶக்³க்³ ஸ்யோ॒நா ப⁴॑வந்து ।\n" +
          "யாஶ்ச॒ கூப்யா॒ யாஶ்ச॑ நா॒த்³யா᳚ஸ்ஸமு॒த்³ரியா᳚: ।\n" +
          "யாஶ்ச॑ வைஶ॒ந்தீருத ப்ரா॑ஸ॒சீர்யா꞉ ।\n" +
          "யாஸா॑மஷா॒டா⁴ மது⁴॑ ப⁴॒க்ஷய॑ந்தி ।\n" +
          "தா ந॒ ஆப॒ஶ்ஶக்³க்³ ஸ்யோ॒நா ப⁴॑வந்து ॥ 19 ॥\n" +
          "\n" +
          "உத்தராஷாடா⁴ –\n" +
          "தந்நோ॒ விஶ்வே॒ உப॑ ஶ்ருண்வந்து தே³॒வா꞉ ।\n" +
          "தத³॑ஷா॒டா⁴ அ॒பி⁴ஸம்ய॑ந்து ய॒ஜ்ஞம் ।\n" +
          "தந்நக்ஷ॑த்ரம் ப்ரத²தாம் ப॒ஶுப்⁴ய॑: ।\n" +
          "க்ரு॒ஷிர்வ்ரு॒ஷ்டிர்யஜ॑மாநாய கல்பதாம் ।\n" +
          "ஶு॒ப்⁴ரா꞉ க॒ந்யா॑ யுவ॒தய॑ஸ்ஸு॒பேஶ॑ஸ꞉ ।\n" +
          "க॒ர்ம॒க்ருத॑ஸ்ஸு॒க்ருதோ॑ வீ॒ர்யா॑வதீ꞉ ।\n" +
          "விஶ்வா᳚ந் தே³॒வாந் ஹ॒விஷா॑ வ॒ர்த⁴ய॑ந்தீ꞉ ।\n" +
          "அ॒ஷா॒டா⁴꞉ காம॒முப॑யாந்து ய॒ஜ்ஞம் ॥ 20 ॥\n" +
          "\n" +
          "அபி⁴ஜித் –\n" +
          "யஸ்மி॒ந் ப்³ரஹ்மா॒ப்⁴யஜ॑ய॒த்ஸர்வ॑மே॒தத் ।\n" +
          "அ॒முஞ்ச॑ லோ॒கமி॒த³மூ॑ச॒ ஸர்வம்᳚ ।\n" +
          "தந்நோ॒ நக்ஷ॑த்ரமபி⁴॒ஜித்³வி॒ஜித்ய॑ ।\n" +
          "ஶ்ரியம்॑ த³தா⁴॒த்வஹ்ரு॑ணீயமாநம் ।\n" +
          "உ॒பௌ⁴ லோ॒கௌ ப்³ரஹ்ம॑ணா॒ ஸஞ்ஜி॑தே॒மௌ ।\n" +
          "தந்நோ॒ நக்ஷ॑த்ரமபி⁴॒ஜித்³விச॑ஷ்டாம் ।\n" +
          "தஸ்மி॑ந்வ॒யம் ப்ருத॑நா॒ஸ்ஸஞ்ஜ॑யேம ।\n" +
          "தந்நோ॑ தே³॒வாஸோ॒ அநு॑ஜாநந்து॒ காமம்᳚ ॥ 21 ॥\n" +
          "\n" +
          "ஶ்ரவணம் –\n" +
          "ஶ்ரு॒ண்வந்தி॑ ஶ்ரோ॒ணாம॒ம்ருத॑ஸ்ய கோ³॒பாம் ।\n" +
          "புண்யா॑மஸ்யா॒ உப॑ஶ்ருணோமி॒ வாசம்᳚ ।\n" +
          "ம॒ஹீம் தே³॒வீம் விஷ்ணு॑பத்நீமஜூ॒ர்யாம் ।\n" +
          "ப்ர॒தீசீ॑ மேநாக்³ம் ஹ॒விஷா॑ யஜாம꞉ ।\n" +
          "த்ரே॒தா⁴ விஷ்ணு॑ருருகா³॒யோ விச॑க்ரமே ।\n" +
          "ம॒ஹீம் தி³வம்॑ ப்ருதி²॒வீம॒ந்தரி॑க்ஷம் ।\n" +
          "தச்ச்²ரோ॒ணைதி॒ஶ்ரவ॑ இ॒ச்ச²மா॑நா ।\n" +
          "புண்ய॒க்³க்³॒ ஶ்லோகம்॒ யஜ॑மாநாய க்ருண்வ॒தீ ॥ 22 ॥\n" +
          "\n" +
          "த⁴நிஷ்ட² –\n" +
          "அ॒ஷ்டௌ தே³॒வா வஸ॑வஸ்ஸோ॒ம்யாஸ॑: ।\n" +
          "சத॑ஸ்ரோ தே³॒வீர॒ஜரா॒: ஶ்ரவி॑ஷ்டா²꞉ ।\n" +
          "தே ய॒ஜ்ஞம் பா᳚ந்து॒ ரஜ॑ஸ꞉ ப॒ரஸ்தா᳚த் ।\n" +
          "ஸம்॒வ॒த்²ஸ॒ரீண॑ம॒ம்ருதக்³க்³॑ ஸ்வ॒ஸ்தி ।\n" +
          "ய॒ஜ்ஞம் ந॑: பாந்து॒ வஸ॑வ꞉ பு॒ரஸ்தா᳚த் ।\n" +
          "த³॒க்ஷி॒ண॒தோ॑(அ)பி⁴ய॑ந்து॒ ஶ்ரவி॑ஷ்டா²꞉ ।\n" +
          "புண்யம்॒ நக்ஷ॑த்ரம॒பி⁴ ஸம்வி॑ஶாம ।\n" +
          "மா நோ॒ அரா॑திர॒க⁴ஶ॒க்³ம்॒ஸா(அ)க³ந்ந்॑ ॥ 23 ॥\n" +
          "\n" +
          "ஶதபி⁴ஷக் –\n" +
          "க்ஷ॒த்ரஸ்ய॒ ராஜா॒ வரு॑ணோ(அ)தி⁴ரா॒ஜ꞉ ।\n" +
          "நக்ஷ॑த்ராணாக்³ம் ஶ॒தபி⁴॑ஷ॒க்³வஸி॑ஷ்ட²꞉ ।\n" +
          "தௌ தே³॒வேப்⁴ய॑: க்ருணுதோ தீ³॒ர்க⁴மாயு॑: ।\n" +
          "ஶ॒தக்³ம் ஸ॒ஹஸ்ரா॑ பே⁴ஷ॒ஜாநி॑ த⁴த்த꞉ ।\n" +
          "ய॒ஜ்ஞந்நோ॒ ராஜா॒ வரு॑ண॒ உப॑யாது ।\n" +
          "தந்நோ॒ விஶ்வே॑ அ॒பி⁴ ஸம்ய॑ந்து தே³॒வா꞉ ।\n" +
          "தந்நோ॒ நக்ஷ॑த்ரக்³ம் ஶ॒தபி⁴॑ஷக்³ஜுஷா॒ணம் ।\n" +
          "தீ³॒ர்க⁴மாயு॒: ப்ரதி॑ரத்³பே⁴ஷ॒ஜாநி॑ ॥ 24 ॥\n" +
          "\n" +
          "பூர்வாபா⁴த்³ரா –\n" +
          "அ॒ஜ ஏக॑பா॒து³த³॑கா³த்பு॒ரஸ்தா᳚த் ।\n" +
          "விஶ்வா॑ பூ⁴॒தாநி॑ ப்ரதி॒ மோத³॑மாந꞉ ।\n" +
          "தஸ்ய॑ தே³॒வா꞉ ப்ர॑ஸ॒வம் ய॑ந்தி॒ ஸர்வே᳚ ।\n" +
          "ப்ரோ॒ஷ்ட²॒ப॒தா³ஸோ॑ அ॒ம்ருத॑ஸ்ய கோ³॒பா꞉ ।\n" +
          "வி॒ப்⁴ராஜ॑மாநஸ்ஸமிதா⁴॒ ந உ॒க்³ர꞉ ।\n" +
          "ஆ(அ)ந்தரி॑க்ஷமருஹ॒த³க³॒ந்த்³யாம் ।\n" +
          "தக்³ம் ஸூர்யம்॑ தே³॒வம॒ஜமேக॑பாத³ம் ।\n" +
          "ப்ரோ॒ஷ்ட²॒ப॒தா³ஸோ॒ அநு॑யந்தி॒ ஸர்வே᳚ ॥ 25 ॥\n" +
          "\n" +
          "உத்தராபா⁴த்³ரா –\n" +
          "அஹி॑ர்பு³॒த்⁴நிய॒: ப்ரத²॑மா ந ஏதி ।\n" +
          "ஶ்ரேஷ்டோ²॑ தே³॒வாநா॑மு॒த மாநு॑ஷாணாம் ।\n" +
          "தம் ப்³ரா᳚ஹ்ம॒ணாஸ்ஸோ॑ம॒பாஸ்ஸோ॒ம்யாஸ॑: ।\n" +
          "ப்ரோ॒ஷ்ட²॒ப॒தா³ஸோ॑ அ॒பி⁴ர॑க்ஷந்தி॒ ஸர்வே᳚ ।\n" +
          "ச॒த்வார॒ ஏக॑ம॒பி⁴ கர்ம॑ தே³॒வா꞉ ।\n" +
          "ப்ரோ॒ஷ்ட²॒ப॒தா³ ஸ॒ இதி॒ யாந் வத³॑ந்தி ।\n" +
          "தே பு³॒த்⁴நியம்॑ பரி॒ஷத்³யக்³க்³॑ ஸ்து॒வந்த॑: ।\n" +
          "அஹிக்³ம்॑ ரக்ஷந்தி॒ நம॑ஸோப॒ஸத்³ய॑ ॥ 26 ॥\n" +
          "\n" +
          "ரேவதீ –\n" +
          "பூ॒ஷா ரே॒வத்யந்வே॑தி॒ பந்தா²᳚ம் ।\n" +
          "பு॒ஷ்டி॒பதீ॑ பஶு॒பா வாஜ॑ப³ஸ்த்யௌ ।\n" +
          "இ॒மாநி॑ ஹ॒வ்யா ப்ரய॑தா ஜுஷா॒ணா ।\n" +
          "ஸு॒கை³ர்நோ॒ யாநை॒ருப॑யாதாம் ய॒ஜ்ஞம் ।\n" +
          "க்ஷு॒த்³ராந் ப॒ஶூந் ர॑க்ஷது ரே॒வதீ॑ ந꞉ ।\n" +
          "கா³வோ॑ நோ॒ அஶ்வா॒க்³ம்॒ அந்வே॑து பூ॒ஷா ।\n" +
          "அந்ந॒க்³ம்॒ ரக்ஷ॑ந்தௌ ப³ஹு॒தா³ விரூ॑பம் ।\n" +
          "வாஜக்³ம்॑ ஸநுதாம்॒ யஜ॑மாநாய ய॒ஜ்ஞம் ॥ 27 ॥\n" +
          "\n" +
          "அஶ்விநீ –\n" +
          "தத³॒ஶ்விநா॑வஶ்வ॒யுஜோப॑யாதாம் ।\n" +
          "ஶுப⁴॒ங்க³மி॑ஷ்டௌ² ஸு॒யமே॑பி⁴॒ரஶ்வை᳚: ।\n" +
          "ஸ்வம் நக்ஷ॑த்ரக்³ம் ஹ॒விஷா॒ யஜ॑ந்தௌ ।\n" +
          "மத்⁴வா॒ஸம்ப்ரு॑க்தௌ॒ யஜு॑ஷா॒ ஸம॑க்தௌ ।\n" +
          "யௌ தே³॒வாநாம்᳚ பி⁴॒ஷஜௌ॑ ஹவ்யவா॒ஹௌ ।\n" +
          "விஶ்வ॑ஸ்ய தூ³॒தாவ॒ம்ருத॑ஸ்ய கோ³॒பௌ ।\n" +
          "தௌ நக்ஷ॒த்ரம் ஜுஜுஷா॒ணோப॑யாதாம் ।\n" +
          "நமோ॒(அ)ஶ்விப்⁴யாம்᳚ க்ருணுமோ(அ)ஶ்வ॒யுக்³ப்⁴யா᳚ம் ॥ 28 ॥\n" +
          "\n" +
          "ப⁴ரணீ –\n" +
          "அப॑ பா॒ப்மாநம்॒ ப⁴ர॑ணீர்ப⁴ரந்து ।\n" +
          "தத்³ய॒மோ ராஜா॒ ப⁴க³॑வா॒ந்॒ விச॑ஷ்டாம் ।\n" +
          "லோ॒கஸ்ய॒ ராஜா॑ மஹ॒தோ ம॒ஹாந் ஹி ।\n" +
          "ஸு॒க³ம் ந॒: பந்தா²॒மப⁴॑யம் க்ருணோது ।\n" +
          "யஸ்மி॒ந்நக்ஷ॑த்ரே ய॒ம ஏதி॒ ராஜா᳚ ।\n" +
          "யஸ்மி॑ந்நேநம॒ப்⁴யஷி॑ஞ்சந்த தே³॒வா꞉ ।\n" +
          "தத³॑ஸ்ய சி॒த்ரக்³ம் ஹ॒விஷா॑ யஜாம ।\n" +
          "அப॑ பா॒ப்மாநம்॒ ப⁴ர॑ணீர்ப⁴ரந்து ॥ 29 ॥\n" +
          "\n" +
          "க்ருஷ்ண சதுர்த³ஶீ –\n" +
          "நி॒வேஶ॑நீ ஸ॒ங்க³ம॑நீ॒ வஸூ॑நாம்॒ விஶ்வா॑ ரூ॒பாணி॒ வஸூ᳚ந்யாவே॒ஶய॑ந்தீ ।\n" +
          "ஸ॒ஹ॒ஸ்ர॒போ॒ஷக்³ம் ஸு॒ப⁴கா³॒ ரரா॑ணா॒ ஸா ந॒ ஆக³॒ந்॒ வர்ச॑ஸா ஸம்விதா³॒நா ॥ 30 ॥\n" +
          "\n" +
          "அமாவாஸ்ய –\n" +
          "யத்தே॑ தே³॒வா அத³॑து⁴ர்பா⁴க³॒தே⁴ய॒மமா॑வாஸ்யே ஸம்॒வஸ॑ந்தோ மஹி॒த்வா ।\n" +
          "ஸா நோ॑ ய॒ஜ்ஞம் பி॑ப்ருஹி விஶ்வவாரே ர॒யிந்நோ॑ தே⁴ஹி ஸுப⁴கே³ ஸு॒வீரம்᳚ ।\n" +
          "\n" +
          "ஓம் ஶாந்தி॒: ஶாந்தி॒: ஶாந்தி॑: ॥\n"),
  'gosuktam': Ashtothram(
      'கோ³ ஸூக்தம்',
      'gosuktam',
      "ஆ கா³வோ॑ அக்³மந்நு॒த ப⁴॒த்³ரம॑க்ர॒ந்த்ஸீத³॑ந்து கோ³॒ஷ்டே² ர॒ணய॑ந்த்வ॒ஸ்மே ।\n" +
          "ப்ர॒ஜாவ॑தீ꞉ புரு॒ரூபா॑ இ॒ஹ ஸ்யு॒ரிந்த்³ரா॑ய பூ॒ர்வீரு॒ஷஸோ॒ து³ஹா॑நா꞉ ॥ 1\n" +
          "\n" +
          "இந்த்³ரோ॒ யஜ்வ॑நே ப்ருண॒தே ச॑ ஶிக்ஷ॒த்யுபேத்³த³॑தா³தி॒ ந ஸ்வம் மு॑ஷாயதி ।\n" +
          "பூ⁴யோ॑பூ⁴யோ ர॒யிமித³॑ஸ்ய வ॒ர்த⁴ய॒ந்நபி⁴॑ந்நே கி²॒ல்யே நி த³॑தா⁴தி தே³வ॒யும் ॥ 2\n" +
          "\n" +
          "ந தா ந॑ஶந்தி॒ ந த³॑பா⁴தி॒ தஸ்க॑ரோ॒ நாஸா॑மாமி॒த்ரோ வ்யதி²॒ரா த³॑த⁴ர்ஷதி ।\n" +
          "தே³॒வாம்ஶ்ச॒ யாபி⁴॒ர்யஜ॑தே॒ த³தா³॑தி ச॒ ஜ்யோகி³த்தாபி⁴॑: ஸசதே॒ கோ³ப॑தி꞉ ஸ॒ஹ ॥ 3\n" +
          "\n" +
          "ந தா அர்வா॑ ரே॒ணுக॑காடோ அஶ்நுதே॒ ந ஸம்॑ஸ்க்ருத॒த்ரமுப॑ யந்தி॒ தா அ॒பி⁴ ।\n" +
          "உ॒ரு॒கா³॒யமப⁴॑யம்॒ தஸ்ய॒ தா அநு॒ கா³வோ॒ மர்த॑ஸ்ய॒ வி ச॑ரந்தி॒ யஜ்வ॑ந꞉ ॥ 4\n" +
          "\n" +
          "கா³வோ॒ ப⁴கோ³॒ கா³வ॒ இந்த்³ரோ॑ ம அச்சா²॒ந் கா³வ॒: ஸோம॑ஸ்ய ப்ரத²॒மஸ்ய॑ ப⁴॒க்ஷ꞉ ।\n" +
          "இ॒மா யா கா³வ॒: ஸ ஜ॑நாஸ॒ இந்த்³ர॑ இ॒ச்சா²மீத்³த்⁴ரு॒தா³ மந॑ஸா சி॒தி³ந்த்³ர॑ம் ॥ 5\n" +
          "\n" +
          "யூ॒யம் கா³॑வோ மேத³யதா² க்ரு॒ஶம் சி॑த³ஶ்ரீ॒ரம் சி॑த்க்ருணுதா² ஸு॒ப்ரதீ॑கம் ।\n" +
          "ப⁴॒த்³ரம் க்³ரு॒ஹம் க்ரு॑ணுத² ப⁴த்³ரவாசோ ப்³ரு॒ஹத்³வோ॒ வய॑ உச்யதே ஸ॒பா⁴ஸு॑ ॥ 6\n" +
          "\n" +
          "ப்ர॒ஜாவ॑தீ꞉ ஸூ॒யவ॑ஸம் ரி॒ஶந்தீ॑: ஶு॒த்³தா⁴ அ॒ப꞉ ஸு॑ப்ரபா॒ணே பிப³॑ந்தீ꞉ ।\n" +
          "மா வ॑: ஸ்தே॒ந ஈ॑ஶத॒ மாக⁴ஶம்॑ஸ॒: பரி॑ வோ ஹே॒தி ரு॒த்³ரஸ்ய॑ வ்ருஜ்யா꞉ ॥ 7\n" +
          "\n" +
          "உபே॒த³மு॑ப॒பர்ச॑நமா॒ஸு கோ³ஷூப॑ ப்ருச்யதாம் ।\n" +
          "உப॑ ருஷ॒ப⁴ஸ்ய॒ ரேத॒ஸ்யுபே॑ந்த்³ர॒ தவ॑ வீ॒ர்யே॑ ॥ 8\n" +
          "\n" +
          "ஓம் ஶாந்தி॒: ஶாந்தி॒: ஶாந்தி॑: ॥\n"),
  'agnisuktam': Ashtothram(
      'அக்³னி ஸூக்தம்',
      'agnisuktam',
      "அ॒க்³நிமீ॑லே பு॒ரோஹி॑தம் ய॒ஜ்ஞஸ்ய॑ தே³॒வம்ரு॒த்விஜ॑ம் ।\n" +
          "ஹோதா॑ரம் ரத்ந॒தா⁴த॑மம் ॥ 1\n" +
          "\n" +
          "அ॒க்³நி꞉ பூர்வே॑பி⁴॒ர்ருஷி॑பி⁴॒ரீட்³யோ॒ நூத॑நைரு॒த ।\n" +
          "ஸ தே³॒வா।ண் ஏஹ வ॑க்ஷதி ॥ 2\n" +
          "\n" +
          "அ॒க்³நிநா॑ ர॒யிம॑ஶ்நவ॒த்போஷ॑மே॒வ தி³॒வேதி³॑வே ।\n" +
          "ய॒ஶஸம்॑ வீ॒ரவ॑த்தமம் ॥ 3\n" +
          "\n" +
          "அக்³நே॒ யம் ய॒ஜ்ஞம॑த்⁴வ॒ரம் வி॒ஶ்வத॑: பரி॒பூ⁴ரஸி॑ ।\n" +
          "ஸ இத்³தே³॒வேஷு॑ க³ச்ச²தி ॥ 4\n" +
          "\n" +
          "அ॒க்³நிர்ஹோதா॑ க॒விக்ர॑து꞉ ஸ॒த்யஶ்சி॒த்ரஶ்ர॑வஸ்தம꞉ ।\n" +
          "தே³॒வோ தே³॒வேபி⁴॒ரா க³॑மத் ॥ 5\n" +
          "\n" +
          "யத³॒ங்க³ தா³॒ஶுஷே॒ த்வமக்³நே॑ ப⁴॒த்³ரம் க॑ரி॒ஷ்யஸி॑ ।\n" +
          "தவேத்தத்ஸ॒த்யம॑ங்கி³ர꞉ ॥ 6\n" +
          "\n" +
          "உப॑ த்வாக்³நே தி³॒வேதி³॑வே॒ தோ³ஷா॑வஸ்தர்தி⁴॒யா வ॒யம் ।\n" +
          "நமோ॒ ப⁴ர॑ந்த॒ ஏம॑ஸி ॥ 7\n" +
          "\n" +
          "ராஜ॑ந்தமத்⁴வ॒ராணாம்॑ கோ³॒பாம்ரு॒தஸ்ய॒ தீ³தி³॑விம் ।\n" +
          "வர்த⁴॑மாநம்॒ ஸ்வே த³மே॑ ॥ 8\n" +
          "\n" +
          "ஸ ந॑: பி॒தேவ॑ ஸூ॒நவே(அ)க்³நே॑ ஸூபாய॒நோ ப⁴॑வ ।\n" +
          "ஸச॑ஸ்வா ந꞉ ஸ்வ॒ஸ்தயே॑ ॥ 9\n"),
  'aayushyasuktam': Ashtothram(
      'ஆயுஷ்ய ஸூக்தம்',
      'aayushyasuktam',
      "யோ ப்³ரஹ்மா ப்³ரஹ்மண உ॑ஜ்ஜஹா॒ர ப்ரா॒ணை꞉ ஶி॒ர꞉ க்ருத்திவாஸா᳚: பிநா॒கீ ।\n" +
          "ஈஶாநோ தே³வ꞉ ஸ ந ஆயு॑ர்த³தா⁴॒து॒ தஸ்மை ஜுஹோமி ஹவிஷா॑ க்⁴ருதே॒ந ॥ 1 ॥\n" +
          "\n" +
          "விப்⁴ராஜமாந꞉ ஸரிர॑ஸ்ய ம॒த்⁴யா॒-த்³ரோ॒ச॒மா॒நோ க⁴ர்மருசி॑ர்ய ஆ॒கா³த் ।\n" +
          "ஸ ம்ருத்யுபாஶாநபநு॑த்³ய கோ⁴॒ரா॒நி॒ஹா॒யு॒ஷே॒ணோ க்⁴ருதம॑த்து தே³॒வ꞉ ॥ 2 ॥\n" +
          "\n" +
          "ப்³ரஹ்மஜ்யோதி-ர்ப்³ரஹ்ம-பத்நீ॑ஷு க³॒ர்ப⁴ம்॒ ய॒மா॒த³॒தா⁴த் புருரூபம்॑ ஜய॒ந்தம் ।\n" +
          "ஸுவர்ணரம்ப⁴க்³ரஹ-ம॑ர்கம॒ர்ச்யம்॒ த॒மா॒யு॒ஷே வர்த⁴யாமோ॑ க்⁴ருதே॒ந ॥ 3 ॥\n" +
          "\n" +
          "ஶ்ரியம் லக்ஷ்மீ-மௌப³லா-மம்பி³காம்॒ கா³ம்॒ ஷ॒ஷ்டீ²ம் ச யா॒மிந்த்³ரஸேநே᳚த்யுதா³॒ஹு꞉ ।\n" +
          "தாம் வித்³யாம் ப்³ரஹ்மயோநிக்³ம்॑ ஸரூ॒பா॒மி॒ஹா॒யு॒ஷே தர்பயாமோ॑ க்⁴ருதே॒ந ॥ 4 ॥\n" +
          "\n" +
          "தா³க்ஷாயண்ய꞉ ஸர்வயோந்ய॑: ஸ யோ॒ந்ய॒: ஸ॒ஹ॒ஸ்ர॒ஶோ விஶ்வரூபா॑ விரூ॒பா꞉ ।\n" +
          "ஸஸூநவ꞉ ஸபதய॑: ஸயூ॒த்²யா॒ ஆ॒யு॒ஷே॒ணோ க்⁴ருதமித³ம்॑ ஜுஷ॒ந்தாம் ॥ 5 ॥\n" +
          "\n" +
          "தி³வ்யா க³ணா ப³ஹுரூபா᳚: புரா॒ணா॒ ஆயுஶ்சி²தோ³ ந꞉ ப்ரமத்²ந॑ந்து வீ॒ராந் ।\n" +
          "தேப்⁴யோ ஜுஹோமி ப³ஹுதா⁴॑ க்⁴ருதே॒ந॒ மா॒ ந॒: ப்ர॒ஜாக்³ம் ரீரிஷோ மோ॑த வீ॒ராந் ॥ 6 ॥\n" +
          "\n" +
          "ஏ॒க॒: பு॒ர॒ஸ்தாத் ய இத³ம்॑ ப³பூ⁴॒வ॒ யதோ ப³பூ⁴வ பு⁴வந॑ஸ்ய கோ³॒பா꞉ ।\n" +
          "யமப்யேதி பு⁴வநக்³ம் ஸா᳚ம்பரா॒யே॒ ஸ நோ ஹவிர்க்⁴ருத-மிஹாயுஷே᳚த்து தே³॒வ꞉ ॥ 7 ॥\n" +
          "\n" +
          "வ॒ஸூ॒ந் ருத்³ரா॑-நாதி³॒த்யாந் மருதோ॑(அ)த² ஸா॒த்⁴யா॒ந் ரு॑பூ⁴ந் ய॒க்ஷா॒ந் க³ந்த⁴ர்வாக்³ஶ்ச பித்ரூக்³ஶ்ச வி॒ஶ்வாந் ।\n" +
          "ப்⁴ருகூ³ந் ஸர்பாக்³ஶ்சாங்கி³ரஸோ॑(அ)த² ஸ॒ர்வா॒ந் க்⁴ரு॒த॒க்³ம் ஹு॒த்வா ஸ்வாயுஷ்யா மஹயா॑ம ஶ॒ஶ்வத் ॥ 8 ॥\n" +
          "\n" +
          "விஷ்ணோ॒ த்வம் நோ॒ அந்த॑ம॒ஶ்ஶர்ம॑யச்ச² ஸஹந்த்ய ।\n" +
          "ப்ரதே॒தா⁴ரா॑ மது⁴॒ஶ்சுத॒ உத்²ஸம்॑ து³ஹ்ரதே॒ அக்ஷி॑தம் ॥\n" +
          "\n" +
          "॥ ஓம் ஶாந்தி॒: ஶாந்தி॒: ஶாந்தி॑: ॥\n"),
  'manthrapushpam': Ashtothram(
      'மந்த்ரபுஷ்பம்',
      'manthrapushpam',
      "யோ॑(அ)பாம் புஷ்பம்॒ வேத³॑ ।\n" +
          "புஷ்ப॑வாந் ப்ர॒ஜாவா᳚ந் பஶு॒மாந் ப⁴॑வதி ।\n" +
          "\n" +
          "ச॒ந்த்³ரமா॒ வா அ॒பாம் புஷ்பம்᳚ ।\n" +
          "புஷ்ப॑வாந் ப்ர॒ஜாவா᳚ந் பஶு॒மாந் ப⁴॑வதி ।\n" +
          "ய ஏ॒வம் வேத³॑ । யோ॑(அ)பாமா॒யத॑நம்॒ வேத³॑ ।\n" +
          "ஆ॒யத॑நவாந் ப⁴வதி ।\n" +
          "\n" +
          "அ॒க்³நிர்வா அ॒பாமா॒யத॑நம் । ஆ॒யத॑நவாந் ப⁴வதி ।\n" +
          "யோ᳚(அ)க்³நேரா॒யத॑நம்॒ வேத³॑ ॥ ஆ॒யத॑நவாந் ப⁴வதி ।\n" +
          "ஆபோ॒ வா அ॒க்³நேரா॒யத॑நம் । ஆ॒யத॑நவாந் ப⁴வதி ।\n" +
          "ய ஏ॒வம் வேத³॑ । யோ॑(அ)பாமா॒யத॑நம்॒ வேத³॑ ।\n" +
          "ஆ॒யத॑நவாந் ப⁴வதி ।\n" +
          "\n" +
          "வா॒யுர்வா அ॒பாமா॒யத॑நம் । ஆ॒யத॑நவாந் ப⁴வதி ।\n" +
          "யோ வா॒யோரா॒யத॑நம்॒ வேத³॑ । ஆ॒யத॑நவாந் ப⁴வதி ।\n" +
          "ஆபோ॒ வை வா॒யோரா॒யத॑நம் । ஆ॒யத॑நவாந் ப⁴வதி ।\n" +
          "ய ஏ॒வம் வேத³॑ । யோ॑(அ)பாமா॒யத॑நம்॒ வேத³॑ ।\n" +
          "ஆ॒யத॑நவாந் ப⁴வதி ।\n" +
          "\n" +
          "அ॒ஸௌ வை தப॑ந்ந॒பாமா॒யத॑நம் । ஆ॒யத॑நவாந் ப⁴வதி ।\n" +
          "யோ॑(அ)முஷ்ய॒ தப॑த ஆ॒யத॑நம்॒ வேத³॑ ।\n" +
          "ஆ॒யத॑நவாந் ப⁴வதி ।\n" +
          "ஆபோ॒ வா அ॒முஷ்ய॒ தப॑த ஆ॒யத॑நம் ॥\n" +
          "\n" +
          "ஆ॒யத॑நவாந் ப⁴வதி ।\n" +
          "ய ஏ॒வம் வேத³॑ । யோ॑(அ)பாமா॒யத॑நம்॒ வேத³॑ ।\n" +
          "ஆ॒யத॑நவாந் ப⁴வதி ।\n" +
          "\n" +
          "ச॒ந்த்³ரமா॒ வா அ॒பாமா॒யத॑நம் । ஆ॒யத॑நவாந் ப⁴வதி ।\n" +
          "யஶ்ச॒ந்த்³ரம॑ஸ ஆ॒யத॑நம்॒ வேத³॑ । ஆ॒யத॑நவாந் ப⁴வதி ।\n" +
          "ஆபோ॒ வை ச॒ந்த்³ரம॑ஸ ஆ॒யத॑நம்। ஆ॒யத॑நவாந் ப⁴வதி ।\n" +
          "ய ஏ॒வம் வேத³॑ । யோ॑(அ)பாமா॒யத॑நம்॒ வேத³॑ ।\n" +
          "ஆ॒யத॑நவாந் ப⁴வதி ।\n" +
          "\n" +
          "நக்ஷ॑த்ராணி॒ வா அ॒பாமா॒யத॑நம் । ஆ॒யத॑நவாந் ப⁴வதி ।\n" +
          "யோ நக்ஷ॑த்ராணாமா॒யத॑நம்॒ வேத³॑ । ஆ॒யத॑நவாந் ப⁴வதி ।\n" +
          "ஆபோ॒ வை நக்ஷ॑த்ராணாமா॒யத॑நம் । ஆ॒யத॑நவாந் ப⁴வதி ।\n" +
          "ய ஏ॒வம் வேத³॑ । யோ॑(அ)பாமா॒யத॑நம்॒ வேத³॑ ।\n" +
          "ஆ॒யத॑நவாந் ப⁴வதி ।\n" +
          "\n" +
          "ப॒ர்ஜந்யோ॒ வா அ॒பாமா॒யத॑நம் । ஆ॒யத॑நவாந் ப⁴வதி ।\n" +
          "ய꞉ ப॒ர்ஜந்ய॑ஸ்யா॒யத॑நம்॒ வேத³॑ । ஆ॒யத॑நவாந் ப⁴வதி ।\n" +
          "ஆபோ॒ வை ப॒ர்ஜந்ய॑ஸ்யா॒(ஆ)யத॑நம் । ஆ॒யத॑நவாந் ப⁴வதி ।\n" +
          "ய ஏ॒வம் வேத³॑ । யோ॑(அ)பாமா॒யத॑நம்॒ வேத³॑ ।\n" +
          "ஆ॒யத॑நவாந் ப⁴வதி ।\n" +
          "\n" +
          "ஸம்॒வ॒த்ஸ॒ரோ வா அ॒பாமா॒யத॑நம் । ஆ॒யத॑நவாந் ப⁴வதி ।\n" +
          "யஸ்ஸம்॑வத்ஸ॒ரஸ்யா॒யத॑நம்॒ வேத³॑ । ஆ॒யத॑நவாந் ப⁴வதி ।\n" +
          "ஆபோ॒ வை ஸம்॑வத்ஸ॒ரஸ்யா॒யத॑நம் । ஆ॒யத॑நவாந் ப⁴வதி ।\n" +
          "ய ஏ॒வம் வேத³॑ । யோ᳚(அ)ப்ஸு நாவம்॒ ப்ரதி॑ஷ்டி²தாம்॒ வேத³॑ ।\n" +
          "ப்ரத்யே॒வ தி॑ஷ்ட²தி ॥\n"),
  'manyusuktam': Ashtothram(
      'மன்யு ஸூக்தம்',
      'manyusuktam',
      "யஸ்தே᳚ ம॒ந்யோ(அ)வி॑த⁴த்³வஜ்ர ஸாயக॒ ஸஹ॒ ஓஜ॑: புஷ்யதி॒ விஶ்வ॑மாநு॒ஷக் ।\n" +
          "ஸா॒ஹ்யாம॒ தா³ஸ॒மார்யம்॒ த்வயா᳚ யு॒ஜா ஸஹ॑ஸ்க்ருதேந॒ ஸஹ॑ஸா॒ ஸஹ॑ஸ்வதா ॥ 01\n" +
          "\n" +
          "ம॒ந்யுரிந்த்³ரோ᳚ ம॒ந்யுரே॒வாஸ॑ தே³॒வோ ம॒ந்யுர்ஹோதா॒ வரு॑ணோ ஜா॒தவே᳚தா³꞉ ।\n" +
          "ம॒ந்யும் விஶ॑ ஈலதே॒ மாநு॑ஷீ॒ர்யா꞉ பா॒ஹி நோ᳚ மந்யோ॒ தப॑ஸா ஸ॒ஜோஷா᳚: ॥ 02\n" +
          "\n" +
          "அ॒பீ⁴᳚ஹி மந்யோ த॒வஸ॒ஸ்தவீ᳚யா॒ந்தப॑ஸா யு॒ஜா வி ஜ॑ஹி॒ ஶத்ரூ॑ந் ।\n" +
          "அ॒மி॒த்ர॒ஹா வ்ரு॑த்ர॒ஹா த³॑ஸ்யு॒ஹா ச॒ விஶ்வா॒ வஸூ॒ந்யா ப⁴॑ரா॒ த்வம் ந॑: ॥ 03\n" +
          "\n" +
          "த்வம் ஹி ம᳚ந்யோ அ॒பி⁴பூ⁴᳚த்யோஜா꞉ ஸ்வய॒ம்பூ⁴ர்பா⁴மோ᳚ அபி⁴மாதிஷா॒ஹ꞉ ।\n" +
          "வி॒ஶ்வச॑ர்ஷணி॒: ஸஹு॑ரி॒: ஸஹா᳚வாந॒ஸ்மாஸ்வோஜ॒: ப்ருத॑நாஸு தே⁴ஹி ॥ 04\n" +
          "\n" +
          "அ॒பா⁴॒க³꞉ ஸந்நப॒ பரே᳚தோ அஸ்மி॒ தவ॒ க்ரத்வா᳚ தவி॒ஷஸ்ய॑ ப்ரசேத꞉ ।\n" +
          "தம் த்வா᳚ மந்யோ அக்ர॒துர்ஜி॑ஹீலா॒ஹம் ஸ்வா த॒நூர்ப³॑ல॒தே³யா᳚ய॒ மேஹி॑ ॥ 05\n" +
          "\n" +
          "அ॒யம் தே᳚ அ॒ஸ்ம்யுப॒ மேஹ்ய॒ர்வாங்ப்ர॑தீசீ॒ந꞉ ஸ॑ஹுரே விஶ்வதா⁴ய꞉ ।\n" +
          "மந்யோ᳚ வஜ்ரிந்ந॒பி⁴ மாமா வ॑வ்ருத்ஸ்வ॒ ஹநா᳚வ॒ த³ஸ்யூ᳚।ண்ரு॒த போ³᳚த்⁴யா॒பே꞉ ॥ 06\n" +
          "\n" +
          "அ॒பி⁴ ப்ரேஹி॑ த³க்ஷிண॒தோ ப⁴॑வா॒ மே(அ)தா⁴᳚ வ்ரு॒த்ராணி॑ ஜங்க⁴நாவ॒ பூ⁴ரி॑ ।\n" +
          "ஜு॒ஹோமி॑ தே த⁴॒ருணம்॒ மத்⁴வோ॒ அக்³ர॑மு॒பா⁴ உ॑பாம்॒ஶு ப்ர॑த²॒மா பி॑பா³வ ॥ 07\n" +
          "\n" +
          "த்வயா᳚ மந்யோ ஸ॒ரத²॑மாரு॒ஜந்தோ॒ ஹர்ஷ॑மாணாஸோ த்⁴ருஷி॒தா ம॑ருத்வ꞉ ।\n" +
          "தி॒க்³மேஷ॑வ॒ ஆயு॑தா⁴ ஸம்॒ஶிஶா᳚நா அ॒பி⁴ ப்ர ய᳚ந்து॒ நரோ᳚ அ॒க்³நிரூ᳚பா꞉ ॥ 01\n" +
          "\n" +
          "அ॒க்³நிரி॑வ மந்யோ த்விஷி॒த꞉ ஸ॑ஹஸ்வ ஸேநா॒நீர்ந॑: ஸஹுரே ஹூ॒த ஏ᳚தி⁴ ।\n" +
          "ஹ॒த்வாய॒ ஶத்ரூ॒ந்வி ப⁴॑ஜஸ்வ॒ வேத³॒ ஓஜோ॒ மிமா᳚நோ॒ வி ம்ருதோ⁴᳚ நுத³ஸ்வ ॥ 02\n" +
          "\n" +
          "ஸஹ॑ஸ்வ மந்யோ அ॒பி⁴மா᳚திம॒ஸ்மே ரு॒ஜந்ம்ரு॒ணந்ப்ர॑ம்ரு॒ணந்ப்ரேஹி॒ ஶத்ரூ॑ந் ।\n" +
          "உ॒க்³ரம் தே॒ பாஜோ᳚ ந॒ந்வா ரு॑ருத்⁴ரே வ॒ஶீ வஶம்᳚ நயஸ ஏகஜ॒ த்வம் ॥ 03\n" +
          "\n" +
          "ஏகோ᳚ ப³ஹூ॒நாம॑ஸி மந்யவீலி॒தோ விஶம்᳚விஶம் யு॒த⁴யே॒ ஸம் ஶி॑ஶாதி⁴ ।\n" +
          "அக்ரு॑த்தரு॒க்த்வயா᳚ யு॒ஜா வ॒யம் த்³யு॒மந்தம்॒ கோ⁴ஷம்᳚ விஜ॒யாய॑ க்ருண்மஹே ॥ 04\n" +
          "\n" +
          "வி॒ஜே॒ஷ॒க்ருதி³ந்த்³ர॑ இவாநவப்³ர॒வோ॒3॒॑(அ)ஸ்மாகம்᳚ மந்யோ அதி⁴॒பா ப⁴॑வே॒ஹ ।\n" +
          "ப்ரி॒யம் தே॒ நாம॑ ஸஹுரே க்³ருணீமஸி வி॒த்³மா தமுத்ஸம்॒ யத॑ ஆப³॒பூ⁴த²॑ ॥ 05\n" +
          "\n" +
          "ஆபூ⁴᳚த்யா ஸஹ॒ஜா வ॑ஜ்ர ஸாயக॒ ஸஹோ᳚ பி³ப⁴ர்ஷ்யபி⁴பூ⁴த॒ உத்த॑ரம் ।\n" +
          "க்ரத்வா᳚ நோ மந்யோ ஸ॒ஹ மே॒த்³யே॑தி⁴ மஹாத⁴॒நஸ்ய॑ புருஹூத ஸம்॒ஸ்ருஜி॑ ॥ 06\n" +
          "\n" +
          "ஸம்ஸ்ரு॑ஷ்டம்॒ த⁴ந॑மு॒ப⁴யம்᳚ ஸ॒மாக்ரு॑தம॒ஸ்மப்⁴யம்᳚ த³த்தாம்॒ வரு॑ணஶ்ச ம॒ந்யு꞉ ।\n" +
          "பி⁴யம்॒ த³தா⁴᳚நா॒ ஹ்ருத³॑யேஷு॒ ஶத்ர॑வ॒: பரா᳚ஜிதாஸோ॒ அப॒ நி ல॑யந்தாம் ॥ 07\n" +
          "\n" +
          "த⁴ந்வ॑நா॒கா³த⁴ந்வ॑நா॒ஜிஞ்ஜ॑யேம॒ த⁴ந்வ॑நா தீ॒வ்ரா꞉ ஸ॒மதோ³᳚ ஜயேம ।\n" +
          "த⁴நு꞉ ஶத்ரோ᳚ரபகா॒மம் க்ரு॑ணோதி॒ த⁴ந்வ॑ நா॒ஸர்வா᳚: ப்ர॒தி³ஶோ᳚ ஜயேம ॥\n" +
          "\n" +
          "ஶாந்தா॑ ப்ருதி²வீ ஶி॑வம॒ந்தரிக்ஷம்॒ த்³யௌர்நோ॒᳚தே³வ்ய(அ)ப⁴॑யந்நோ அஸ்து ।\n" +
          "ஶி॒வா॒ தி³ஶ॑: ப்ர॒தி³ஶ॑ உ॒த்³தி³ஶோ᳚ ந॒(அ)ஆபோ᳚ வி॒ஶ்வத॒: பரி॑பாந்து ஸ॒ர்வத॒: ஶா॒ந்தி॒: ஶா॒ந்தி॒: ஶாந்தி॑: ।\n"),
  'navagrahasuktam': Ashtothram(
      'நவக்³ரஹ ஸூக்தம்',
      'navagrahasuktam',
      "ஓம் ஆஸ॒த்யேந॒ ரஜ॑ஸா॒ வர்த॑மாநோ நிவே॒ஶய॑ந்ந॒ம்ருதம்॒ மர்த்ய॑ஞ்ச ।\n" +
          "ஹி॒ர॒ண்யயே॑ந ஸவி॒தா ரதே²॒நா(ஆ)தே³॒வோ யா॑தி॒பு⁴வ॑நா வி॒பஶ்யந்॑ ॥\n" +
          "அ॒க்³நிம் தூ³॒தம் வ்ரு॑ணீமஹே॒ ஹோதா॑ரம் வி॒ஶ்வவே॑த³ஸம் ।\n" +
          "அ॒ஸ்ய ய॒ஜ்ஞஸ்ய॑ ஸு॒க்ரதும்᳚ ॥\n" +
          "யேஷா॒மீஶே॑ பஶு॒பதி॑: பஶூ॒நாம் சது॑ஷ்பதா³மு॒த ச॑ த்³வி॒பதா³᳚ம் ।\n" +
          "நிஷ்க்ரீ॑தோ॒(அ)யம் ய॒ஜ்ஞியம்॑ பா⁴॒க³மே॑து ரா॒யஸ்போஷா॒ யஜ॑மாநஸ்ய ஸந்து ॥\n" +
          "ஓம் அதி⁴தே³வதா ப்ரத்யதி⁴தே³வதா ஸஹிதாய ஆதி³॑த்யாய॒ நம॑: ॥ 1 ॥\n" +
          "\n" +
          "ஓம் ஆப்யா॑யஸ்வ॒ ஸமே॑து தே வி॒ஶ்வத॑ஸ்ஸோம॒ வ்ருஷ்ணி॑யம் ।\n" +
          "ப⁴வா॒ வாஜ॑ஸ்ய ஸங்க³॒தே² ॥\n" +
          "அ॒ப்ஸுமே॒ ஸோமோ॑ அப்³ரவீத³॒ந்தர்விஶ்வா॑நி பே⁴ஷ॒ஜா ।\n" +
          "அ॒க்³நிஞ்ச॑ வி॒ஶ்வஶ॑ம்பு⁴வ॒மாப॑ஶ்ச வி॒ஶ்வபே⁴॑ஷஜீ꞉ ॥\n" +
          "கௌ³॒ரீ மி॑மாய ஸலி॒லாநி॒ தக்ஷ॒த்யேக॑பதீ³ த்³வி॒பதீ³॒ ஸா சது॑ஷ்பதீ³ ।\n" +
          "அ॒ஷ்டாப॑தீ³॒ நவ॑பதீ³ ப³பூ⁴॒வுஷீ॑\n" +
          "ஸ॒ஹஸ்ரா᳚க்ஷரா பர॒மே வ்யோ॑மந் ॥\n" +
          "ஓம் அதி⁴தே³வதா ப்ரத்யதி⁴தே³வதா ஸஹிதாய ஸோமா॑ய॒ நம॑: ॥ 2 ॥\n" +
          "\n" +
          "ஓம் அ॒க்³நிர்மூ॒ர்தா⁴ தி³॒வ꞉ க॒குத்பதி॑: ப்ருதி²॒வ்யா அ॒யம் ।\n" +
          "அ॒பாக்³ம்ரேதாக்³ம்॑ஸி ஜிந்வதி ॥\n" +
          "ஸ்யோ॒நா ப்ரு॑தி²வி॒ ப⁴வா॑(அ)ந்ருக்ஷ॒ரா நி॒வேஶ॑நீ ।\n" +
          "யச்சா²॑ந॒ஶ்ஶர்ம॑ ஸ॒ப்ரதா²᳚: ॥\n" +
          "க்ஷேத்ர॑ஸ்ய॒ பதி॑நா வ॒யக்³ம்ஹி॒தே நே॑வ ஜயாமஸி ।\n" +
          "கா³மஶ்வம்॑ போஷயி॒த்ந்வா ஸ நோ॑ ம்ருடா³தீ॒த்³ருஶே᳚ ॥\n" +
          "ஓம் அதி⁴தே³வதா ப்ரத்யதி⁴தே³வதா ஸஹிதாய அங்கா³॑ரகாய॒ நம॑: ॥ 3 ॥\n" +
          "\n" +
          "ஓம் உத்³பு³॑த்⁴யஸ்வாக்³நே॒ ப்ரதி॑ஜாக்³ருஹ்யேநமிஷ்டாபூ॒ர்தே ஸக்³ம்ஸ்ரு॑ஜேதா²ம॒யஞ்ச॑ ।\n" +
          "புந॑: க்ரு॒ண்வக்³க்³ஸ்த்வா॑ பி॒தரம்॒ யுவா॑நம॒ந்வாதாக்³ம்॑ஸீ॒த்த்வயி॒ தந்து॑மே॒தம் ॥\n" +
          "இ॒த³ம் விஷ்ணு॒ர்விச॑க்ரமே த்ரே॒தா⁴ நித³॑தே⁴ ப॒த³ம் ।\n" +
          "ஸமூ॑ட⁴மஸ்யபாக்³ம் ஸு॒ரே ॥\n" +
          "விஷ்ணோ॑ ர॒ராட॑மஸி॒ விஷ்ணோ᳚: ப்ரு॒ஷ்ட²ம॑ஸி॒ விஷ்ணோ॒ஶ்ஶ்நப்த்ரே᳚ஸ்தோ²॒ விஷ்ணோ॒ஸ்ஸ்யூர॑ஸி॒ விஷ்ணோ᳚ர்த்⁴ரு॒வம॑ஸி வைஷ்ண॒வம॑ஸி॒ விஷ்ண॑வே த்வா ॥\n" +
          "ஓம் அதி⁴தே³வதா ப்ரத்யதி⁴தே³வதா ஸஹிதாய பு³தா⁴॑ய॒ நம॑: ॥ 4 ॥\n" +
          "\n" +
          "ஓம் ப்³ருஹ॑ஸ்பதே॒ அதி॒யத³॒ர்யோ அர்ஹா᳚த்³த்³யு॒மத்³வி॒பா⁴தி॒ க்ரது॑ம॒ஜ்ஜநே॑ஷு ।\n" +
          "யத்³தீ³॒த³ய॒ச்சவ॑ஸர்தப்ரஜாத॒ தத³॒ஸ்மாஸு॒ த்³ரவி॑ணந்தே⁴ஹி சி॒த்ரம் ॥\n" +
          "இந்த்³ர॑மருத்வ இ॒ஹ பா॑ஹி॒ ஸோமம்॒ யதா²॑ ஶார்யா॒தே அபி॑ப³ஸ்ஸு॒தஸ்ய॑ ।\n" +
          "தவ॒ ப்ரணீ॑தீ॒ தவ॑ ஶூர॒ஶர்ம॒ந்நாவி॑வாஸந்தி க॒வய॑ஸ்ஸுய॒ஜ்ஞா꞉ ॥\n" +
          "ப்³ரஹ்ம॑ஜஜ்ஞா॒நம் ப்ர॑த²॒மம் பு॒ரஸ்தா॒த்³விஸீ॑ம॒தஸ்ஸு॒ருசோ॑ வே॒ந ஆ॑வ꞉ ।\n" +
          "ஸபு³॒த்⁴நியா॑ உப॒மா அ॑ஸ்ய வி॒ஷ்டா²ஸ்ஸ॒தஶ்ச॒ யோநி॒மஸ॑தஶ்ச॒ விவ॑: ॥\n" +
          "ஓம் அதி⁴தே³வதா ப்ரத்யதி⁴தே³வதா ஸஹிதாய ப்³ருஹ॒ஸ்பத॑யே॒ நம॑: ॥ 5 ॥\n" +
          "\n" +
          "ஓம் ப்ரவ॑ஶ்ஶு॒க்ராய॑ பா⁴॒நவே॑ ப⁴ரத்⁴வம் ।\n" +
          "ஹ॒வ்யம் ம॒திம் சா॒க்³நயே॒ ஸுபூ॑தம் ।\n" +
          "யோ தை³வ்யா॑நி॒ மாநு॑ஷா ஜ॒நூக்³ம்ஷி॑ அ॒ந்தர்விஶ்வா॑நி வி॒த்³ம நா॒ ஜிகா³॑தி ॥\n" +
          "இ॒ந்த்³ரா॒ணீமா॒ஸு நாரி॑ஷு ஸு॒பத்நீ॑ம॒ஹம॑ஶ்ரவம் ।\n" +
          "ந ஹ்ய॑ஸ்யா அப॒ரஞ்ச॒ந ஜ॒ரஸா॒ மர॑தே॒ பதி॑: ॥\n" +
          "இந்த்³ரம்॑ வோ வி॒ஶ்வத॒ஸ்பரி॒ ஹவா॑மஹே॒ ஜநே᳚ப்⁴ய꞉ । அ॒ஸ்மாக॑மஸ்து॒ கேவ॑ல꞉ ॥\n" +
          "ஓம் அதி⁴தே³வதா ப்ரத்யதி⁴தே³வதா ஸஹிதாய ஶுக்ரா॑ய॒ நம॑: ॥ 6 ॥\n" +
          "\n" +
          "ஓம் ஶந்நோ॑ தே³॒வீர॒பி⁴ஷ்ட॑ய॒ ஆபோ॑ ப⁴வந்து பீ॒தயே᳚ ।\n" +
          "ஶம்யோர॒பி⁴ஸ்ர॑வந்து ந꞉ ॥\n" +
          "ப்ரஜா॑பதே॒ ந த்வதே³॒தாந்ய॒ந்யோ விஶ்வா॑ ஜா॒தாநி॒ பரி॒தா ப³॑பூ⁴வ ।\n" +
          "யத்கா॑மாஸ்தே ஜுஹு॒மஸ்தந்நோ॑ அஸ்து வ॒யக்³க்³ஸ்யா॑ம॒ பத॑யோ ரயீ॒ணாம் ॥\n" +
          "இ॒மம் ய॑மப்ரஸ்த॒ரமாஹி ஸீதா³(அ)ங்கி³॑ரோபி⁴꞉ பி॒த்ருபி⁴॑ஸ்ஸம்விதா³॒ந꞉ ।\n" +
          "ஆத்வா॒ மந்த்ரா᳚: கவிஶ॒ஸ்தா வ॑ஹந்த்வே॒நா ரா॑ஜந் ஹ॒விஷா॑ மாத³யஸ்வ ॥\n" +
          "ஓம் அதி⁴தே³வதா ப்ரத்யதி⁴தே³வதா ஸஹிதாய ஶநைஶ்ச॑ராய॒ நம॑: ॥ 7 ॥\n" +
          "\n" +
          "ஓம் கயா॑ நஶ்சி॒த்ர ஆபு⁴॑வதூ³॒தீ ஸ॒தா³வ்ரு॑த⁴॒ஸ்ஸகா²᳚ ।\n" +
          "கயா॒ ஶசி॑ஷ்ட²யா வ்ரு॒தா ॥\n" +
          "ஆ(அ)யங்கௌ³꞉ ப்ருஶ்நி॑ரக்ரமீ॒த³ஸ॑நந்மா॒தரம்॒ புந॑: ।\n" +
          "பி॒தர॑ஞ்ச ப்ர॒யந்த்ஸுவ॑: ॥\n" +
          "யத்தே॑ தே³॒வீ நிர்ரு॑திராப³॒ப³ந்த⁴॒ தா³ம॑ க்³ரீ॒வாஸ்வ॑விச॒ர்த்யம் ।\n" +
          "இ॒த³ந்தே॒ தத்³விஷ்யா॒ம்யாயு॑ஷோ॒ ந மத்⁴யா॒த³தா²॑ஜீ॒வ꞉ பி॒தும॑த்³தி⁴॒ ப்ரமு॑க்த꞉ ॥\n" +
          "ஓம் அதி⁴தே³வதா ப்ரத்யதி⁴தே³வதா ஸஹிதாய ராஹ॑வே॒ நம॑: ॥ 8 ॥\n" +
          "\n" +
          "ஓம் கே॒துங்க்ரு॒ண்வந்ந॑கே॒தவே॒ பேஶோ॑ மர்யா அபே॒ஶஸே᳚ ।\n" +
          "ஸமு॒ஷத்³பி⁴॑ரஜாயதா²꞉ ॥\n" +
          "ப்³ர॒ஹ்மா தே³॒வாநாம்᳚ பத³॒வீ꞉ க॑வீ॒நாம்ருஷி॒ர்விப்ரா॑ணாம் மஹி॒ஷோ ம்ரு॒கா³ணா᳚ம் ।\n" +
          "ஶ்யே॒நோக்³ருத்⁴ரா॑ணா॒க்³॒ஸ்வதி⁴॑தி॒ர்வநா॑நா॒க்³ம்॒ ஸோம॑: ப॒வித்ர॒மத்யே॑தி॒ ரேப⁴ந்॑ ॥\n" +
          "ஸசி॑த்ர சி॒த்ரம் சி॒தயந்᳚தம॒ஸ்மே சித்ர॑க்ஷத்ர சி॒த்ரத॑மம் வயோ॒தா⁴ம் ।\n" +
          "ச॒ந்த்³ரம் ர॒யிம் பு॑ரு॒வீரம்᳚ ப்³ரு॒ஹந்தம்॒ சந்த்³ர॑ச॒ந்த்³ராபி⁴॑ர்க்³ருண॒தே யு॑வஸ்வ ॥\n" +
          "ஓம் அதி⁴தே³வதா ப்ரத்யதி⁴தே³வதா ஸஹிதேப்⁴ய꞉ கேது॑ப்⁴யோ॒ நம॑: ॥ 9 ॥\n" +
          "\n" +
          "॥ ஓம் ஆதி³த்யாதி³ நவக்³ரஹ தே³வ॑தாப்⁴யோ॒ நமோ॒ நம॑: ॥\n" +
          "\n" +
          "॥ ஓம் ஶாந்தி॒: ஶாந்தி॒: ஶாந்தி॑: ॥\n"),
  'sarpasuktam': Ashtothram(
      'ஸர்ப ஸூக்தம்',
      'sarpasuktam',
      "நமோ॑ அஸ்து ஸ॒ர்பேப்⁴யோ॒ யே கே ச॑ ப்ருதி²॒வீ மநு॑ ।\n" +
          "யே அ॒ந்தரி॑க்ஷே॒ யே தி³॒வி தேப்⁴ய॑: ஸ॒ர்பேப்⁴யோ॒ நம॑: । (தை।ஸம்।4।2।3)\n" +
          "\n" +
          "யே॑(அ)தோ³ ரோ॑ச॒நே தி³॒வோ யே வா॒ ஸூர்ய॑ஸ்ய ர॒ஶ்மிஷு॑ ।\n" +
          "யேஷா॑ம॒ப்ஸு ஸத³॑: க்ரு॒தம் தேப்⁴ய॑: ஸ॒ர்பேப்⁴யோ॒ நம॑: ।\n" +
          "\n" +
          "யா இஷ॑வோ யாது॒தா⁴நா॑நாம்॒ யே வா॒ வந॒ஸ்பதீ॒க்³ம்॒ ரநு॑ ।\n" +
          "யே வா॑(அ)வ॒டேஷு॒ ஶேர॑தே॒ தேப்⁴ய॑: ஸ॒ர்பேப்⁴யோ॒ நம॑: ।\n" +
          "\n" +
          "இ॒த³க்³ம் ஸ॒ர்பேப்⁴யோ॑ ஹ॒விர॑ஸ்து॒ ஜுஷ்டம்᳚ ।\n" +
          "ஆ॒ஶ்ரே॒ஷா யேஷா॑மநு॒யந்தி॒ சேத॑: ।\n" +
          "யே அ॒ந்தரி॑க்ஷம் ப்ருதி²॒வீம் க்ஷி॒யந்தி॑ ।\n" +
          "தே ந॑ஸ்ஸ॒ர்பாஸோ॒ ஹவ॒மாக³॑மிஷ்டா²꞉ ।\n" +
          "யே ரோ॑ச॒நே ஸூர்ய॒ஸ்யாபி॑ ஸ॒ர்பா꞉ ।\n" +
          "யே தி³வம்॑ தே³॒வீமநு॑ஸ॒ந்சர॑ந்தி ।\n" +
          "யேஷா॑மாஶ்ரே॒ஷா அ॑நு॒யந்தி॒ காமம்᳚ ।\n" +
          "தேப்⁴ய॑ஸ்ஸ॒ர்பேப்⁴யோ॒ மது⁴॑மஜ்ஜுஹோமி ॥ 2 ॥\n" +
          "\n" +
          "நி॒க்⁴ருஷ்வை॑ரஸ॒மாயு॑தை꞉ ।\n" +
          "காலைர்ஹரித்வ॑மாப॒ந்நை꞉ ।\n" +
          "இந்த்³ராயா॑ஹி ஸ॒ஹஸ்ர॑யுக் ।\n" +
          "அ॒க்³நிர்வி॒ப்⁴ராஷ்டி॑வஸந꞉ ।\n" +
          "வா॒யுஶ்வேத॑ஸிகத்³ரு॒க꞉ ।\n" +
          "ஸம்॒வ॒த்²ஸ॒ரோ வி॑ஷூ॒வர்ணை᳚: ।\n" +
          "நித்யா॒ஸ்தே(அ)நுச॑ராஸ்த॒வ ।\n" +
          "ஸுப்³ரஹ்மண்யோக்³ம் ஸுப்³ரஹ்மண்யோக்³ம் ஸு॑ப்³ரஹ்மண்யோக்³ம் ॥ 3 ॥\n" +
          "\n" +
          "ஓம் ஶாந்தி꞉ ஶாந்தி꞉ ஶாந்தி꞉ ॥\n"),
  'pithrusuktam': Ashtothram(
      'பித்ரு ஸூக்தம்',
      'pithrusuktam',
      "உதீ³॑ரதா॒மவ॑ர॒ உத்பரா॑ஸ॒ உந்ம॑த்⁴ய॒மா꞉ பி॒தர॑: ஸோ॒ம்யாஸ॑: ।\n" +
          "அஸும்॒ ய ஈ॒யுர॑வ்ரு॒கா ரு॑த॒ஜ்ஞாஸ்தே நோ॑(அ)வந்து பி॒தரோ॒ ஹவே॑ஷு ॥ 01\n" +
          "\n" +
          "இ॒த³ம் பி॒த்ருப்⁴யோ॒ நமோ॑ அஸ்த்வ॒த்³ய யே பூர்வா॑ஸோ॒ ய உப॑ராஸ ஈ॒யு꞉ ।\n" +
          "யே பார்தி²॑வே॒ ரஜ॒ஸ்யா நிஷ॑த்தா॒ யே வா॑ நூ॒நம் ஸு॑வ்ரு॒ஜநா॑ஸு வி॒க்ஷு ॥ 02\n" +
          "\n" +
          "ஆஹம் பி॒த்ரூந்ஸு॑வி॒த³த்ரா॑ம்ˮ அவித்ஸி॒ நபா॑தம் ச வி॒க்ரம॑ணம் ச॒ விஷ்ணோ॑: ।\n" +
          "ப³॒ர்ஹி॒ஷதோ³॒ யே ஸ்வ॒த⁴யா॑ ஸு॒தஸ்ய॒ ப⁴ஜ॑ந்த பி॒த்வஸ்த இ॒ஹாக³॑மிஷ்டா²꞉ ॥ 03\n" +
          "\n" +
          "ப³ர்ஹி॑ஷத³꞉ பிதர ஊ॒த்ய(1॒॑ )ர்வாகி³॒மா வோ॑ ஹ॒வ்யா ச॑க்ருமா ஜு॒ஷத்⁴வ॑ம் ।\n" +
          "த ஆ க³॒தாவ॑ஸா॒ ஶந்த॑மே॒நாதா²॑ ந॒: ஶம் யோர॑ர॒போ த³॑தா⁴த ॥ 04\n" +
          "\n" +
          "உப॑ஹூதா꞉ பி॒தர॑: ஸோ॒ம்யாஸோ॑ ப³ர்ஹி॒ஷ்யே॑ஷு நி॒தி⁴ஷு॑ ப்ரி॒யேஷு॑ ।\n" +
          "த ஆ க³॑மந்து॒ த இ॒ஹ ஶ்ரு॑வ॒ந்த்வதி⁴॑ ப்³ருவந்து॒ தே॑(அ)வந்த்வ॒ஸ்மாந் ॥ 05\n" +
          "\n" +
          "ஆச்யா॒ ஜாநு॑ த³க்ஷிண॒தோ நி॒ஷத்³யே॒மம் ய॒ஜ்ஞம॒பி⁴ க்³ரு॑ணீத॒ விஶ்வே॑ ।\n" +
          "மா ஹிம்॑ஸிஷ்ட பிதர॒: கேந॑ சிந்நோ॒ யத்³வ॒ ஆக³॑: புரு॒ஷதா॒ கரா॑ம ॥ 06\n" +
          "\n" +
          "ஆஸீ॑நாஸோ அரு॒ணீநா॑மு॒பஸ்தே²॑ ர॒யிம் த⁴॑த்த தா³॒ஶுஷே॒ மர்த்யா॑ய ।\n" +
          "பு॒த்ரேப்⁴ய॑: பிதர॒ஸ்தஸ்ய॒ வஸ்வ॒: ப்ர ய॑ச்ச²த॒ த இ॒ஹோர்ஜம்॑ த³தா⁴த ॥ 07\n" +
          "\n" +
          "யே ந॒: பூர்வே॑ பி॒தர॑: ஸோ॒ம்யாஸோ॑(அ)நூஹி॒ரே ஸோ॑மபீ॒த²ம் வஸி॑ஷ்டா²꞉ ।\n" +
          "தேபி⁴॑ர்ய॒ம꞉ ஸம்॑ரரா॒ணோ ஹ॒வீம்ஷ்யு॒ஶந்நு॒ஶத்³பி⁴॑: ப்ரதிகா॒மம॑த்து ॥ 08\n" +
          "\n" +
          "யே தா॑த்ரு॒ஷுர்தே³॑வ॒த்ரா ஜேஹ॑மாநா ஹோத்ரா॒வித³॒: ஸ்தோம॑தஷ்டாஸோ அ॒ர்கை꞉ ।\n" +
          "ஆக்³நே॑ யாஹி ஸுவி॒த³த்ரே॑பி⁴ர॒ர்வாங் ஸ॒த்யை꞉ க॒வ்யை꞉ பி॒த்ருபி⁴॑ர்க⁴ர்ம॒ஸத்³பி⁴॑: ॥ 09\n" +
          "\n" +
          "யே ஸ॒த்யாஸோ॑ ஹவி॒ரதோ³॑ ஹவி॒ஷ்பா இந்த்³ரே॑ண தே³॒வை꞉ ஸ॒ரத²ம்॒ த³தா⁴॑நா꞉ ।\n" +
          "ஆக்³நே॑ யாஹி ஸ॒ஹஸ்ரம்॑ தே³வவ॒ந்தை³꞉ பரை॒: பூர்வை॑: பி॒த்ருபி⁴॑ர்க⁴ர்ம॒ஸத்³பி⁴॑: ॥ 10\n" +
          "\n" +
          "அக்³நி॑ஷ்வாத்தா꞉ பிதர॒ ஏஹ க³॑ச்ச²த॒ ஸத³॑:ஸத³꞉ ஸத³த ஸுப்ரணீதய꞉ ।\n" +
          "அ॒த்தா ஹ॒வீம்ஷி॒ ப்ரய॑தாநி ப³॒ர்ஹிஷ்யதா²॑ ர॒யிம் ஸர்வ॑வீரம் த³தா⁴தந ॥ 11\n" +
          "\n" +
          "த்வம॑க்³ந ஈலி॒தோ ஜா॑தவே॒தோ³(அ)வா॑ட்³ட⁴॒வ்யாநி॑ ஸுர॒பீ⁴ணி॑ க்ரு॒த்வீ ।\n" +
          "ப்ராதா³॑: பி॒த்ருப்⁴ய॑: ஸ்வ॒த⁴யா॒ தே அ॑க்ஷந்ந॒த்³தி⁴ த்வம் தே³॑வ॒ ப்ரய॑தா ஹ॒வீம்ஷி॑ ॥ 12\n" +
          "\n" +
          "யே சே॒ஹ பி॒தரோ॒ யே ச॒ நேஹ யாம்ஶ்ச॑ வி॒த்³ம யாம்ˮ உ॑ ச॒ ந ப்ர॑வி॒த்³ம ।\n" +
          "த்வம் வே॑த்த²॒ யதி॒ தே ஜா॑தவேத³꞉ ஸ்வ॒தா⁴பி⁴॑ர்ய॒ஜ்ஞம் ஸுக்ரு॑தம் ஜுஷஸ்வ ॥ 13\n" +
          "\n" +
          "யே அ॑க்³நித³॒க்³தா⁴ யே அந॑க்³நித³க்³தா⁴॒ மத்⁴யே॑ தி³॒வ꞉ ஸ்வ॒த⁴யா॑ மா॒த³ய॑ந்தே ।\n" +
          "தேபி⁴॑: ஸ்வ॒ராலஸு॑நீதிமே॒தாம் ய॑தா²வ॒ஶம் த॒ந்வம்॑ கல்பயஸ்வ ॥ 14\n" +
          "\n" +
          "ஓம் ஶாந்தி॒: ஶாந்தி॒: ஶாந்தி॑: ।\n"),
};
